//ภาษาไทย ม.2
class Thai2 {
  final String questionText;
  final List<Answer> answersList;

  Thai2(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<Thai2> getQuestions() {
  List<Thai2> list = [];
  //ADD questions and answer here
  list.add(Thai2(
    "คำสมาสได้แก่คำใด",
    [
      Answer("สุนทรพจน์", true),
      Answer("ผลไม้", false),
      Answer("เทพเจ้า", false),
      Answer("สรรพสินค้า", false),
    ],
  ));

  list.add(Thai2(
    "คำในข้อใดมีวิธีการสร้างคำเหมือนกันทุกคำ",
    [
      Answer("ดีชั่ว หมอฟัน ตกใจ", false),
      Answer("จิตแพทย์ ราชการ วาทศิลป์", true),
      Answer("เรียงเบอร์ ข้าวต้ม สวยงาม", false),
      Answer("ลูกเสือ บ้านเรือน ห่างไกล", false),
    ],
  ));

  list.add(Thai2(
    "ข้อใด ไม่ใช่คำสมาสที่ไม่มีสนธิ",
    [
      Answer("หิมาลัย", false),
      Answer("ธันวาคม", false),
      Answer("พสกนิกร", true),
      Answer("วิทยาลัย", false),
    ],
  ));

  list.add(Thai2(
    "ครูให้ยกตัวอย่างคำที่มาจากภาษาบาลี-สันสกฤต เด็กหญิงเหมียวยกตัวอย่างคำว่า ปรัชญา การที่เด็กหญิงเหมียวยกตัวอย่างคำนี้ แสดงว่าเด็กหญิงเหมียวใช้หลักสังเกตคำบาลี-สันสกฤตข้อใด",
    [
      Answer("เป็นคำหลายพยางค์", false),
      Answer("เป็นคำที่สร้างโดยวิธีสมาส", false),
      Answer("เป็นคำที่นำมาใช้ในวรรณคดี", false),
      Answer("เป็นคำที่มีอักษรควบ", true),
    ],
  ));
  list.add(Thai2(
    "คำที่มาจากภาษาจีน นำมาใช้ในด้านใดมากที่สุด",
    [
      Answer("ศาสนา", false),
      Answer("วัฒนธรรมประเพณี", false),
      Answer("วรรณคดีและวรรณกรรม", false),
      Answer("การค้าพาณิช", true),
    ],
  ));
  list.add(Thai2(
    "คำที่มาจากภาษาเขมร นำมาใช้ในด้านใดมากที่สุด",
    [
      Answer("วัฒนธรรมประเพณี", true),
      Answer("ศาสนา", false),
      Answer("การค้าพาณิช", false),
      Answer("วรรณคดีและวรรณกรรม", false),
    ],
  ));
  list.add(Thai2(
    "คำราชาศัพท์ มีระเบียบการใช้อย่างไร",
    [
      Answer("ใช้เพื่อยกย่องบุคคลตามระดับชั้นแห่งความนับถือ", false),
      Answer("ใช้เพื่อแสดงความจงรักภักดีต่อพระมหากษัตริย์", false),
      Answer("ใช้ให้ถูกต้องเหมาะสมกับระดับชั้นของบุคคล", true),
      Answer("ใช้ให้เหมาะสมตามระดับชั้นผู้ใหญ่ซึ่งสังคมยกย่องนับถือ", false),
    ],
  ));
  list.add(Thai2(
    "ถ้าคำใดมีคำว่า “พระบรม” นำหน้า แสดงว่าคำนั้นมีคุณลักษณะอย่างไร",
    [
      Answer("เป็นคำสำคัญ", false),
      Answer(" เป็นคำที่มีอำนาจ ", false),
      Answer("เป็นคำที่ยิ่งใหญ่", false),
      Answer("เป็นสิ่งสำคัญที่ควรแก่การยกย่อง", true),
    ],
  ));
  list.add(Thai2(
    " คำใดใช้ทรงถูกต้อง",
    [
      Answer("ทรงบรรทม", false),
      Answer("ทรงประชวร", false),
      Answer("ทรงดนตรี", true),
      Answer("ทรงทอดพระเนตร", false),
    ],
  ));
  list.add(Thai2(
    "เครื่องใช้ที่จำเป็นสำหรับพระสงฆ์ เรียกว่าอย่างไร",
    [
      Answer("จีวร", false),
      Answer("อาสนะ", false),
      Answer("อัฐบริขาร", true),
      Answer("รัดประคด", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดกล่าวถึงคณะของกลอนสุภาพได้ถูกต้องที่สุด",
    [
      Answer("บทหนึ่งมี 2 คำกลอน หรือ 4 วรรค วรรคหนึ่ง มี 8 คำ", false),
      Answer("บทหนึ่งมี 4 คำกลอน หรือ 2 วรรค วรรคหนึ่งมี 7-9 คำ", false),
      Answer("บทหนึ่งมี 2 คำกลอน หรือ 4 วรรค วรรคหนึ่งมี 7-9 คำ", true),
      Answer("บทหนึ่งมี 4 คำกลอน หรือ 2 วรรค วรรคหนึ่งมี 8 คำ", false),
    ],
  ));
  list.add(Thai2(
    "ลักษณะบังคับของกลอนสุภาพในเรื่องใดที่ไม่ได้มีการบังคับใช้ เป็นแต่เพียงความนิยม",
    [
      Answer("สัมผัส", false),
      Answer("เสียงวรรณยุกต์", true),
      Answer("ความยาว", false),
      Answer("บทหนึ่งมี 2 คำกลอน หรือ 4 วรรค วรรคหนึ่งมี 7-9 คำ", false),
    ],
  ));
  list.add(Thai2(
    "การเรียงลำดับวรรคในการแต่งกลอนสุภาพให้เรียงอย่างไร",
    [
      Answer("วรรคสดับ วรรครับ วรรคส่ง วรรครอง", false),
      Answer("วรรคสดับ วรรครอง วรรครับ วรรคส่ง", false),
      Answer("วรรคสดับ วรรครับ วรรครอง วรรคส่ง", true),
      Answer("วรรคสดับ วรรคส่ง วรรครับ วรรครอง", false),
    ],
  ));
  list.add(Thai2(
    "ข้อความใดมีสัมผัสอักษรมากที่สุด",
    [
      Answer("ชีวิตนี้ไม่มีอะไรดอก", false),
      Answer("ยุรยาตรย่างยามงามสง่า", true),
      Answer("หมั่นฝักใฝ่ไตร่ตรองมองมรรคผล", false),
      Answer("องค์อ่อนช้อยลอยเลื่อนเคลื่อนกายา", false),
    ],
  ));
  list.add(Thai2(
    "ข้อความใดมีสัมผัสสระมากที่สุด",
    [
      Answer("ชีวิตนี้ไม่มีอะไรดอก", false),
      Answer("หมั่นฝักใฝ่ไตร่ตรองมองมรรคผล", false),
      Answer("องค์อ่อนช้อยลอยเลื่อนเคลื่อนกายา", true),
      Answer("ยุรยาตรย่างยามงามสง่า", false),
    ],
  ));
  list.add(Thai2(
    " ข้อใดมีพยางค์ต่างจากข้ออื่น",
    [
      Answer("บ้าน", true),
      Answer("สมุด", false),
      Answer("ดินสอ", false),
      Answer("ยางลบ", false),
    ],
  ));
  list.add(Thai2(
    "พยางค์ใดมีองค์ประกอบแตกต่างจากพยางค์อื่น",
    [
      Answer("ดิน", false),
      Answer("ลม", false),
      Answer("เมฆ", false),
      Answer("ฟ้า", true),
    ],
  ));
  list.add(Thai2(
    "“ปฏิบัติงาน” มีกี่คำ กี่พยางค์",
    [
      Answer("1 คำ 4 พยางค์", false),
      Answer("1 คำ 5 พยางค์", false),
      Answer(" 2 คำ 5 พยางค์", false),
      Answer("2 คำ 4 พยางค์", true),
    ],
  ));
  list.add(Thai2(
    "คำใดมีจำนวนพยางค์เท่ากับคำว่า “มาตรฐาน”",
    [
      Answer("ภาษาถิ่น", true),
      Answer("อดีตกาล", false),
      Answer("อิสรภาพ", false),
      Answer("เจตนารมณ์", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดเป็นประโยค",
    [
      Answer("เด็กผู้หญิงทำงานฝีมือ", true),
      Answer("กล้องถ่ายรูปดิจิตอล", false),
      Answer("ภาพวาดธรรมชาติสวยหรู", false),
      Answer("ความสนุกสนานในเทศกาลสงกานต์", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดไม่เป็นประโยค",
    [
      Answer("พระอาทิตย์ตก", false),
      Answer("หน้าหนาวหมอกหนา", true),
      Answer("ท้องฟ้ามืดครึ้ม", false),
      Answer("น้ำค้างตกบนยอดหญ้า", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดเป็นประโยคไม่มีกรรม",
    [
      Answer("เขาหยิบกระดาษมาซับน้ำมัน", false),
      Answer("ใบไม้ร่วงลงพื้น", true),
      Answer("เด็ก ๆ ควรดื่มนมทุกวัน", false),
      Answer("แม่ค้ายกถังไอศกรีมวางบนโต๊ะ", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดเป็นประโยคคำถาม",
    [
      Answer("ถึงอย่างไรเราก็ไม่ทิ้งเขา", false),
      Answer("เธอจะมาหาฉันเมื่อไหร่ก็ได้", false),
      Answer("เธอจะไม่บอกฉันสักคำหรือ", true),
      Answer("ใครใครก็อยากมีเพื่อนด", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดคือลักษระของประโยคความรวม",
    [
      Answer("มีใจความสำคัญเพียงในความเดียว", false),
      Answer("ประกอบด้วยประโยคความเดียวที่มีใจความ แยกจากกัน", false),
      Answer(
          "ประกอบด้วยประโยคความเดียว 2 ประโยคที่มี ใจความเป็นเอกเทศและเชื่อมกันด้วยสันธาน",
          true),
      Answer("ประกอบด้วยประโยคหลักและประโยคย่อย", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดเป็นประโยคความรวมง",
    [
      Answer("สุนทรภู่แต่งนิราศภูเขาทอง", false),
      Answer("เธอเชื่อคำสั่งสอนของยายซึ่งเป็นผู้มีพระคุณ", false),
      Answer("เธอจะเดินกลับบ้านหรือนั่งรถเมล์กลับบ้าน", true),
      Answer("ชาวบ้านหันมาให้ความสนใจเรื่องสิ่งแวดล้อมมากขึ้น", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดไม่ใช่ลักษณะของคำไทยแท้",
    [
      Answer("ป็นคำโดด", false),
      Answer("มีตัวสะกดตรงตามมาตรา", false),
      Answer("ไม่มีข้อใดถูก", false),
      Answer("แปลความหมายจากด้านหลัง", true),
    ],
  ));
  list.add(Thai2(
    "คำว่า “กิน” เป็นคาไทยแท้เพราะมีคุณสมบัติตรงกับข้อใด",
    [
      Answer("เป็นคำโดด", false),
      Answer("ใช้ตัวสะกดตรงตามมาตรา", true),
      Answer("ทำหน้าที่ได้หลายอย่าง", false),
      Answer("มีหลายความหมาย", false),
    ],
  ));
  list.add(Thai2(
    "คำในข้อใดเป็นคำไทยแท้ทุกคำ",
    [
      Answer("สดใส ตะวัน ใบตอง", true),
      Answer("เจริญ ก๊อก กำลัง", false),
      Answer("กาแฟ โกโก้ ใบชา", false),
      Answer("กอล์ฟ เทนนิส ตะกร้อ", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดมาจากคำภาษาอังกฤษทุกคำ",
    [
      Answer("เชิ๊ต สูท ยีนส์", true),
      Answer("โค้ช กระบอง ฟุตบอล", false),
      Answer("เต้นท์ กระโจม แคมป์", false),
      Answer("หวย สบู่ เลหลัง", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดเป็นคำที่มาจากภาษาจีนทุกคำ",
    [
      Answer("ต้าหู้ ก๋วยเตี๋ยว บะหมี่", true),
      Answer("ตั๋ว เช็ค พาสปอร์ต", false),
      Answer("โกโก้ โอเลี้ยง กาแฟ", false),
      Answer("ขนุน แอปเปิ้ล ทุเรียน", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดควรกล่าวเป็นอันดับแรกของการพูดในโอกาสต่างๆ",
    [
      Answer("กล่าวขอบคุณ", false),
      Answer("กล่าวสรรเสริญ", false),
      Answer("กล่าวทักทาย", true),
      Answer("กล่าวเชื้อเชิญ", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดไม่ควรกล่าวถึงในการกล่าวอวยพร",
    [
      Answer("ขออภัยที่ไม่ทันได้เตรียมตัว", true),
      Answer("ให้พรอย่างจริงใจ", false),
      Answer(" ความสัมพันธ์ของผู้กล่าวกับผู้พูด", false),
      Answer("ให้คติหรือข้อคิดในการดำเนินชีวิต", false),
    ],
  ));
  list.add(Thai2(
    "ข้อใดไม่เกี่ยวข้องกับการเตรียมพูดเสนอรายงาน",
    [
      Answer("เตรียมผู้ฟัง", true),
      Answer("เตรียมสถานที่ อุปกรณ์", false),
      Answer("เตรียมเอกสาร", false),
      Answer("เตรียมจัดลำดับเนื้อหา", false),
    ],
  ));
  return list;
}
