//วิทยาศาสตร์ ม.5
class sic5 {
  final String questionText;
  final List<Answer> answersList;

  sic5(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<sic5> getQuestions() {
  List<sic5> list = [];
  //ADD questions and answer here
  list.add(sic5(
    "ไฮโดรเจนเป็นธาตุที่พบว่ามี 7 ไอโซโทป ไฮโดรเจนทั้ง 7 ไอโซโทปนี้มีจำนวนอนุภาคใดแตกต่างกั",
    [
      Answer("นิวตรอน", true),
      Answer("โปรตอน", false),
      Answer("อิเล็กตรอน", false),
      Answer("โปรตอนและนิวตรอน", false),
    ],
  ));

  list.add(sic5(
    "ไอโอดีน-131 จำนวน 0.16 ไมโครกรัม เมื่อเวลาผ่านไป 32 วัน จะเหลือไอโอดีน-131 เพียง 0.01 ไมโครกรัม ครึ่งชีวิตของไอโอดีน-131 เป็นกี่วัน",
    [
      Answer("2", false),
      Answer("8", true),
      Answer("4", false),
      Answer("16", false),
    ],
  ));

  list.add(sic5(
    "ในปฏิกิริยานิวเคลียร์ ถ้ามวลอะตอมรวมหลังเกิดปฏิกิริยานิวเคลียร์มีค่าลดลง 1 กรัม จะเกิดพลังงานนิวเคลียร์กี่จูล",
    [
      Answer("3 x 10^5", false),
      Answer("3 x 10^8", false),
      Answer("9 x 101^3", true),
      Answer("9 x 10^16", false),
    ],
  ));

  list.add(sic5(
    "แพทย์ใช้ไอโอดีน-131 ในการวินิจฉัยโรคเกี่ยวกับต่อมไทรอยด์ ข้อความใดกล่าวถึงไอโอดีน-131 ถูกต้อง",
    [
      Answer("ไอโอดีน-131 มีครึ่งชีวิตยาวนาน", false),
      Answer("การผลิตไอโอดีน-131 ทำได้ง่ายและราคาถูก", false),
      Answer("ร่างกายดูดซึมไอโอดีน-131 ได้ดีกว่าไอโอดีนปกติ", false),
      Answer("ไอโอดีน-131 มีสมบัติทางเคมีเหมือนกับไอโอดีนปกติ", true),
    ],
  ));
  list.add(sic5(
    "นักวิทยาศาสตร์หาอายุซากสิ่งมีชีวิตโดยใช้การสลายของคาร์บอน-14 เพราะสมบัติใดของคาร์บอน-14",
    [
      Answer("ในธรรมชาติมีปริมาณคาร์บอน-14 มากกว่าคาร์บอน-12", false),
      Answer(
          "เมื่อยังมีชีวิตปริมาณคาร์บอน-14 ของสิ่งมีชีวิตจะเพิ่มขึ้นเรื่อย ๆ",
          false),
      Answer("ซากสิ่งมีชีวิตจะมีปริมาณคาร์บอน-14 คงเดิม", false),
      Answer("คาร์บอน-14 มีครึ่งชีวิตประมาณ 5,000-6,000 ปี", true),
    ],
  ));
  list.add(sic5(
    "ในปัจจุบันมีการส่งเสริมและจำหน่ายแหนมอาบรังสีให้ประชาชนบริโภค เพราะเหตุใด",
    [
      Answer("แหนมอาบรังสีสามารถรับประทานสด ๆ ได้", true),
      Answer("แหนมอาบรังสีมีรสชาติดีกว่าแหนมทั่ว ๆ ไป", false),
      Answer("แหนมอาบรังสีมีปริมารไขมันน้อยกว่าแหนมทั่ว ๆ ไป", false),
      Answer("แหนมอาบรังสีปลอดจากสารพิษตกค้าง", false),
    ],
  ));
  list.add(sic5(
    "เราไม่สามารถสัมผัสหรือมองเห็นกัมมันตภาพรังสีได้ แต่เราสามารถวัดกัมมันตภาพรังสีได้ ข้อใดคือสมบัติของกัมมันตภาพรังสีที่นักวิทยาศาสตร์นำมาใช้ในการสร้างเครื่องวัด",
    [
      Answer("การเบี่ยงเบนในสนามไฟฟ้า", false),
      Answer("การเบี่ยงเบนในสนามแม่เหล็ก", false),
      Answer("การทำให้ตัวกลางแตกตัวเป็นไอออน", true),
      Answer("ความสามารถในการทะลุเข้าไปในตัวกลาง", false),
    ],
  ));
  list.add(sic5(
    "ซีเวิร์ตเป็นหน่วยวัดปริมาณกัมมันตภาพรังสีประเภทใด",
    [
      Answer("การสลายของสารกัมมันตรังสี", false),
      Answer("การแตกตัวของอากาศเมื่อได้รับรังสี", false),
      Answer("การดูดกลืนพลังงานของวัตถุเมื่อได้รับรังสี", false),
      Answer("การดูดกลืนรังสีของเนื้อเยื่อหรืออวัยวะมนุษย์", true),
    ],
  ));
  list.add(sic5(
    "ลักษณะที่สำคัญที่สุดของสิ่งมีชีวิต คือข้อใด",
    [
      Answer("Order", false),
      Answer("Adaptation", false),
      Answer("Reproduction", true),
      Answer("Growth", false),
    ],
  ));
  list.add(sic5(
    "นักเรียนกลุ่มหนึ่งทำการศึกษาหัวของแมลงชนิดต่างๆ โดยใช้กล้องจุลทรรศน์ กล้องจุลทรรศน์ชนิดใดถ้านักเรียนเลือกนำมาใช้แล้วจะเห็นภาพของหัวแมลงเป็นภาพเสมือนข้างเดียวกับวัตถุ แต่เป็นภาพ 3 มิติ",
    [
      Answer("กล้องจุลทรรศน์แบบเลนส์ประกอบ", false),
      Answer("กล้องจุลทรรศน์แบบ TEM", false),
      Answer("กล้องจุลรรศน์แบบสเตอริโอ", true),
      Answer("กล้องจุลทรรศน์แบบ SEM", false),
    ],
  ));
  list.add(sic5(
    "พันธะที่เชื่อมระหว่างน้ำตาลโมเลกุลคู่ คือข้อใด",
    [
      Answer("พันธะไฮโดรเจน", false),
      Answer("พันธะโคเวเลนต์", false),
      Answer("พันธะไกลโคซิดิก", true),
      Answer("พันธะฟอสโฟไดเอสเทอร์", false),
    ],
  ));
  list.add(sic5(
    "สิ่งมีชีวิตพวกใดที่มีกระบวนการสังเคราะห์ทางเคมีที่เรียกว่า Chemosynthesis",
    [
      Answer("รา", false),
      Answer("แบคทีเรีย", true),
      Answer("ไวรัส", false),
      Answer("ไดอะตอม", false),
    ],
  ));
  list.add(sic5(
    "พลังงานทั้งหมดที่ได้จากการสลายกลูโคสของเซลล์กล้ามเนื้อเป็นเท่าใด",
    [
      Answer("38", false),
      Answer("37", false),
      Answer("36", true),
      Answer("34", false),
    ],
  ));
  list.add(sic5(
    "Leucoplast ที่ใช้สะสมอาหาร เช่น แป้ง จัดเป็นข้อใด",
    [
      Answer("แวคิวโอล", false),
      Answer("พลาสติด", true),
      Answer("กลอจิบอดี", false),
      Answer("ไรโบโซม", false),
    ],
  ));
  list.add(sic5(
    "จำนวนของโครมาตินของมนุษย์ในเซลล์ร่างกายมีทั้งหมดเท่าใด",
    [
      Answer("46 คู่", false),
      Answer("23 แท่ง", false),
      Answer("46 แท่ง", true),
      Answer("22 คู่", false),
    ],
  ));
  list.add(sic5(
    "Chyme พบที่ใด",
    [
      Answer("กระเพาะ", true),
      Answer("ปาก", false),
      Answer("ลำไส้", false),
      Answer("ตับอ่อน", false),
    ],
  ));
  list.add(sic5(
    "ข้อใดเป็นลักษณะหัวใจของสัตว์ครึ่งบกครึ่งน้ำ",
    [
      Answer("มีหัวใจ 3 ห้อง ห้องบน 1 ห้องล่าง 2", false),
      Answer("มีหัวใจ 2 ห้อง ห้องบน 1 ห้องล่าง 1", false),
      Answer("มีหัวใจ 4 ห้องไม่สมบูรณ์", false),
      Answer("มีหัวใจ 3 ห้อง ห้องบน 2 ห้องล่าง 1", true),
    ],
  ));
  list.add(sic5(
    "อวัยวะในข้อใดที่พัฒนามาจาก เนื่อเยื่อชั้นมีโซเดิร์ม",
    [
      Answer("ปาก", false),
      Answer("กระเพาะปัสสาวะ", false),
      Answer("ขน", false),
      Answer("กระดูก", true),
    ],
  ));
  list.add(sic5(
    "ดาราศาสตร์คือวิชาที่ศึกษาเกี่ยวกับอะไร",
    [
      Answer("ดวงดาว", false),
      Answer("ดวงดาวต่างๆ และโลก", false),
      Answer("ระบบสุริยะ", false),
      Answer("ดวงดาว เนบิวลา และกาแล็กซี", true),
    ],
  ));
  list.add(sic5(
    "ข้อใดเรียงลำดับขนาดของดาวเคราะห์จากใหญ่ไปหาเล็กได้ถูกต้อง",
    [
      Answer("ดาวศุกร์ > ดาวอังคาร > ดาวพุธ", true),
      Answer("ดาวเนปจูน > ดาวยูเรนัส > ดาวเสาร์", false),
      Answer("โลก > ดาวเนปจูน > ดาวพลูโต", false),
      Answer("ดาวพฤหัสบดี > ดาวอังคาร > ดาวศุกร์", false),
    ],
  ));
  list.add(sic5(
    "ข้อใดส่งผลต่อการเกิดปรากฏการณ์กลางวันและกลางคืน",
    [
      Answer("ดวงจันทร์โคจรรอบโลก", false),
      Answer("การหมุนรอบตัวเองของโลก", true),
      Answer("โลกโคจรรอบดวงอาทิตย์", false),
      Answer("การหมุนรอบตัวเองของดวงจันทร์", false),
    ],
  ));
  list.add(sic5(
    "ข้อใดกล่าวถึงดวงจันทร์",
    [
      Answer("ดวงจันทร์ไม่มีบรรยากาศห่อหุ้ม มีแสงสว่างในตัวเอง", false),
      Answer("ดวงจันทร์ไม่มีบรรยากาศห่อหุ้ม ไม่มีแสงสว่างในตัวเอง", true),
      Answer("ดวงจันทร์มีบรรยากาศห่อหุ้ม ไม่มีแสงสว่างในตัวเอง", false),
      Answer("ดวงจันทร์มีบรรยากาศห่อหุ้ม มีแสงสว่างในตัวเอง", false),
    ],
  ));
  list.add(sic5(
    "ปรากฏการณ์น้ำขึ้นน้ำลง  เกิดจากอิทธิพลในข้อใด",
    [
      Answer("แรงดึงดูดระหว่างโลก  ดวงจันทร์  ดวงอาทิตย์", false),
      Answer("แรงดึงดูดระหว่างดวงจันทร์  ดวงอาทิตย์", false),
      Answer("แรงดึงดูดระหว่างโลก  ดวงอาทิตย์", false),
      Answer("แรงดึงดูดระหว่างดวงจันทร์  โลก", true),
    ],
  ));
  list.add(sic5(
    "การโคจรระหว่าง  ดวงอาทิตย์  โลก  ดวงจันทร์  ในลักษณะใดที่ส่งผลต่อปรากฏการณ์สุริยุปราคา",
    [
      Answer("โลก  ดวงอาทิตย์  ดวงจันทร์", false),
      Answer("ดวงอาทิตย์  โลก  ดวงจันทร์", false),
      Answer("โลก  ดวงจันทร์  ดวงอาทิตย์", true),
      Answer("ดวงจันทร์  ดวงอาทิตย์  โลก", false),
    ],
  ));
  list.add(sic5(
    "การหมุนรอบตัวเองของโลกไม่ทำให้เกิดปรากฏการณ์ในข้อใด",
    [
      Answer("ทิศ", false),
      Answer("น้ำขึ้น - น้ำลง", true),
      Answer("ประเทศญี่ปุ่นสว่างเร็วกว่าประเทศไทย", false),
      Answer("การขึ้น - ตกของดวงดาว", false),
    ],
  ));
  list.add(sic5(
    "ถ้าเปรียบเทียบความแตกต่างระหว่างดาวฤกษ์ และดาวเคราะห์ข้อใดกล่าวไม่ถูกต้อง",
    [
      Answer("ดาวฤกษ์ เห็นแสงกระพริบ ดาวเคราะห์ เห็นแสงนิ่งไม่กระพริบ", false),
      Answer("ดาวฤกษ์ มีขนาดใหญ่ ดาวเคราะห์ มีขนาดเล็ก", false),
      Answer("ดาวฤกษ์ อยู่โดดๆ ดาวเคราะห์ อยู่เป็นกลุ่ม", false),
      Answer("ดาวฤกษ์ มีจำนวนมาก ดาวเคราะห์ มีจำนวนน้อย", true),
    ],
  ));
  list.add(sic5(
    "กาแล็กซีเพื่อนบ้านที่มองเห็นได้ด้วยตาเปล่า ได้แก่",
    [
      Answer("กาแล็กซีแอนโดรเมดา", false),
      Answer("ถูกทุกข้อ", true),
      Answer("แมกเจลแลนใหญ่", false),
      Answer("แมกเจลแลนเล็ก", false),
    ],
  ));
  list.add(sic5(
    "เมื่อเปรียบเทียบสนามความโน้มถ่วงบนผิวโลกที่กรุงจาการ์ตา กรุงเทพ ฯ และกรุงปักกิ่ง ข้อความใดต่อไปนี้ถูกต้อง",
    [
      Answer("สนามความโน้มถ่วงทั้ง  3  ตำแหน่งมีค่าเท่ากัน", false),
      Answer("สนามโน้มถ่วงที่กรุงเทพ ฯ น้อยกว่าที่กรุงจาการ์ตา", false),
      Answer("สนามโน้มถ่วงที่กรุงปักกิ่งมีค่ามากที่สุด", true),
      Answer("สนามโน้มถ่วงที่กรุงจาการ์ตามีค่ามากที่สุด", false),
    ],
  ));
  list.add(sic5(
    "เมื่อโยนก้อนหินขึ้นไปในแนวดิ่ง  ข้อความใดถูกต้องเกี่ยวกับก้อนหินก้อนนี้",
    [
      Answer("ก้อนหินที่เคลื่อนที่ด้วยความเร่ง  9.8  เมตรต่อ(วินาที)^2", true),
      Answer(
          "ก้อนหินที่เคลื่อนที่ขึ้นในแนวดิ่งจะมีความเร็วลดลง  9.8  เมตรต่อวินาที",
          false),
      Answer("ก้อนหินจะมีแรงโน้มถ่วงกระทำ  9.8  นิวตัน", false),
      Answer("ก้อนหินอยู่ในสนามโน้มถ่วงของโลกมีค่า  9.8  นิวตันต่อเมตร", false),
    ],
  ));
  list.add(sic5(
    "ตุ้มน้ำหนักที่ใช้กับเครื่องชั่งอันหนึ่งมีข้อความ “200 g ” เขียนกำกับไว้  ข้อใดถูกต้องเกี่ยวกับตุ้มน้ำหนักนี้",
    [
      Answer("ตุ้มน้ำหนักมีน้ำหนัก  0.2  กิโลกรัม", false),
      Answer("ตุ้มน้ำหนักมีมวล  19.6  นิวตัน", false),
      Answer("ตุ้มน้ำหนักมีน้ำหนัก  19.6  นิวตัน", false),
      Answer("มีแรงโน้มถ่วง  1.96  นิวตัน กระทำต่อตุ้มน้ำหนัก", true),
    ],
  ));
  list.add(sic5(
    "ว่าวเป็นของเล่นที่เกี่ยวข้องกับสนามโน้มถ่วงกับศิลปะบนท้องฟ้าโดยการทำให้เกิดแรงพยุงว่าวมากกว่าแรงโน้มถ่วง  แรงพยุงว่าวนี้เกิดจากอะไร",
    [
      Answer("อากาศใกล้พื้นดินร้อนกว่าอากาศในระดับสูง", false),
      Answer("แรงลมมีค่ามากกว่าน้ำหนักของว่าว", false),
      Answer("ความเร็วของกระแสอากาศด้านบนและด้านล่างของว่าวไม่เท่ากัน", true),
      Answer("แรงดึงเชือกเท่ากับแรงลมที่กระทำต่อว่าว", false),
    ],
  ));
  list.add(sic5(
    "ถ้ามีอนุภาคอิเล็กตรอนตกลงในแนวดิ่งบริเวณศูนย์สูตรของโลก  อนุภาคอิเล็กตรอนจะเคลื่อนที่อย่างไร",
    [
      Answer("ตกลงในแนวดิ่งเหมือนเดิมแต่มีความเร็วเพิ่มขึ้น", false),
      Answer("ตกลงในแนวดิ่งเหมือนเดิมแต่มีความเร็วลดลง", false),
      Answer("เคลื่อนที่เบนไปทางทิศตะวันตก", true),
      Answer("เคลื่อนที่เบนไปทางทิศเหนือ", false),
    ],
  ));
  list.add(sic5(
    "อนุภาคไฟฟ้าที่มีพลังงานสูงจากลมสุริยะไม่สามารถเดินทางมาสู่พื้นโลกได้  เนื่องจากโลกมีสิ่งใด",
    [
      Answer(" สนามแม่เหล็ก", true),
      Answer(" บรรยากาศ", false),
      Answer(" สนามโน้มถ่วง", false),
      Answer(" สนามไฟฟ้า", false),
    ],
  ));
  return list;
}
