//สังคมศึกษา ม.5
class soci5 {
  final String questionText;
  final List<Answer> answersList;

  soci5(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<soci5> getQuestions() {
  List<soci5> list = [];
  //ADD questions and answer here
  list.add(soci5(
    "ตามหลักแห่งพระพุทธศาสนา หากมีการลงมติใดๆ จะใช้สิ่งใดเป็นเกณฑ์ในการตัดสินใจ",
    [
      Answer("เสียงข้างมาก", false),
      Answer("ความถูกต้องตามหลักธรรมะ", false),
      Answer("ความคิดเห็นของผู้นำ", false),
      Answer("ถูกทุกข้อ", true),
    ],
  ));

  list.add(soci5(
    "หลักธัมมาธิปไตย เน้นธรรมะข้อใด",
    [
      Answer("สัจธรรม", false),
      Answer("ถูกทุกข้อ", true),
      Answer("สามัคคีธรรม", false),
      Answer("คารวธรรม", false),
    ],
  ));

  list.add(soci5(
    "ข้อใดถือเป็นหัวใจของพระพุทธศาสนา",
    [
      Answer("อิทธิบาท 4", false),
      Answer("คารวธรรม 6", false),
      Answer("โอวาทปาติโมกข์", true),
      Answer("ธัมมจักกัปปวัตนสูตร", false),
    ],
  ));

  list.add(soci5(
    "หลักธรรมใดเป็นกระบวนการฝึกหัดอบรมตน",
    [
      Answer("ฆราวาสธรรม 4", false),
      Answer("พรหมวิหาร 4", false),
      Answer("อปริหานิยธรรม 7", false),
      Answer("สิกขา 3", true),
    ],
  ));
  list.add(soci5(
    "การฝึกอบรมตนที่ถูกต้องควรปฏิบัติอย่างไร",
    [
      Answer("ปฏิบัติเมื่อหมอดูทัก}", false),
      Answer("ปฏิบัติเมื่ออยู่ในภาวะทุกข์", false),
      Answer("ปฏิบัติโดยไม่ทำกิจกรรมอย่างอื่น", false),
      Answer("ปฏิบัติอย่างสม่ำเสมอ", true),
    ],
  ));
  list.add(soci5(
    "การฝึกหัดอบรมตนโดยการนั่งสมาธิ ทำให้เรามีสมรรถภาพจิตอย่างไร",
    [
      Answer("จิตใจมีความแน่วแน่มั่นคง", true),
      Answer("จิตใจมีความอ่อนโยน", false),
      Answer("จิตใจมีความปลอดโปร่งโลกสลาย", false),
      Answer("จิตใจคิดถึงแต่ความสุขของตนเอง", false),
    ],
  ));
  list.add(soci5(
    "พุทธศาสนสุภาษิตข้อใดต่อไปนี้ที่เกี่ยวข้องกับการฝึกฝนอบรมตน",
    [
      Answer("สุสฺสูสํ ลภเต ปญฺญํ", false),
      Answer("สุโข ปุญฺญสฺส อุจฺจโย", false),
      Answer("อตฺตานํ ทมยนฺติ ปณฺฑิตา", true),
      Answer("ปมาโท มจฺจุโน ปทํ", false),
    ],
  ));
  list.add(soci5(
    "หลักการของพระพุทธศาสนากับหลักวิทยาศาสตร์เหมือนกันในเรื่องใด",
    [
      Answer("การมุ่งแสวงหาความจริงเพื่อประโยชน์แก่มวลมนุษย์", false),
      Answer("การเน้นความสำคัญทางด้านจิตใจมากกว่าวัตถุ", false),
      Answer(
          "การพยายามสร้างเครื่องมืออันทันสมัยเพื่อความเป็นอยู่ที่ดีของชีวิตในปัจจุบัน",
          false),
      Answer("การสอนให้เชื่อในเรื่องผลของการกระทำ", true),
    ],
  ));
  list.add(soci5(
    "พุทธจริยา ได้แก่อะไรบ้าง",
    [
      Answer("อัตถจริยา พุทธัตถจริยา", false),
      Answer("โลกัตถจริยา พุทธัตถจริยา", false),
      Answer("โลกัตถจริยา ญาตัตถจริยา พุทธัตถจริยา", true),
      Answer("อัตถจริยา โลกัตถจริยา ญาตัตถจริยา พุทธัตถจริยา", false),
    ],
  ));
  list.add(soci5(
    "โลกัตถจริยา เป็นการบำเพ็ญประโยชน์ของพระพุทธเจ้าเมื่อใด",
    [
      Answer("ขณะออกผนวช", false),
      Answer("ภายหลังปรินิพพาน", false),
      Answer("ภายหลังตรัสรู้และเสวยวิมุติสุข", true),
      Answer("ภายหลังประสูติ", false),
    ],
  ));
  list.add(soci5(
    "ข้อใดเป็นปัจจัยสำคัญที่ทำให้ประชาชนให้ความร่วมมือต่อนโยบายเศรษฐกิจของรัฐบาล",
    [
      Answer("รัฐบาลมีการประชาสัมพันธ์ดี", false),
      Answer("ประชาชนมีฐานะทางเศรษฐกิจดี", false),
      Answer("ประชาชนมีความรู้ทางเศรษฐศาสตร์", true),
      Answer("ผู้นำรัฐบาลมีความรู้ทางด้านเศรษฐกิจเป็นอย่างดี", false),
    ],
  ));
  list.add(soci5(
    "เศรษฐศาสตร์จุลภาคเป็นการศึกษาเกี่ยวกับเรื่องใด",
    [
      Answer("รายได้และรายจ่ายประชาชาติ", false),
      Answer(
          "การผลิตสินค้าและบริการ การกำหนดราคาสินค้า การกระจายสินค้าจากผู้ผลิตไปยังผู้บริโภค",
          true),
      Answer("การศึกษาปัญหาต่างๆ ที่กระทบต่อระบบเศรษฐกิจของประเทศ", false),
      Answer("การจ้างงาน การออม การลงทุน การเงิน การค้า", false),
    ],
  ));
  list.add(soci5(
    "เศรษฐศาสตร์มหภาค เป็นการศึกษาเกี่ยวกับเรื่องใด",
    [
      Answer("การจัดสรรทรัพยากรในการผลิตสินค้าและบริการ", false),
      Answer("การกระจายสินค้าไปยังผู้บริโภคในแต่ละพื้นที่", false),
      Answer("อิทธิพลของปัจจัยที่มีผลต่อรายได้ประชาชน", true),
      Answer(
          "การศึกษาในเรื่องราคาสินค้า การบริโภคสินค้า ความสัมพันธ์ระหว่างองค์กรผู้ผลิต",
          false),
    ],
  ));
  list.add(soci5(
    "วิชาเศรษฐศาสตร์มีเป้าหมายสำคัญในการให้ความรู้ต่อประชาชนในข้อใด",
    [
      Answer(
          "เพื่อให้รู้จักเลือกใช้สินค้าราคาถูกที่สุด เพื่อเป็นการลดภาระค่าใช้จ่าย",
          false),
      Answer(
          "เพื่อให้รู้จักการตัดสินใจเลือกใช้ทรัพยากรที่มีอยู่อย่างจำกัดในการบริโภคและใช้ในทางที่ดีที่สุด",
          true),
      Answer(
          "เพื่อให้รู้จักการวางแผนการใช้จ่ายเงิน และการเลือกใช้สินค้าที่มีอยู่อย่างพอเพียง",
          false),
      Answer(
          "เพื่อให้รู้จักเลือกใช้สินค้าให้เกิดประโยชน์ต่อตนเองและครอบครัวมากที่สุด",
          false),
    ],
  ));
  list.add(soci5(
    "ประเทศต่างๆ ประสบปัญหาพื้นฐานทางเศรษฐกิจคล้ายคลึงกันอย่างไร",
    [
      Answer("แรงงาน และต้นทุนการผลิตค่อนข้างสูง ทำให้มีกำไรต่ำมาก", false),
      Answer("ทรัพยากรของประเทศแต่ละประเทศลดน้อยลงไปจากเดิมมาก", false),
      Answer(
          "ความไม่พอดีกันระหว่างความต้องการของมนุษย์ และสิ่งที่จะมาตอบสนองความต้องการ",
          true),
      Answer(
          " การหาตลาดส่งออกสินค้าที่ผลิตได้น้อยเนื่องจากมีคู่แข่งในการผลิตสินค้าจำนวนมากขึ้นกว่าเดิม",
          false),
    ],
  ));
  list.add(soci5(
    "ปัญหาการชะล้างพังทลายของทรัพยากรดิน ข้อใดที่เป็นปัญหาทางอ้อม",
    [
      Answer("ขาดแคลนอาหาร เพราะมีอาหารไม่พอ", true),
      Answer("การตัดไม้ทำลายป่า", false),
      Answer("ประชากรมีส่วนในการอนุรักษ์สิ่งแวดล้อม", false),
      Answer("ประชากรรู้เท่าไม่ถึงการณ์ในวิธีการอนุรักษ์", false),
    ],
  ));
  list.add(soci5(
    "ภาวะโลกร้อนที่เกิดจากปรากฏการณ์เรือนกระจก ได้สร้างปัญหาแก่โลกทางด้านใดบ้าง ทำไมถึงเป็นเช่นนั้น",
    [
      Answer("เป็นปัญหาระยะยาวทำให้ประเทศแถบตะวันตกเกิดภาวะโลกร้อน", false),
      Answer("ทำให้แสงแดดผ่านเข้าไปได้บางส่วนแล้วก็เก็บความร้อนไว้", false),
      Answer("ทำให้สภาพอากาศอบอุ่น ต่อต้นไม้เพื่อการเจริญเติบโต", false),
      Answer("อุณหภูมิของโลกสูงขึ้นกระทบต่อระบบนิเวศ", true),
    ],
  ));
  list.add(soci5(
    "ปรากฏการณ์เอลนิโญส่งผลกระทบที่มีต่อทรัพยากรและสิ่งแวดล้อมอย่างไร",
    [
      Answer("ทำให้อากาศแปรปรวนเดี๋ยวเป็นฤดูหนาว เดี๋ยวเป็นฤดูร้อน", false),
      Answer("ฝนตกหนักในพื้นที่ที่เป็นป่าดงดิบทำให้เกิดน้ำท่วมฉับพลัน", false),
      Answer("ทำให้เกิดไฟไหม้ป่าในประเทศเปรูจึงเป็นเขตแห้งแล้ง", false),
      Answer(
          "ทำให้ฝนไม่ตกตามฤดูกาล การเพาะปลูกไม่ได้ผลดีในแถบเอเชียตะวันออกเฉียงใต้",
          true),
    ],
  ));
  list.add(soci5(
    "การลดลงของทรัพยากรป่าไม้และสัตว์ป่า ทำให้เกิดผลกระทบด้านใด",
    [
      Answer("ทำให้สัตว์ป่ากลายเป็นสัตว์ที่มีเจ้าของเลี้ยงดู", false),
      Answer("ทำให้ขาดแคลนน้ำเกิดภาวะการแย่งชิงน้ำจืด", false),
      Answer("ทำให้ใช้ไม้ในการปลูกสร้างเป็นที่อยู่อาศัยมีมากขึ้น", false),
      Answer("ทำให้ความสมดุลของธรรมชาติขาดหายไป", true),
    ],
  ));
  list.add(soci5(
    "ทวีปแอนตาร์กติกามีน้ำแข็งปกคลุมมาก แต่ปัจจุบันเกิดการละลายมากขึ้น นักเรียนคิดว่าข้อความที่กล่าวถูกต้องหรือไม่ อย่างไร",
    [
      Answer("ถูกต้อง เพราะระบบนิเวศของโลกเปลี่ยนไปจากการกระทำของมนุษย์", true),
      Answer("ถูกต้อง เพราะน้ำแข็งปกคลุมรวมพื้นที่มากกว่าถึง 3 เท่า", false),
      Answer("ไม่ถูกต้อง เพราะเมื่อเจอแสงแดดในฤดูร้อนน้ำแข็งก็จะละลายเป็นปกติ",
          false),
      Answer(
          "ไม่ถูกต้อง เพราะสภาพอากาศบริเวณซีกโลกเหนือมีน้ำแข็งปกคลุมตลอดเวลา",
          false),
    ],
  ));
  list.add(soci5(
    "มลพิษทางอากาศเป็นปัญหาสิ่งแวดล้อมในกรุงเม็กซิโกซิตี้ส่งผลต่อสุขภาพประชาชน นักเรียนคิดว่าข้อความนี้ถูกหรือไม่ อย่างไร",
    [
      Answer(
          "ถูกต้อง เพราะในกรุงเม็กซิโกซิตี้มีตึกและอาคารบ้านเรือนค่อนข้างมาก",
          false),
      Answer("ถูกต้อง เพราะมลพิษทางอากาศมาจากรถยนต์และโรงงานอุตสาหกรรม", true),
      Answer(
          "ไม่ถูกต้อง เพราะในช่วงฤดูแล้งฝุ่นจากพื้นทะเลสาบเท็กซ์โคโคจะแห้งแล้ง",
          false),
      Answer(
          "ไม่ถูกต้อง เพราะมีประชากรอาศัยอยู่อย่างหนาแน่นในกรุงเม็กซิโกซิตี้",
          false),
    ],
  ));
  list.add(soci5(
    "ปัจจัยที่ให้ดินในประเทศไทยขาดความอุดมสมบูรณ์คือเรื่องใด",
    [
      Answer("แม่น้ำลำธาร", false),
      Answer("การตัดไม้ทำลายป่า", true),
      Answer("ความร้อนจากดวงอาทิตย์", false),
      Answer("อิทธิพลของลมมรสุม", false),
    ],
  ));
  list.add(soci5(
    "ป่าชนิดใดที่เกิดไฟไหม้ได้ง่ายที่สุด",
    [
      Answer("ป่าดิบเขา", false),
      Answer("ป่าดงดิบ", false),
      Answer("ป่าเบญจพรรณ", true),
      Answer("ป่าสนเขา", false),
    ],
  ));
  list.add(soci5(
    "กระบวนการใดที่ก่อให้เกิดมลพิษมากที่สุด",
    [
      Answer("การระเหย", false),
      Answer("การสักกร่อน", false),
      Answer("การเผาไหม้", true),
      Answer("การแพร่กระจาย", false),
    ],
  ));
  list.add(soci5(
    "ข้อใดไม่เกี่ยวข้องกับภาวะเรือนกระจก",
    [
      Answer("ฝุ่นควัน", false),
      Answer("แก๊สไนโตรเจน", true),
      Answer("แก๊สคาร์บอนไดออกไซด์", false),
      Answer("แก๊สคาร์บอนมอนอกไซด์", false),
    ],
  ));
  list.add(soci5(
    "ความแห้งแล้งของภาคตะวันออกเฉียงเหนือขึ้นอยู่กับอะไร",
    [
      Answer("การอยู่ห่างไกลทะเล", false),
      Answer("การอุ้มน้ำของดิน", false),
      Answer("ชั้นของหินเกลือในดิน", false),
      Answer("ปริมาณน้ำฝน", true),
    ],
  ));
  list.add(soci5(
    "ภาคใดมีองค์ประกอบธรรมชาติที่เหมาะสมในการสร้างเขื่อนมากที่สุด",
    [
      Answer("ภาคตะวันตก", false),
      Answer("ภาคเหนือ", true),
      Answer("ภาคตะวันออก", false),
      Answer("ภาคตะวันออกเฉียงเหนือ", false),
    ],
  ));
  list.add(soci5(
    "สิ่งใดเป็นเครื่องชี้ว่าประเทศจะพัฒนาได้มากน้อยแค่ไหน",
    [
      Answer("จำนวนประชากร", false),
      Answer("การศึกษาของประชากร", false),
      Answer("คุณภาพประชากร", true),
      Answer("วัยของประชากร", false),
    ],
  ));
  list.add(soci5(
    "ปฏิกิริยาเรือนกระจกเกิดจากสาเหตุใด",
    [
      Answer(
          "การเกิดแก๊สคาร์บอนไดออกไซด์เนื่องจากมีการเผาไหม้เชื้อเพลิง", true),
      Answer("การมีสารพิษตกค้างและถูกปนเปื้อนมากับฝน", false),
      Answer("โรงงานอุตสาหกรรมเผาถ่านหิน", false),
      Answer("การที่อุณหภูมิของโลกร้อนขึ้นเนื่องจากฝุ่นควัน", false),
    ],
  ));
  list.add(soci5(
    "ข้อใดต่อไปนี้เป็นองค์กรเอกชนที่ดำเนินกิจกรรมด้านสิ่งแวดล้อม",
    [
      Answer("WHO", false),
      Answer("UNCEF", false),
      Answer("UNHCR", false),
      Answer("GREENPEACE", true),
    ],
  ));
  list.add(soci5(
    "ตัวการสำคัญที่สร้างปัญหาวิกฤติการณ์ด้านสิ่งแวดล้อมและทรัพยากรธรรมชาติ คือข้อใด",
    [
      Answer("นักการเมือง", false),
      Answer("ภัยธรรมชาติ", false),
      Answer("มนุษย์", true),
      Answer("ความก้าวหน้าของเทคโนโลยี", false),
    ],
  ));
  list.add(soci5(
    "การอนุรักษ์ทรัพยากรธรรมชาติ หมายถึงอะไร",
    [
      Answer("การมีมาตรการเพื่อการป้องกันและคุ้มครอง", false),
      Answer("การควบคุมมีให้มีการทำลายทรัพยากร", false),
      Answer("การใช้ทรัพยากรอย่างเหมาะสมโดยให้เกิดสภาพสมดุล", true),
      Answer("การใช้ทรัพยากรให้มีคุณภาพต่อชีวิตมนุษย์", false),
    ],
  ));
  list.add(soci5(
    "จากข่าวหนังสือพิมพ์กรณีเกี่ยวเนื่องจากสนามบินสุวรรณภูมิเป็นบทเรียนของปัญหาวิกฤติการณ์สิ่งแวดล้อมของประเทศไทยในข้อใด",
    [
      Answer(" มลพิษทางเสียง", true),
      Answer(" มลพิษจากขยะและสิ่งปฏิกูล", false),
      Answer(" มลพิษทางน้ำ", false),
      Answer(" มลพิษของอากาศและกลิ่น", false),
    ],
  ));
  return list;
}
