//ภาษาไทย ม.5
class thai5 {
  final String questionText;
  final List<Answer> answersList;

  thai5(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<thai5> getQuestions() {
  List<thai5> list = [];
  //ADD questions and answer here
  list.add(thai5(
    "ความเชื่อในกฎแห่งกรรมเป็นวัฒนธรรมประเภทใด",
    [
      Answer("คติธรรม", true),
      Answer("วัตถุธรรม", false),
      Answer("เนติธรรม", false),
      Answer("สหธรรม", false),
    ],
  ));

  list.add(thai5(
    "ประเพณีแต่งงานเป็นวัฒนธรรมประเภทใด",
    [
      Answer("วัตถุธรรม", false),
      Answer("สหธรรมง", true),
      Answer("เนติธรรม", false),
      Answer("คติธรรมง", false),
    ],
  ));

  list.add(thai5(
    "บ้านเป็นวัฒนธรรมประเภทใด",
    [
      Answer("เนติธรรม", false),
      Answer("คติธรรม", false),
      Answer("วัตถุธรรม", true),
      Answer("สหธรรม", false),
    ],
  ));

  list.add(thai5(
    "ข้อใดไม่ใช่เอกลักษณ์ทางวัฒนธรรมไทย",
    [
      Answer("ใจกว้าง", false),
      Answer("รักสงบ", false),
      Answer("โอบอ้อมอารี", false),
      Answer("รักชาติ", true),
    ],
  ));
  list.add(thai5(
    "เมียจะตายตามผัวกลัวผีหลอก มีสระประสมทั้งหมดกี่คำ",
    [
      Answer("1", false),
      Answer("8", false),
      Answer("5", false),
      Answer("3", true),
    ],
  ));
  list.add(thai5(
    "วรรณยุกต์ในภาษาไทยมีกี่รูป กี่เสียง",
    [
      Answer("4 รูป 5 เสียง", true),
      Answer("1 รูป 1 เสียง", false),
      Answer("4 เสียง 5 รูป}", false),
      Answer("1 เสียง 2 เสียง", false),
    ],
  ));
  list.add(thai5(
    "ผู้แต่งมหาเวสสันดรชาดก กัณฑ์มัทรี คือใคร",
    [
      Answer("เจ้าพระยาพระคลังหน", true),
      Answer("ศรีปราชญ์", false),
      Answer("พระนารายณ์มหาราย", false),
      Answer("กรมพระปรมานุชิตชิโนรส", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดคือมหาเวสสันดรชาดกฉบับผลงานของเจ้าพระยาพระคลัง(หน)",
    [
      Answer("กัณฑ์ทศพร กัณฑ์ทานกัณฑ์", false),
      Answer("กัณฑ์มัทรี กัณฑ์ชูชก", false),
      Answer("กัณฑ์มหาพน กัณฑ์จุลพน", false),
      Answer("กัณฑ์กุมาร กัณฑ์มัทรี", true),
    ],
  ));
  list.add(thai5(
    "กัณฑ์มัทรีเป็นกัณฑ์ที่เท่าใดในเรื่องร่ายยาวมหาเวสสันดรชาดก",
    [
      Answer("กัณฑ์ที่ ๘", false),
      Answer("กัณฑ์ที่ ๑๐", false),
      Answer("กัณฑ์ที่ ๙", true),
      Answer("กัณฑ์ที่ ๑๑", false),
    ],
  ));
  list.add(thai5(
    "ปมปัญหาสำคัญในเรื่องมหาเวสสันดรชาดก กัณฑ์มัทรี คืออะไร",
    [
      Answer("พระนางมัทรีทรงตามหาสองกุมารตลอดทั้งคืนจนถึงรุ่งเช้า", false),
      Answer("พระเวสสันดรทรงบริภาษพระนางมัทรีอย่างเสียหาย", false),
      Answer("พระเวสสันดรยกสองกุมารให้ชูชกไปแล้ว", true),
      Answer("เทพยดาแปลงเป็นพญาเสือโคร่งมาขวางหน้าพระนางมัทรี", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดไม่ใช่ ๓ สัตว์ชนิดที่เทวดาแปลงกายนอนขวางเส้นทางกลับอาศรมของพระนางมัทรี",
    [
      Answer("ราชสีห์", false),
      Answer("เสือเหลือง", false),
      Answer("งูเหลือมยักษ์", true),
      Answer("เสือโคร่ง", false),
    ],
  ));
  list.add(thai5(
    "“สุดสายนัยนาที่แม่จะตามไปเล็งแล สุดโสตแล้วที่แม่จะซับทราบฟังสำเนียง สุดสุรเสียงที่แม่จะร่ำเรียกพิไรร้องสุดฝีเท้าที่แม่จะเยื้องย่องยกย่างลงเหยียบดิน ก็สุดสิ้นสุดปัญญาสุดหาสุดค้นเห็นสุดคิด”คำประพันธ์นี้สะท้อนลักษณะนิสัยของพระนางมัทรีเด่นชัดที่สุดในเรื่องใด",
    [
      Answer("ความรักและคิดถึงลูก", false),
      Answer("ความมุ่งมั่นพยายามค้นหาลูก", true),
      Answer("ความอดทนต่อความพยายามค้นหาลูก", false),
      Answer("ความทุกข์ยากในการตามหาลูก", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดเป็นแนวคิดสำคัญของเรื่อง มหาเวสสันดรชาดก กัณฑ์มัทรี",
    [
      Answer("ความเสียสละที่ยิ่งใหญ่เพื่อมวลชน", false),
      Answer("บทบาท หน้าที่ของสตรีไทยที่ดีงาม", false),
      Answer("ความรักอันยิ่งใหญ่ของแม่ที่มีต่อลูก", true),
      Answer("การบริจาคทานที่ยิ่งใหญ่", false),
    ],
  ));
  list.add(thai5(
    "ลิลิตสุภาพประกอบด้วยคำประพันธ์ชนิดใด",
    [
      Answer("ร่ายสุภาพและโคลงสี่สุภาพ", false),
      Answer("ร่ายสุภาพและโคลงสุภาพ", true),
      Answer("ร่ายสุภาพและโคลง", false),
      Answer("ร่ายยาวและโคลงสุภาพ", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดคือจุดประสงค์ในการแต่งลิลิตตะเลงพ่าย",
    [
      Answer("บันทึกประวัติศาสตร์", false),
      Answer("สดุดีวีรกรรมพระมหาอุปราชา", false),
      Answer("สดุดีวีรกรรมของสมเด็จพระนเรศวรมหาราช", true),
      Answer("เป็นตำราเรียนวรรณคดี", false),
    ],
  ));
  list.add(thai5(
    "ลักษณะที่เด่นที่สุดของสมเด็จพระนเรศวรฯที่ปรากฏในลิลิตตะเลงพ่ายคือข้อใด",
    [
      Answer("ทรงรักชาติยิ่งกว่าพระชนม์ชีพ", true),
      Answer("ทรงกอปรด้วยขัตติยมานะ", false),
      Answer("ทรงยึดมั่นในพระพุทธศาสนา", false),
      Answer("ทรงเป็นกษัตริย์นักรบที่กล้าหาญ", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดคือความหมายของวรรณกรรมท้องถิ่น",
    [
      Answer("วรรณกรรมที่ชาวบ้านสร้างขึ้นมาในท้องถิ่นของตน", false),
      Answer("วรรณกรรมที่ชาวบ้านสร้างขึ้นเพื่อแสดงเอกลักษณ์ของท้องถิ่นตังเอง",
          false),
      Answer("วรรณกรรมที่ชาวบ้านสร้างขึ้นมาให้เป็นสมบัติของลูกหลาน", false),
      Answer(
          "วรรณกรรมที่ชาวบ้านสร้างขึ้นมาโดยใช้ภาษาในท้องถิ่นและสืบทอดโดยการเล่า",
          true),
    ],
  ));
  list.add(thai5(
    "ข้อใดคือวรรณกรรมพื้นบ้านประเภทมุขปาฐะ",
    [
      Answer("การร้องหมอลำ", false),
      Answer("การเล่นหมากรุก", false),
      Answer("การสร้างบ้านเรือนไทย", false),
      Answer("การร้องหมอลำ", true),
    ],
  ));
  list.add(thai5(
    "ทำไมจึงเกิดการเล่นปริศนาคำทาย",
    [
      Answer("เพราะอวดฉลาด", false),
      Answer("เพราะต้องการลองภูมิปัญญา", false),
      Answer("เพื่อความสนุกสนาน", false),
      Answer("ถูกทุกข้อ", true),
    ],
  ));
  list.add(thai5(
    "ปริศนาคำทายโคลงสี่สุภาพจัดเป็นปริศนาประเภทใด",
    [
      Answer("คำกลอน", true),
      Answer("คำสุภาษิต", false),
      Answer("คำสุภาพ", false),
      Answer("คำพังเพย0", false),
    ],
  ));
  list.add(thai5(
    "ปริศนาคำทายมักจะนำเรื่องเกี่ยวกับอะไรมาเป็นคำถาม",
    [
      Answer("พืช", false),
      Answer("ถูกทุกข้อ", true),
      Answer("ธรรมชาติ", false),
      Answer("สัตว์", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดคือลักษณะวรรณกรรมท้องถิ่น",
    [
      Answer("การแต่งกายทันสมัย", false),
      Answer("ภาษาที่ใช้เป็นภาษาถิ่น", true),
      Answer("ลีลาการแสดงทันสมัย", false),
      Answer("คำประพันธ์", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดกล่าวผิดเกี่ยวกับเพลงพื้นบ้าน",
    [
      Answer("เป็นเพลงที่เกิดจากคนในท้องถิ่น", false),
      Answer("ใช้ภาษาเรียบง่ายไม่ซับซ้อน", false),
      Answer("เป็นเพลงที่ระบุนามผู้แต่งไว้ชัดเจน", true),
      Answer("มีลักษณะเฉพาะตัวในแต่ละท้องถิ่น", false),
    ],
  ));
  list.add(thai5(
    "อะไรเอ่ย กอไผ่เต็มกอ หาข้อไม่พบ",
    [
      Answer("คิ้ว", false),
      Answer("ฟัน", false),
      Answer("ผม", true),
      Answer("เล็บ", false),
    ],
  ));
  list.add(thai5(
    " 'สำนวน คืออะไร",
    [
      Answer(
          " ถ้อยคำที่กล่าวเป็นชั้นเชิงชวนให้คิด ไม่แปลความหมายตรงตัว แต่เป็นที่เข้าใจกันของคนในสังคมที่เป็นเจ้าของภาษา",
          true),
      Answer(
          "ถ้อยคำโวหารที่มีความหมายแสดงถึงนิสัยใจคอและพฤติกรรมของมนุษย์ทั้งด้านดีและด้านชั่วด",
          false),
      Answer("ภาษิตที่เป็นโวหารโบราณที่สืบทอดกันมา ไม่มีการเปลี่ยนแปลงความหมาย",
          false),
      Answer("คำกล่าวเพื่อเตือนใจ ซึ่งมักจะเป็นคำที่คล้องจองกัน", false),
    ],
  ));
  list.add(thai5(
    "ภาษิต คืออะไร",
    [
      Answer(
          "ถ้อยคำสั้น ๆ ตั้งแต่หนึ่งพยางค์ขึ้นไป เน้นความหมายและมีใจความกระชับ",
          false),
      Answer(
          "ถ้อยคำหรือโวหารที่มีความหมายเกี่ยวข้องกับการประกอบอาชีพและการดำรงชีวิตในสังคม",
          false),
      Answer(
          "ถ้อยคำโวหารที่เรียบเรียงเป็นสำนวน มีความหมายไม่ตรงตัว และมักมีที่มาจากนิทาน",
          false),
      Answer(
          "คำกล่าวหรือถ้อยคำที่มีคติชวนฟังหรือกลุ่มคำพิเศษที่มีความหมายเชิงเปรียบเทียบเพื่อเตือนใจ",
          true),
    ],
  ));
  list.add(thai5(
    "หนังสือแพทย์ศาสตร์สงเคราะห์ฉบับหลวง รวบรวมพิมพ์โดยใคร",
    [
      Answer("พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช", false),
      Answer("พระยาพิศณุประสาทเวช (คง ถาวรเวช)", true),
      Answer("เจ้าพระยาพระคลัง (หน)", false),
      Answer("ดร.ชลธิรา สัตยาวัฒนา", false),
    ],
  ));
  list.add(thai5(
    "คัมภีร์ฉันทศาสตร์ แพทย์ศาสตร์สงเคราะห์แต่งด้วยคำประพันธ์ชนิดใด",
    [
      Answer("กาพย์สุรางคนางค์ ๒๘", false),
      Answer("กาพย์ฉบัง ๑๖", false),
      Answer("กาพย์ยานี ๑๑", true),
      Answer("อินทรวิเชียรฉันท์ ๑๑", false),
    ],
  ));
  list.add(thai5(
    "เรื่องคัมภีร์ฉันทศาสตร์ แพทย์ศาสตร์สงเคราะห์แบ่งเป็นทั้งหมด กี่ตอน",
    [
      Answer("๑๙ ตอน", true),
      Answer("๑๖ ตอน", false),
      Answer("๑๘ ตอน", false),
      Answer("๑๗ ตอน", false),
    ],
  ));
  list.add(thai5(
    "ข้อใดถูกต้อง",
    [
      Answer("กราฟ y = log3 x มีลักษณะเหมือนกราฟ x = 3^y", false),
      Answer("โดเมนของฟังก์ชันลอการิทึมเป็นจำนวนจริง", false),
      Answer("กราฟของฟังก์ชันลอการิทึมตัดแกน y ที่จุด (1,0) เสมอ", false),
      Answer("ถูกทุกข้อ", true),
    ],
  ));
  list.add(thai5(
    "ข้อใดไม่ใช่ลักษณะทับ ๘ ประการ",
    [
      Answer("กุมโทษ กำเดา", false),
      Answer("ช้ำใน ละออง", false),
      Answer("ลองช้ำ กดทับ", true),
      Answer(" ซาง สำรอก", false),
    ],
  ));
  list.add(thai5(
    " 'บางแพทย์ก็หลงเล่ห์ ด้วยกาเมเข้าปิดบัง รักษาโรคด้วยกำลัง กิเลศโลภะเจตนา' จากคำประพันธ์ข้างต้น ถอดคำประพันธ์ได้อย่างไร",
    [
      Answer(
          " หมอบางคนถือตัวดูถูกคนไข้ว่ายากจน  หากรักษาไปก็จะเสียยา  และจะไม่ได้ค่าตอบแทนในการรักษา  ",
          false),
      Answer("หมอบางคนก็รักษาคนไข้อย่างเต็มกำลัง", false),
      Answer(
          "หมอบางคนหมกมุ่นในความอยากได้  ทำการรักษาด้วยอำนาจแห่งความอยากได้  ",
          true),
      Answer("หมอบางคนรังเกียจคนไข้  บางคนก็หลอกคนไข้ว่าป่วยมากกว่าที่เป็นจริง",
          false),
    ],
  ));
  list.add(thai5(
    " 'วิจาโรให้พินิจ จะทำผิดฤาชอบกาล ดูโรคกับยาญาณ ให้ต้องกันจะพลันหาย' จากคำประพันธ์ข้างต้น คำว่า วิจาโร หมายถึงข้อใด",
    [
      Answer(" ความลังเล", true),
      Answer(" รู้คิดมีเหตุผล", false),
      Answer(" ความเกรงกลัว", false),
      Answer(" ความเกรงกลัว", false),
    ],
  ));
  return list;
}
