class sic4 {
  final String questionText;
  final List<Answer> answersList;

  sic4(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<sic4> getQuestions() {
  List<sic4> list = [];
  //ADD questions and answer here
  list.add(sic4(
    "เครื่องบินบินได้ระยะทาง 500 กม ในเวลา 5 นาที จะมีความเร็วเฉล่ี่ยเท่าใด (กิโลเมตรต่อนาที)",
    [
      Answer("25", false),
      Answer("100", true),
      Answer("75", false),
      Answer("50", false),
    ],
  ));

  list.add(sic4(
    "ความเร่ง คือ ?",
    [
      Answer("ระยะทางหารด้วยเวลา", false),
      Answer("ความเร็วหารด้วยเวลา", true),
      Answer("เวลาหารด้วยระยะทาง", false),
      Answer("ผิดทุกข้อ", false),
    ],
  ));

  list.add(sic4(
    "รถยนต์คันหนึ่งวิ่งด้วยอัตราเร็วคงที่ 20 เมตรต่อวินาที นานเท่าใดจึงจะเคลื่อนที่ได้ระยะทาง 500 เมตร",
    [
      Answer("25 วินาที", false),
      Answer("15 วินาที", false),
      Answer("25 วินาที", true),
      Answer("5 วินาที", false),
    ],
  ));

  list.add(sic4(
    "รถวิ่งจากจุด A ไปตามทางโค้งจนถึงจุด B วัดระยะทางการเคลื่อนที่ได้ 8 กิโลเมตร เป็นปริมาณประเภทใด",
    [
      Answer("ปริมาณเชิงบวก", false),
      Answer("ปริมาณเชิงลบ", false),
      Answer("ปริมาณเวกเตอร์", false),
      Answer("ปริมาณสเกลาร์", true),
    ],
  ));
  list.add(sic4(
    "ข้อใดเป็นกล่าวได้ถูกต้องเกี่ยวกับการกระจัด",
    [
      Answer("การกระจัดเป็นปริมาณสเกลาร์", false),
      Answer("การกระจัดคือระยะทางทั้งหมดที่วัตถุเคลื่อนที่", false),
      Answer("การกระจัดคือมีค่ามากกว่าระยะทางเสมอ", false),
      Answer("การกระจัดคือระยะห่างจากจุดเริ่มต้นจนถึงจุดสุดท้าย", true),
    ],
  ));
  list.add(sic4(
    "รถวิ่งจากจุด A ไปยังจุด B เป็นระยะทาง 600 เมตรใช้เวลาทั้งหมด 1 นาที รถวิ่งด้วยอัตราเร็วเท่าไร",
    [
      Answer("รถวิ่งด้วยอัตราเร็ว 15 เมตร/วินาที", false),
      Answer("รถวิ่งด้วยอัตราเร็ว 20 เมตร/วินาที", false),
      Answer("รถวิ่งด้วยอัตราเร็ว 30 เมตร/วินาที", false),
      Answer("รถวิ่งด้วยอัตราเร็ว 10 เมตร/วินาที", true),
    ],
  ));
  list.add(sic4(
    "ข้อใดกล่าวได้ถูกต้อง",
    [
      Answer("อัตราเร็วคือการกระจัด/เวลา", false),
      Answer("ปริมาณเวกเตอร์จะมีค่ามากกว่าปริมาณสเกลาร์", false),
      Answer("ความเร็วมีค่าเป็นปริมาณสเกลาร์", false),
      Answer("ความเร่งคืออัตราการเปลี่ยนแปลงความเร็วในหนึ่งหน่วย", true),
    ],
  ));
  list.add(sic4(
    "วัตถุหนึ่งเคลื่อนที่เป็นวงกลมรัศมี 21 เมตร ครบหนึ่งรอบ การกระจัดเป็นเท่าใด",
    [
      Answer("84", false),
      Answer("132", false),
      Answer("42", false),
      Answer("0", true),
    ],
  ));
  list.add(sic4(
    "การเคลื่อนที่ของข้อใดต่อไปนี้ที่ความเร่งของวัตถุเป็นศูนย์",
    [
      Answer("การเคลื่อนที่แบบวงกลมด้วยอัตรารเ็วคงตัว", false),
      Answer("การตกลงตรงๆในแนวดิ่งโดยไม่มีแรงต้านอากาศ", false),
      Answer("การเคลื่อนที่เป็นเส้นตรงในแนวระดับด้วยอัตราเร็วคงตัว", true),
      Answer("การไถลลงเป็นเส้นตรงบนพื้นเอียงที่ไม่มีแรงเสียดทาน", false),
    ],
  ));
  list.add(sic4(
    "ข้อใดดอลตันไม่ได้กล่าวไว้เกี่ยวกับเรื่องของอะตอม?",
    [
      Answer("อะตอมเป็นอนุภาคที่เล็กที่สุดไม่สามารถแยกได้", false),
      Answer("อะตอมไม่สามารถสร้างขึ้นใหม่ได้", false),
      Answer("ธาตุต่างชนิดกันไม่สามารถรวมตัวเป็นสารประกอบได้", true),
      Answer("อะตอมมีลักษณะเป็นทรงกลมตัน", false),
    ],
  ));
  list.add(sic4(
    "แบบจำลองอะตอมมีกี่แบบ",
    [
      Answer("2 ของ ดอลตัน กับ รัทเทอร์ฟอร์ด", false),
      Answer("3 ของ ดอลตัน ทอมสัน รัทเทอร์ฟอร์ด", false),
      Answer("ไม่มีข้อใดถูก", true),
      Answer(
          "6 ของ ดอลตัน ทอมสัน รัทเทอร์ฟอร์ด โบร์ แบบกลศาสตร์ควอนตัม แบบกลศาสตร์อะตอม",
          false),
    ],
  ));
  list.add(sic4(
    "ทฤษฎีใดเกี่ยวกับอะตอมที่ไม่เป็นจริงในปัจจุบัน?",
    [
      Answer("อิเล็กตรอน มีประจุไฟฟ้าเท่ากับ 1.6x10^-19", false),
      Answer("อะตอมไม่สามารถแยกได้", true),
      Answer("อะตอมมี อิเล็กตรอน โปรตรอน นิวตรอน เป็นส่วนประกอบ", false),
      Answer("อิเล็กตรอนจะเคลื่อนที่รอบนิวเคลียส", false),
    ],
  ));
  list.add(sic4(
    "อิเล็กตรอนมีประจุไฟฟ้าเป็นอะไร?",
    [
      Answer("เป็นกลาง", false),
      Answer("เป็นบวก", false),
      Answer("เป็นลบ", true),
      Answer("ไม่ได้เป็นประจุไฟฟ้า", false),
    ],
  ));
  list.add(sic4(
    "ผู้ที่ทดลองวัดขนาดอะตอมคนแรกคือใคร?",
    [
      Answer("ดอลตัน", false),
      Answer("ลอร์ดเรย์ลี", true),
      Answer("ทอมสัน", false),
      Answer("รัทเทอร์ฟอร์ด", false),
    ],
  ));
  list.add(sic4(
    "อิเล็กตรอนจะหลุดพ้นจากอะตอมโดยวิธีใด",
    [
      Answer("เสียง", false),
      Answer("ความเย็น", false),
      Answer("ความร้อน", true),
      Answer("ไฟฟ้า", false),
    ],
  ));
  list.add(sic4(
    "ธาตุมีกี่ชนิด",
    [
      Answer("118", true),
      Answer("111", false),
      Answer("110", false),
      Answer("112", false),
    ],
  ));
  list.add(sic4(
    "ธาตุแบ่งออกเป็นกี่ชนิดใหญ่ๆ",
    [
      Answer("4", false),
      Answer("5", false),
      Answer("6", false),
      Answer("3", true),
    ],
  ));
  list.add(sic4(
    "รัทเทอร์ฟอร์ดหาโครงสร้างอะตอมด้วยวิธีใด",
    [
      Answer("สมมติขึ้นมา", false),
      Answer("ยิงรังสีเอ็กซ์ไปที่ละอองน้ำมัน", false),
      Answer("หลอดรังสีแคโทด", false),
      Answer("ไม่มีข้อใดถูก", true),
    ],
  ));
  list.add(sic4(
    "มิลลิแกนหาโครงสร้างอะตอมดัวยวิธีใด",
    [
      Answer("ถูกทุกข้อ", false),
      Answer("ไม่มีข้อใดถูก", false),
      Answer("หลอดรังสีแคโทด", false),
      Answer("ยิงรังสีเอ็กซ์ไปที่ละอองน้ำมัน", true),
    ],
  ));
  list.add(sic4(
    "ข้อใดไม่จัดเป็นการสืบพันธุ์ของสิ่งมีชีวิต",
    [
      Answer("การงอกใหม่ของหางจิ้งจก", true),
      Answer("การแบ่งเซลล์ของพารามีเซียม", false),
      Answer("การสร้างสปอร์ของเห็ด", false),
      Answer("การแตกหน่อของไฮดรา", false),
    ],
  ));
  list.add(sic4(
    "ข้อใดไม่จัดเป็นสาขาวิชาทางด้านสัตววิทยา",
    [
      Answer("โพรโทซัววิทยา", false),
      Answer("พฤกษศาสตร์", true),
      Answer("กีฏวิทยา", false),
      Answer("สังขวิทยา", false),
    ],
  ));
  list.add(sic4(
    "สิ่งมีชีวิตใดมีความสัมพันธ์แบบพึ่งพากัน",
    [
      Answer("ปลาการ์ตูน-ดอกไม้ทะเล", false),
      Answer("รา-สาหร่าย", true),
      Answer("ม้าลาย-ยีราฟ", false),
      Answer("เห็บ-สุนัข", false),
    ],
  ));
  list.add(sic4(
    "ข้อใดไม่ใช่วิธีการทางวิทยาศาสตร์",
    [
      Answer("สรุปผล", false),
      Answer("ตั้งสมมติฐาน", false),
      Answer("สังเกต", true),
      Answer("ตรวจสอบสมมติฐาน", false),
    ],
  ));
  list.add(sic4(
    "ข้อใดเป็นสมบัติเฉพาะตัวของนักวิทยาศาสตร์",
    [
      Answer("ช่างสังเกต", false),
      Answer("ตั้งคำถาม และคิดค้นหาคำตอบ", false),
      Answer("อยากรู้อยากเห็น คิดค้นหาคำตอบ และพิสูจน์ทดลอง", true),
      Answer("อยากรู้อยากเห็น และพิสูจน์ทดลอง", false),
    ],
  ));
  list.add(sic4(
    "ข้อใดเป็นวิธีศึกษาชีววิทยาที่ถูกต้อง",
    [
      Answer("เริ่มจากสิ่งที่ใกล้ตัวก่อน", false),
      Answer("เริ่มจากปัญหา", true),
      Answer("เริ่มจากสิ่งที่ครูบอก", false),
      Answer("มีการเก็บตัวอย่าง", false),
    ],
  ));
  list.add(sic4(
    "น้ำตาลชนิดใด ร่างกายไม่สามารถนำไปใช้ได้ทันที ต้องมีการย่อยเสียก่อน",
    [
      Answer("กลูโคส", false),
      Answer("ฟรักโทส", false),
      Answer("กาแลกโทส", false),
      Answer("ซูโครส", true),
    ],
  ));
  list.add(sic4(
    "ข้อใดไม่ใช่สารชีวโมเลกุล",
    [
      Answer("คาร์โบไฮเดรต", false),
      Answer("วิตามินและแร่ธาตุ", true),
      Answer("คาร์โบไฮเดรต", false),
      Answer("โปรตีน", false),
    ],
  ));
  list.add(sic4(
    "หน้าที่ของเยื่อหุ้มเซลล์คือข้อใด ",
    [
      Answer("เป็นเยื่อเลือกผ่านสารต่างๆ", true),
      Answer("ปรับตัวเข้ากับสิ่งแวดล้อม", false),
      Answer("ให้ความแข็งแรงแก่เซลล์", false),
      Answer("สร้างสารที่จะลำเลียงออกจากเซลล์", false),
    ],
  ));
  list.add(sic4(
    "หากผู้มีอาการตาบอดสีแดง ผู้นั้นจะมองเห็นสีใดผิดปกติไปด้วย",
    [
      Answer("เหลือง และ ม่วง", true),
      Answer("น้ำเงิน และ เขียว", false),
      Answer("เหลือง และ เขียว", false),
      Answer("น้ำเงิน และ เหลือง", false),
    ],
  ));
  list.add(sic4(
    "ในการทำโจทย์ปัญหาวิชาคณิตศาสตร์ เป็นการทำงานของสมองส่วนใด",
    [
      Answer("ซีรีบรัม", true),
      Answer("ไฮโพทาลามัส", false),
      Answer("พอนส์", false),
      Answer("ทาลามัส", false),
    ],
  ));
  return list;
}
