class thai4 {
  final String questionText;
  final List<Answer> answersList;

  thai4(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<thai4> getQuestions() {
  List<thai4> list = [];
  //ADD questions and answer here
  list.add(thai4(
    "ข้อใดเป็นคำสรรพนามบุรุษที่ 1?",
    [
      Answer("เขา", false),
      Answer("ข้าพระพุทธเจ้า", true),
      Answer("เธอ", false),
      Answer("ท่าน", false),
    ],
  ));

  list.add(thai4(
    "ข้อใดเป็นคำกริยา?",
    [
      Answer("โรงพยาบาลศิริราช", false),
      Answer("พากเพียร", true),
      Answer("คันไถ", false),
      Answer("ภาษีอากร", false),
    ],
  ));

  list.add(thai4(
    "ข้อใดเป็นคำบุพบททั้ง 2 คำ?",
    [
      Answer("รับประทาน นอน", false),
      Answer("ตำรวจ ตรวจ", false),
      Answer("ใกล้ ไกล", true),
      Answer("และ กับ", false),
    ],
  ));

  list.add(thai4(
    "ข้อใดเป็นวิสามานยนาม?",
    [
      Answer("สถานีตำรวจ", false),
      Answer("โต๊ะเรียน", false),
      Answer("โรงพยาบาล", false),
      Answer("โรงเรียนแสงอรุณ", true),
    ],
  ));
  list.add(thai4(
    "คำว่า 'ที่' ในข้อใดเป็นคำบุพบทง?",
    [
      Answer("ถิ่นที่อยู่", false),
      Answer("เรื่องที่พูด", false),
      Answer("คนที่หนึ่ง", false),
      Answer("อยู่ที่บ้าน", true),
    ],
  ));
  list.add(thai4(
    "ข้อใดมีกริยานุเคราะห์?",
    [
      Answer("พ่อไปสวน", false),
      Answer("พี่สอบได้ที่ 1", false),
      Answer("น้องร้องไห้", false),
      Answer("ฝนคงจะตก", true),
    ],
  ));
  list.add(thai4(
    "ข้อใดมีคำอุทานแสดงอาการแปลกใจ?",
    [
      Answer("พุทโธ! โกหกอะไรได้เจ้าข้า", false),
      Answer("แหม! ช่างทายใจฉันถูกจริง", false),
      Answer("อนิจจา! ตัวเราก็เท่านั้น", false),
      Answer("โอ้! เสียแรงเกิดมานิจจาเอ๋ย", true),
    ],
  ));
  list.add(thai4(
    "คำในข้อใดใช้ลักษณนามเหมือนกันทุกคำ?",
    [
      Answer("เครื่องบิน เกวียน ไม้ไผ่", false),
      Answer("พระพุทธรูป เจดีย์ พระภิกษุสงฆ์", false),
      Answer("เทียน ดินสอ มีด", false),
      Answer("เสื้อ ตะปู ปลา", true),
    ],
  ));
  list.add(thai4(
    "'รัฐบาลส่งเสริมการท่องเที่ยว' ข้อความนี้มีคำนามกี่คำ",
    [
      Answer("7 คำ", false),
      Answer("4 คำ", false),
      Answer("2 คำ", true),
      Answer("3 คำ", false),
    ],
  ));
  list.add(thai4(
    "คำว่า 'เขา' ในข้อใดเป็นคำสรรพนาม?",
    [
      Answer("อย่าข่มเขาโคขืนให้กลืนหญ้า", false),
      Answer("เสี้ยมเขาควายให้ชนกัน", false),
      Answer("ว่าแต่เขาอิเหนาเป็นเอง", true),
      Answer("กลิ้งครกขึ้นเขา", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดทำหน้าที่สมุหนามได้ถูกต้อง",
    [
      Answer("กรรมการคณะนั้นกำลังตรวจบัญชี", false),
      Answer("นกนางนวลบินโฉบเฉียวบนท้องฟ้า", false),
      Answer("โขลงช้างเดินที่ชายป่า", true),
      Answer("ผึ้ง 1 ฝูงกำลังทำรัง", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดมีคำวิเศษณ์บอกสถานที่",
    [
      Answer("รถไฟขบวนนั้นหยุดอยู่กับที่", false),
      Answer("เขาล่องเรือไปทางทิศใต้", true),
      Answer("เขาอ่านหนังสือเสียงดัง", false),
      Answer("พวกเราทุกคนต้องขยันเรียน", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดใช้คำสันธานไม่ถูกต้อง",
    [
      Answer("ดำเป็นตอตะโก", false),
      Answer("บริสุทธิ์เหมือนหยาดน้ำค้าง", false),
      Answer("เสียงดังราวกับเสียงระฆัง", true),
      Answer("แห้งแล้งเหมือนทะเลทราย", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดเป็นคำกริยาไม่มีกรรม",
    [
      Answer("น้องไปโรงเรียน", false),
      Answer("นกบินสูง", true),
      Answer("สุนัขกัดแมว", false),
      Answer("น้องกินข้าว", false),
    ],
  ));
  list.add(thai4(
    "'ห้องนี้จัดไว้เฉพาะแขกพิเศษ' ในข้อความคำใดเป็นคำวิเศษณ์",
    [
      Answer("เฉพาะ", false),
      Answer("ห้องนี้", false),
      Answer("พิเศษ", true),
      Answer("จัดไว้", false),
    ],
  ));
  list.add(thai4(
    "คำว่า 'กัน' ในข้อใดเป็นคำสรรพนาม",
    [
      Answer("คนบ้านนี้ชอบตีกัน", true),
      Answer("พี่ไม่ชอบให้เธอกันคิ้ว", false),
      Answer("กันไว้ดีกว่าแก้", false),
      Answer("เด็กของเราถูกกันไม่ให้เข้าไป", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดมีคำนาม",
    [
      Answer("วางยา วางเบ็ด", false),
      Answer("กลับใจ กลับคำ", false),
      Answer("หมดเปลือก หมดตัว", false),
      Answer("จากจร จากพราก", true),
    ],
  ));
  list.add(thai4(
    "ข้อใดเป็นคำกริยาทุกคำ",
    [
      Answer("บัณฑูร อนุมัติ สมดุล", false),
      Answer("สลอน สัมมาคารวะ อนุมาน", false),
      Answer("กัลบก แถลง ขมา", false),
      Answer("กล้ำกลืน กำสรด เถลิง", true),
    ],
  ));
  list.add(thai4(
    "ข้อใดไม่มีคำบุพบท",
    [
      Answer("เขากลับถึงบ้านได้เพราะโชค", false),
      Answer("ความอ่อนน้อมเป็นคุณสมบัติของคนดี", false),
      Answer("ขอเชิญพุทธศาสนิกชนร่วมทำบุญ ณ วัดกลาง", false),
      Answer("อุทกภัยครั้งนี้ทำความเสียหายเกือบทั่วประเทศ", true),
    ],
  ));
  list.add(thai4(
    "'มะม่วงนี้เพิ่งหล่นจากต้นเมื่อเช้า' ข้อความต่อไปนี้ละคำชนิดใด",
    [
      Answer("วิสามานยนาม", true),
      Answer("ลักษณนาม", false),
      Answer("สกรรมกริยา", false),
      Answer("สันธาน", false),
    ],
  ));
  list.add(thai4(
    "พสกนิกร ร่วมกิจกรรมจักรยานเฉลิมพระเกียรติ 'ปั่นเพื่อพ่อ Bike for Dad' คำที่ขีดเส้นใต้เป็นคำนามชนิดใด",
    [
      Answer("ลักษณนาม", false),
      Answer("สามานยนาม", true),
      Answer("อาการนาม", false),
      Answer("วิสามานยนาม", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดใช้สำนวนไม่ถูกต้อง",
    [
      Answer(
          "เวลาเข้าไปในห้องสมุด ฉันงงเป็นไก่ตาแตกทุกที เพราะไม่รู้ว่าจะหาหนังสือได้อย่างไร",
          false),
      Answer("ผมสงสารแม่ค้าเลยซื้อเหมามะม่วงสุกงอมพระรามมาหลายกิโลจนกินไม่หมด",
          true),
      Answer(
          "ทีมวอลเล่ย์บอลชายของโรงเรียนตั้งใจฝึกซ้อมอย่างเต็มที่ แต่ก็ต้องคว้าน้ำเหลวอีกครั้ง",
          false),
      Answer(
          "เจ้าของร้านค้าที่ถูกปล้นสงสัยว่าเกลือเป็นหนอน เพราะคนร้ายรู้ที่ซ่อนเงินเป็นอย่างดี",
          false),
    ],
  ));
  list.add(thai4(
    "สำนวนในข้อใดถูกต้อง",
    [
      Answer("กงกำกงเกวียน", false),
      Answer("กาคาบพริกแดง", false),
      Answer("เกลียดตัวกินไข่", true),
      Answer("ก่อกรรมทำเวรก่อกรรมทำเวร", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดมีความหมายสอดคล้องกับข้อความต่อไปนี้ 'รวบรวมทีละเล็กละน้อย ทำอะไรที่ประกอบด้วยส่วนเล็กส่วนน้อยจนสำเร็จเป็นรูปเป็นร่างขึ้นมา'",
    [
      Answer("ก่อร่างสร้างตัว", false),
      Answer("เกี่ยวแฝกมุงป่า", false),
      Answer("เก็บเบี้ยใต้ถุนร้าน", true),
      Answer("งมเข็มในมหาสมุทร", false),
    ],
  ));
  list.add(thai4(
    "ข้อใดใช้ระดับภาษาต่างกับข้ออื่น",
    [
      Answer(
          "โครงการรถไฟความเร็วสูงเชื่อมระหว่างเมืองคุนหมิงในมณฑลยูนนานกับเมืองเวียงจันทน์",
          false),
      Answer(
          "เดิมทีเราเข้าใจกันว่าจีนจะใช้เส้นทางที่ผ่านเรียงของในจังหวัดเชียงราย แต่ล่าสุดจีนกลับเลือกเส้นที่ผ่านแขวงอุดมไชย",
          true),
      Answer(
          "เส้นทางรถไฟความเร็วสูงดังกล่าวจะเริ่มก่อสร้างตั้งแต่ปี 2555 และใช้เวลาก่อสร้างประมาณ 45 ปี",
          false),
      Answer(
          "ประเทศจีนจะใช้ประโยชน์ทั้งด้านการขนส่งสินค้าลงมาและการนําทรัพยากรกลับไปยังประเทศจีน",
          false),
    ],
  ));
  list.add(thai4(
    "ข้อใดใช้ราชาศัพท์ไม่ถูกต้อง",
    [
      Answer(
          "พระบาทสมเด็จพระเจ้าอยู่หัวเสด็จลง ณ บริเวณลานพระราชานุสาวรีย์ของ สมเด็จพระมหิตลาธิเบศร อดุลยเดชวิกรม พระบรมราชชนก โรงพยาบาลศิริราช",
          false),
      Answer(
          "สมเด็จพระนางเจ้าฯ พระบรมราชชินีนาถทรงพระกรุณาโปรดเกล้าฯ ให้แพทย์วินิจฉัยโรคแก่ราษฎร แล้วทรงรับเข้าเป็นคนไข้ในพระราชานุเคราะห์",
          false),
      Answer(
          "สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารีเสด็จพระราชดำเนินไปยังโรงเรียนนายร้อยพระจุลจอมเกล้า เขาชะโงก เพื่อทรงบรรยายวิชาประวัติศาสตร์",
          false),
      Answer(
          "พระเจ้าวรวงศ์เธอ พระองค์เจ้าโสมสวลี พระวรราชาทินัดดามาตุเสด็จไปพระราชทานรางวัลแม่ดีเด่นแห่งชาติ",
          true),
    ],
  ));
  list.add(thai4(
    "ข้อใดจำเป็นต้องใช้คำภาษาอังกฤษ",
    [
      Answer("การประชุมพนักงานครั้งนี้มีการจัดเวิร์กช็อปด้วย", false),
      Answer("โทรทัศน์ระบบดิจิทัลมีภาพคมชัดกว่าระบบเดิม", true),
      Answer("เขาสร้างอิมเมจว่าตัวเองเป็นนักแสดงที่มีจิตสาธารณะ", false),
      Answer("คนเจเนอเรชันใหม่กลับมานิยมนุ่งกระโปรงสั้นกันอีกแล้ว", false),
    ],
  ));
  list.add(thai4(
    "ข้อความต่อไปนี้ผู้พูดมีเจตนาตรงกับข้อใด 'คุณสมพงษ์ยังไม่รีบกลับบ้านใช่ไหม พอดีผมมีธุระด่วนจะให้คุณช่วยหน่อย' ",
    [
      Answer("ขอร้อง", true),
      Answer("แนะนำ", false),
      Answer("ไต่ถาม", false),
      Answer("บอกกล่าว", false),
    ],
  ));
  list.add(thai4(
    "คำราชาศัพท์มีรากศัพท์มาจากข้อใด",
    [
      Answer("ภาษาเขมร", true),
      Answer("ถูกทุกข้อ", false),
      Answer("ภาษาไทย", false),
      Answer("ภาษาบาลี-สันสกฤต", false),
    ],
  ));
  list.add(thai4(
    "คำราชาศัพท์มีกี่ระดับ",
    [
      Answer("5 ระดับ", true),
      Answer("4 ระดับ", false),
      Answer("3 ระดับ", false),
      Answer("2 ระดับ", false),
    ],
  ));
  return list;
}
