class soci4 {
  final String questionText;
  final List<Answer> answersList;

  soci4(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<soci4> getQuestions() {
  List<soci4> list = [];
  //ADD questions and answer here
  list.add(soci4(
    "ข้อใดสอดคล้องกับคำกล่าวที่ว่า'มนุษย์เป็นสัตว์สังคม'",
    [
      Answer("มนุษย์สามารถใช้สมองและร่วมมือกันได้อย่างมีประสิทธิภาพ", false),
      Answer("มนุษย์ต้องอยู่รวมกันเป็นกลุ่มเพื่อพึ่งพาอาศัยกัน", true),
      Answer("มนุษย์ต้องดิ้นรนเพื่อต่อสู้กับความอยู่รอดของชีวิต", false),
      Answer("มนุษย์สามารถปรับตัวเข้ากับสภาพแวดล้อมได้ดี", false),
    ],
  ));

  list.add(soci4(
    "ข้อใดเป็นลักษณะความสัมพันธ์ทางอ้อมในสังคมมนุษย์",
    [
      Answer("ครูสอนหนังสือในชั้นเรียน", false),
      Answer("แม่บ้านฟังละครวิทยุที่ออกอากาศตอนบ่าย", true),
      Answer("หัวหน้ามอบหมายงานให้ลุกน้องทำ", false),
      Answer("พ่อแม่อบรมลุกเกี่ยวกับมารยาทบนโต๊ะอาหาร", false),
    ],
  ));

  list.add(soci4(
    "การที่ภายในโรงเรียนกำหนดให้นักเรียนแต่งกายด้วยเครื่องแบบที่ถูกต้องเป็นลักษณะองค์ประกอบของสังคมในข้อใด",
    [
      Answer("ประชากร", false),
      Answer("อาณาเขต", false),
      Answer("การจัดระเบียบทางสังคม", true),
      Answer("ความสัมพันธ์", false),
    ],
  ));

  list.add(soci4(
    "พฤติกรรมส่วนใหญ่ของมนุษย์มีที่มาอย่างไร",
    [
      Answer("เกิดจากธรรมชาติ", false),
      Answer("เกิดจากพันธุกรรม", false),
      Answer("เกิดจากสัญชาตญาณ", false),
      Answer("เกิดจากการเรียนรู้", true),
    ],
  ));
  list.add(soci4(
    "สถาบันทางสังคมใดที่มีอิทธิพลต่อพฤติกรรมของมนุษย์มากที่สุด",
    [
      Answer("สถาบันศาสนา", false),
      Answer("สถาบันนันทนาการ", false),
      Answer("สถาบันการเมืองการปกครอง", false),
      Answer("สถาบันครอบครัว", true),
    ],
  ));
  list.add(soci4(
    "ข้อใดมีกริยานุเคราะห์?",
    [
      Answer("พ่อไปสวน", false),
      Answer("พี่สอบได้ที่ 1", false),
      Answer("น้องร้องไห้", false),
      Answer("ฝนคงจะตก", true),
    ],
  ));
  list.add(soci4(
    "ข้อใดเป็นความสัมพันธ์ระหว่างมนุษย์กับสถาบันเศรษฐกิจ",
    [
      Answer("การทำกิจกรรมสร้างสรรค์เพื่อเสริมสร้างสุขภาพกายและจิตใจ", false),
      Answer("การเข้าถึงข่าวสารข้อมูลผ่านสื่อสารสนเทศ", false),
      Answer("การทำประชาพิจารณ์โครงการสิ่งแวดล้อม", false),
      Answer("การแลกเปลี่ยนสินค้าและบริการ", true),
    ],
  ));
  list.add(soci4(
    "สถาบันใดสามารถทำหน้าที่ของสถาบันอื่นๆในสังคมได้ด้วย",
    [
      Answer("สถาบันการเมืองการปกครอง", false),
      Answer("สถาบันการศึกษา", false),
      Answer("สถาบันเศรษฐกิจ", false),
      Answer("สถาบันครอบครัว", true),
    ],
  ));
  list.add(soci4(
    "ข้อใดถือเป็นบทบาทหน้าที่ของสถาบันการศึกษา",
    [
      Answer("สร้างความบันเทิงให้เกิดในสังคม", false),
      Answer("เผยแพร่ข้อมูลข่าวสารอย่างเป็นกลาง", false),
      Answer("ส่งเสริมด้านการวิจัย", true),
      Answer("เป็นที่ยึดเหนี่ยวทางจิตใจ", false),
    ],
  ));
  list.add(soci4(
    "'โครงสร้างของสังคม' คือข้อใด",
    [
      Answer("สิ่งที่เป็นองค์ประกอบค้ำจุนสังคม", false),
      Answer("วัตถุประสงค์ที่วางไว้เพื่อให้บรรลุถึงเป้าหมาย", false),
      Answer("ความสัมพันธ์อย่างมีแบบแผนที่เกื้อหนุนและโยงใยต่อกันและกัน", true),
      Answer("อุดมการณ์ของสังคมเพื่อความมั่นคงถาวร", false),
    ],
  ));
  list.add(soci4(
    "ข้อใดคือองค์ประกอบที่สำคัญของโครงสร้างทางสังคม",
    [
      Answer("วัฒนธรรมและประเพณี", false),
      Answer("อำนาจและกลไก", false),
      Answer("กลุ่มและสถาบัน", true),
      Answer("ทัศนคติและพฤติกรรม", false),
    ],
  ));
  list.add(soci4(
    "ข้อใดกล่าวถูต้องเกี่ยวกับการจัดระเบียบทางสังคม",
    [
      Answer("เป็นสิ่งที่เกิดจากธรรมชาติสร้างสรรค์", false),
      Answer("เป็นการจัดกฎเกณฑ์ให้เป็นแบบแผนเพื่อการอยู่ร่วมกัน", true),
      Answer("ทุกสังคมมีการจัดระเบียบที่มีมาตรฐานเดียวกัน", false),
      Answer("การจัดระเบียบทางสังคมมีลักษณะที่เป็นกฎหมายต่างกัน", false),
    ],
  ));
  list.add(soci4(
    "พฤติกรรมใดที่ถือเป็นการฝ่าฝืนวิถีประชา",
    [
      Answer("ยักยอกเงินของบริษัท", false),
      Answer("เมาแล้วขับรถ", false),
      Answer("สวมชุดสีแดงไปงานศพ", true),
      Answer("หลบเลี่ยงการจ่ายภาษี", false),
    ],
  ));
  list.add(soci4(
    "นางสาวหน่อยเดินทางไปลงคะแนนเสียงเลือกตั้ง ส.ส. แต่เช้า การกระทำของนางสาวหน่อยเป็นการปฏิบัติตามบรรทัดฐานใด",
    [
      Answer("จารีต", false),
      Answer("กฎหมาย", true),
      Answer("ค่านิยม", false),
      Answer("วิถีประชา", false),
    ],
  ));
  list.add(soci4(
    "ข้อใดเป็นสถานภาพที่ติดตัวมาแต่กำเนิด",
    [
      Answer("จิ๊บ เป็นนักกีฬาว่ายน้ำทีมชาติ", false),
      Answer("นุ่น ชนะเลิศการประกวดคัดลายมือ", false),
      Answer("หนุ่ย มีผิวสองสีและดวงตาโต", true),
      Answer("เตย เป็นผู้บริหารระดับสูงในองค์กรแห่งหนึ่ง", false),
    ],
  ));
  list.add(soci4(
    "เหตุการณ์ในข้อใดที่สถานภาพและบทบาท 'ไม่สัมพันธ์กัน'",
    [
      Answer("นักเรียนลอกข้อสอบวิชาภาษาไทย", true),
      Answer("หนังสือพิมพ์ลงข่าวการแพร่เชื้อไวรัสโควิด 19", false),
      Answer("ตำรวจสืบสวนผู้ต้องหาคดีชิงทรัพย์", false),
      Answer("หน่วยกู้ภัยเข้าช่วยผู้ติดอยู่ในซากอาคารถล่ม", false),
    ],
  ));
  list.add(soci4(
    "ข้อใดไม่ใช่วิถีประชา",
    [
      Answer("วัยรุ่นชอบใส่เสื้อยืด กางเกงยีนส์", false),
      Answer("นักเรียนพูดจาไม่สุภาพจะถูกติเตียนเสมอ", false),
      Answer("ชาวพุทธสวดมนต์ไหว้พระเพื่อทำจิตใจให้สงบ", false),
      Answer("ห้ามสูบบุหรี่บนรถประจำทาง ปรับ 2,000 บาท", true),
    ],
  ));
  list.add(soci4(
    "ข้อใดเป็นคำกริยาทุกคำ",
    [
      Answer("บัณฑูร อนุมัติ สมดุล", false),
      Answer("สลอน สัมมาคารวะ อนุมาน", false),
      Answer("กัลบก แถลง ขมา", false),
      Answer("กล้ำกลืน กำสรด เถลิง", true),
    ],
  ));
  list.add(soci4(
    "ข้อใดถือว่า เป็นการทำผิดจารีตหรือกฎศีลธรรม",
    [
      Answer("การเขียนหนังสือด้วยมือซ้าย  ", false),
      Answer("การไม่ทำพิธีเจิมร้านค้าที่เปิดใหม่", false),
      Answer("การหลีกเลี่ยงการเสียภาษี", false),
      Answer("ลูกอกตัญญู", true),
    ],
  ));
  list.add(soci4(
    "ข้อใดเป็นปัญหาสำคัญที่เป็นรากฐานของปัญหาอื่นๆ ในสังคมไทย",
    [
      Answer("ปัญหาครอบรัว", true),
      Answer("ปัญหาอาชญากรรม", false),
      Answer("ปัญหายาเสพติด", false),
      Answer("ปัญหาสิ่งแวดล้อม", false),
    ],
  ));
  list.add(soci4(
    "สาเหตุสำคัญของบุคคลในข้อใดก่อให้เกิดปัญหาสังคมได้มากที่สุด",
    [
      Answer("มีความมั่นใจในตนเองสูง", false),
      Answer("ขาดความรับผิดชอบ", true),
      Answer("การพึ่งพาบุคคลอื่น", false),
      Answer("ความยากจน", false),
    ],
  ));
  list.add(soci4(
    "แนวโน้มของสังคมไทยในยุคโลกาภิวัตน์จะมีลักษณะดังต่อไปนี้ ยกเว้นข้อใด",
    [
      Answer("คุณธรรมและจริยธรรมเสื่อมลง", false),
      Answer("เชื่อในเรื่องโชคลางและไสยศาสตร์", true),
      Answer("ชายหญิงนิยมอยู่กันก่อนจะแต่งงาน", false),
      Answer("ครอบครัวเดี่ยวมีมากขึ้น", false),
    ],
  ));
  list.add(soci4(
    "'เกริกเกียรติเป็นคนที่อยู่ทางภาคเหนือ เขาจึงเป็นคนที่มีความสุภาพ พูดจานุ่มนวล หน้าตายิ้มแย้ม เป็นไมตรีกับคนทั่วไป' ข้อความนี้แสดงถึงความสำคัญของวัฒนธรรมอย่างไร",
    [
      Answer("มีผลต่อคุณภาพชีวิตของคนภาคเหนือ", false),
      Answer("ความสัมพันธ์ระหว่างสถานภาพของคนในสังคม", false),
      Answer("หล่อหลอมบุคลิกภาพให้สมาชิกของสังคมให้มีลักษณะแบบเดียวกัน", true),
      Answer("อุดมการณ์ ค่านิยม และทัศนคติของบุคคล", false),
    ],
  ));
  list.add(soci4(
    "'ประชาชนในจังหวัดยโสธรจะร่วมมือกันจัดประเพณีบุญบั้งไฟเป็นประจำทุกปี' ข้อความนี้แสดงถึงความสำคัญของวัฒนธรรมอย่างไร",
    [
      Answer("มีจุดหมายปลายทาง", false),
      Answer("สังคมมีความเป็นระเบียบ", false),
      Answer("ก่อให้เกิดความเป็นอันหนึ่งอันเดียวกัน", true),
      Answer("การเรียนรู้ระเบียบทางสังคมและวัฒนธรรมไทย", false),
    ],
  ));
  list.add(soci4(
    "เริงชัยเป็นผู้ที่มีมารยาทในการพบผู้ใหญ่ มีมารยาทในการเข้าสังคม เขาปฏิบัติตนตามวัฒนธรรมในข้อใด",
    [
      Answer("วัตถุธรรม", false),
      Answer("สหธรรม", true),
      Answer("เนติธรรม", false),
      Answer("คติธรรม", false),
    ],
  ));
  list.add(soci4(
    "ชาวไทยได้รับวัฒนธรรมมาจากชาติใด",
    [
      Answer("พม่า จีน", false),
      Answer("จีน ลาว", false),
      Answer("เขมร ลาว", false),
      Answer("จีน อินเดีย", true),
    ],
  ));
  list.add(soci4(
    "ข้อความเกี่ยวกับพื้นฐานของวัฒนธรรมไทย ข้อใด ไม่ถูกต้อง",
    [
      Answer("พระพุทธศาสนาเป็นบ่อเกิดของขนบธรรมเนียมประเพณีไทย", false),
      Answer("ภาษาขอม มอญ ละว้าเป็นพื้นฐานของวัฒนธรรมทางด้านภาษาของไทย", true),
      Answer("สภาพแวดล้อมทางภูมิศาสตร์ก่อให้เกิดประเพณีและวัฒนธรรม", false),
      Answer("วันสำคัญและเทศกาลสำคัญถือว่าเป็นวัฒนธรรมหลักของชาติ", false),
    ],
  ));
  list.add(soci4(
    "คนไทยส่วนใหญ่จะมีวิถีชีวิตและบุคลิกภาพที่อ่อนน้อม และให้ความเคารพผู้ใหญ่ บุคลิกภาพดังกล่าวนั้นได้มาอย่างไร ",
    [
      Answer("การขัดเกลาทางสังคมและวัฒนธรรม", true),
      Answer("สภาพแวดล้อมทางสังคม", false),
      Answer("การสื่อสารระหว่างกัน", false),
      Answer("เชื้อชาติและสภาพแวดล้อม", false),
    ],
  ));
  list.add(soci4(
    "วันนักขัตฤกษ์และประเพณีในข้อใด ที่แสดงถึงความรัก ความเคารพ และความผูกพันของคนในชาติ",
    [
      Answer("วันสงกรานต์ วันลอยกระทง วันครู", true),
      Answer("วันจักรี วันเด็ก วันธรรมะสวนะ", false),
      Answer("วันขึ้นปีใหม่ วันปิยมหาราช", false),
      Answer("วันวิสาขบูชา วันเด็ก วันเข้าพรรษา", false),
    ],
  ));
  list.add(soci4(
    "งานทำบุญตานก๋วยสลากหรืองานบุญสลากภัต มีคติสอนใจสำคัญในเรื่องใด",
    [
      Answer("ความรักใคร่ สามัคคีกัน", true),
      Answer("ความรับผิดชอบ", false),
      Answer("ความเสียสละ", false),
      Answer("ความเมตตา", false),
    ],
  ));
  return list;
}
