class soci1 {
  late final String questionText;
  late final List<Answer> answersList;

  soci1(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<soci1> getQuestions() {
  List<soci1> list = [];
  //ADD questions and answer here
  list.add(soci1(
    " ภูมิประเทศแบบใดที่เหมาะกับการทำกิจกรรมทางเศรษฐกิจและสังคม",
    [
      Answer(" ที่ราบ", true),
      Answer("ทะเลทราย", false),
      Answer("ภูเขา ", false),
      Answer("ขั้วโลก", false),
    ],
  ));
  list.add(soci1(
    " ข้อใดไม่ใช่ ปัจจัยทางกายภาพที่ทำให้ประชากรย้ายเข้ามาตั้งถิ่นฐานมากขึ้น",
    [
      Answer("ที่ดินอุดมสมบูรณ์เพาะปลูกได้", false),
      Answer("  มีอากาศหนาวเย็นจัด", true),
      Answer("มีทรัพยากรแร่ที่หลากหลาย ", false),
      Answer("มีแหล่งน้ำใช้ประโยชน์", false),
    ],
  ));
  list.add(soci1(
    "เพราะเหตุใดน่านน้ำของประเทศญี่ปุ่นจึงเป็นแหล่งที่มีปลาชุกชุม",
    [
      Answer("มีเทคโนโลยีทันสมัยในการเลี้ยงปลา", false),
      Answer(" มีแนวปะการังซึ่งเป็นที่อยู่อาศัยของปลา", false),
      Answer("มีกระแสน้ำเย็นและกระแสน้ำอุ่นมาบรรจบกัน ", true),
      Answer("เป็นเขตอนุรักษ์พันธ์ุสัตว์น้ำ", false),
    ],
  ));
  list.add(soci1(
    " ปัจฉิมโอวาทของพระพุทธเจ้า ตรัสไว้ในเรื่องใด",
    [
      Answer("อัปปมาทะธรรม", true),
      Answer(" พรหมวิหาร 4", false),
      Answer("สังคหวัตถุ 4 ", false),
      Answer("โอวาทปาติโมกข์", false),
    ],
  ));
  list.add(soci1(
    " ครูตั้งใจสอนนักเรียนด้วยความรักและเอาใจใส่ แสดงให้เห็นว่าครูปฏิบัติตามหลักพรหมวิหาร 4 ข้อใด",
    [
      Answer("เมตตา", true),
      Answer(" กรุณา", false),
      Answer("มุฑิตา ", false),
      Answer("อุเบกขา", false),
    ],
  ));
  list.add(soci1(
    " ครูและนักเรียนจัดงานอำลาให้แก่ครูที่เกษียณอายุราชการ ถือเป็นการปฏิบัติตามหลักพรหมวิหาร 4 ข้อใด",
    [
      Answer("เมตตา", false),
      Answer("กรุณา", false),
      Answer("มุฑิตา ", true),
      Answer("อุเบกขา", false),
    ],
  ));
  list.add(soci1(
    " บอส ไม่ยอมทำการบ้านเพราะมัวแต่เล่นเกม แสดงว่าบอสขาดการปฏิบัติตนตามหลักอริยสัจ 4 ข้อใด",
    [
      Answer("ทุกข์", false),
      Answer("สมุทัย", true),
      Answer("นิโรธ ", false),
      Answer("มรรค", false),
    ],
  ));
  list.add(soci1(
    " กันยาทำการบ้านส่งครูตามเวลา แสดงว่ากันยาปฏิบัติตามหลักอริยสัจ 4 ข้อใด",
    [
      Answer("ทุกข์", false),
      Answer("สมุทัย", false),
      Answer("นิโรธ ", true),
      Answer("มรรค", false),
    ],
  ));
  list.add(soci1(
    " การเกิดภูเขาไฟปะทุเกิดผลดีอย่างไร",
    [
      Answer("ดินมีธาตุอาหารอุดมสมบูรณ์", true),
      Answer("เกิดมลพิษทางอากาศ", false),
      Answer("มีแหล่งน้ำจืดเพิ่มขึ้น ", false),
      Answer("เกิดภูมิประเทศที่สวยงาม", false),
    ],
  ));
  list.add(soci1(
    " การแก้ปัญหาภาวะโลกร้อน ทุกประเทศควรปฏิบัติอย่างไร",
    [
      Answer("ลดการปล่อยแก๊สเรือนกระจก", true),
      Answer("ลดการตัดไม้ทำลายป่า", false),
      Answer("การปฏิบัติตามสนธิสัญญาไซเตส", false),
      Answer("ลดการพัฒนาอุตสาหกรรม", false),
    ],
  ));
  list.add(soci1(
    " สาเหตุของไฟป่าที่เกิดจากการกระทำของมนุษย์คือข้อใด",
    [
      Answer("ฟ้าผ่า", false),
      Answer("อุณหภูมิสูงขึ้น", false),
      Answer("การจุดไฟเพื่อล่าสัตว์ ", true),
      Answer("การเสียดสีของใบไม้", false),
    ],
  ));
  list.add(soci1(
    " ข้อใดเป็นลักษณะของพายุหมุนเขตร้อน ",
    [
      Answer("ก่อตัวขึ้นในมหาสมุทรหรือทะเล", true),
      Answer("ก่อตัวขึ้นเมื่อมีอากาศเย็น", false),
      Answer("เกิดขึ้นหลังจากแผ่นดินไหว ", false),
      Answer("เกิดบริเวณขั้วโลกเหนือ", false),
    ],
  ));
  list.add(soci1(
    "พายุเซินติน ที่สร้างความเสียหายให้กับหลายประเทศในทวีปเอเชียในช่วงเดือนกรกฎาคมที่ผ่านมา มีความรุนแรงอยู่ในระดับใด",
    [
      Answer("ดีเปรสชัน", false),
      Answer("โซนร้อน", true),
      Answer(" ไต้ฝุ่น ", false),
      Answer("ทอร์นาโด", false),
    ],
  ));
  list.add(soci1(
    "พายุหมุนเขตร้อนที่มีความรุนแรงและสร้างความเสียหายได้รุนแรงมากที่สุดคือข้อใด",
    [
      Answer("ดีเปรสชัน", false),
      Answer(" โซนร้อน", false),
      Answer("ไต้ฝุ่น ", true),
      Answer("ลมมรสุม", false),
    ],
  ));
  list.add(soci1(
    "การเกิดภูเขาไฟระเบิดส่งผลกระทบอย่างไร",
    [
      Answer("เกิดมลพิษทางอากาศ", true),
      Answer(" ปะการังถูกทำลาย", false),
      Answer("ฝนไม่ตกตามฤดูกาล ", false),
      Answer("ปริมาณน้ำในทะเลสูงขึ้น", false),
    ],
  ));
  list.add(soci1(
    "ข้อใดเป็นการป้องกันภัยจากน้ำท่วม",
    [
      Answer("ใช้น้ำอย่างประหยัด", false),
      Answer("ไม่ปล่อยน้ำเสียลงสู่แม่น้ำ", false),
      Answer("ขุดคลองระบายน้ำ ", true),
      Answer("สร้างตึกสูงบริเวณที่เกิดน้ำท่วม", false),
    ],
  ));
  list.add(soci1(
    " ข้อใดเป็นการป้องกันภัยจากแผ่นดินไหว ",
    [
      Answer("ไม่ตัดต้นไม้ทำลายป่า", false),
      Answer("ปลูกต้นไม้เพิ่มมากขึ้น", false),
      Answer("สร้างอาคารบ้านเรือนให้ทนต่อแรงสั่นสะเทือน ", true),
      Answer("ลดการปล่อยแก๊สคาร์บอนมอนนอกไซด์", false),
    ],
  ));
  list.add(soci1(
    "ข้อใดเป็นการแก้ไขปัญหาโลกร้อน",
    [
      Answer("ปลูกต้นไม้เพิ่มมากขึ้น", true),
      Answer("ใช้ถุงพลาสติกแทนถุงผ้า", false),
      Answer("ลดการใช้ผลิตภัณฑ์แปรรูป ", false),
      Answer("เปิดเครื่องปรับอากาศระบายความร้อน", false),
    ],
  ));
  list.add(soci1(
    " กิจกรรมที่เป็นสาเหตุสำคัญทำให้เกิดภาวะโลกร้อนมากที่สุดคือข้อใด",
    [
      Answer("ซ่อมแซมเครื่องใช้ไฟฟ้า", false),
      Answer("ปล่อยน้ำเสียลงสู่แม่น้ำ", false),
      Answer("การเผาป่า ", true),
      Answer("การใช้สารเคมีกำจัดศัตรูพืช", false),
    ],
  ));
  list.add(soci1(
    " การเกิดคลื่นสึนามิในมหาสมุทรมีความสัมพันธ์กับปรากฏการณ์ทางธรรมชาติในข้อใดมากที่สุด",
    [
      Answer("การเกิดน้ำขึ้น น้ำลง", false),
      Answer("ฝนตกติดต่อกันเป็นเวลานาน", false),
      Answer("การเกิดแผ่นดินไหวในมหาสมุทร ", true),
      Answer("อุกกาบาตตกในมหาสมุทร", false),
    ],
  ));
  list.add(soci1(
    "การเปลี่ยนแปลงทางธรรมชาติข้อใดส่งผลกระทบต่อประชากรทั่วโลกมากที่สุด",
    [
      Answer("ภาวะโลกร้อน", true),
      Answer(" แผ่นดินไหว", false),
      Answer("ภัยแล้ง ", false),
      Answer("ไฟป่า", false),
    ],
  ));
  list.add(soci1(
    "ถ้านักเรียนต้องการเดินทางไปชมความงามของทะเลสาบเทาโป นักเรียนจะต้องเดินทางไปที่ใด",
    [
      Answer("เกาะใต้ของนิวซีแลนด์", false),
      Answer("เกาะเหนือของนิวซีแลนด์", true),
      Answer("เกาะแทสมาเนียของออสเตรเลีย ", false),
      Answer("ประเทศปาปัวนิวกินี", false),
    ],
  ));
  list.add(soci1(
    "ภัยธรรมชาติที่มักเกิดกับหมู่เกาะในมหาสมุทรแปซิฟิกคือข้อใด",
    [
      Answer("น้ำท่วม", false),
      Answer("ภูเขาไฟระเบิด", true),
      Answer("ดินโคลนถล่ม ", false),
      Answer("ไฟป่า", false),
    ],
  ));
  list.add(soci1(
    " ชาติใดมีอิทธิพลต่อการเปลี่ยนแปลงวัฒนธรรมในทวีปออสเตรเลียและโอเชียเนียมากที่สุด",
    [
      Answer("ยุโรป", true),
      Answer(" จีน", false),
      Answer("ญี่ปุ่น ", false),
      Answer("อินเดีย", false),
    ],
  ));
  list.add(soci1(
    " ปัจจัยข้อใดทำให้ชาวยุโรปอพยพเข้ามาอยู่ในทวีปออสเตรเลียเป็นจำนวนมาก",
    [
      Answer("สภาพทางสังคมดี", false),
      Answer(" เศรษฐกิจดี", false),
      Answer("ภูมิอากาศคล้ายคลึงกับยุโรป ", true),
      Answer("การเมืองมั่นคง", false),
    ],
  ));
  list.add(soci1(
    " ภูมิอากาศแบบใดในทวีปออสเตรเลีย ที่ทำให้มีประชากรอาศัยอยู่อย่างเบาบาง",
    [
      Answer("ภูมิอากาศแบบสะวันนา", false),
      Answer("ภูมิอากาศแบบอบอุ่นชื้น", false),
      Answer("ภูมิอากาศแบบภาคพื้นสมุทร ", false),
      Answer("ภูมิอากาศแบบทะเลทรายเขตร้อน", true),
    ],
  ));
  list.add(soci1(
    " สินค้าส่งออกสำคัญของประเทศในหมู่เกาะมหาสมุทรแปซิฟิกคืออะไร",
    [
      Answer("ผลิตภัณฑ์จากนม เนย", false),
      Answer("น้ำมันดิบ", false),
      Answer("คอมพิวเตอร์ ", false),
      Answer("ผลิตภัณฑ์จากมะพร้าว", true),
    ],
  ));
  list.add(soci1(
    " ชนเผ่าเมารี อยู่ในประเทศใด",
    [
      Answer("ออสเตรเลีย", false),
      Answer("นิวซีแลนด์", true),
      Answer("ปาปัวนิวกินี ", false),
      Answer("คิริบาส", false),
    ],
  ));
  list.add(soci1(
    " ข้อใดเป็นลักษณะของประเทศในหมู่เกาะมหาสมุทรแปซิฟิก",
    [
      Answer("เศรษฐกิจขึ้นอยู่กับอุตสาหกรรมขนาดใหญ๋", false),
      Answer("เป็นหมู่เกาะขนาดใหญ๋", false),
      Answer("ตั้งอยู่ในมหาสมุทรอินเดีย ", false),
      Answer("มีอากาศร้อนและฝนตกชุก", true),
    ],
  ));
  list.add(soci1(
    " ข้อใดเป็นสินค้าส่งออกสำคัญของประเทศนิวซีแลนด์",
    [
      Answer("ผลิตภัณฑ์จากขนแกะ", false),
      Answer("ผลิตภัณฑ์จากอาหารทะเล", true),
      Answer("เฟอร์นิเจอร์ไม้ ", false),
      Answer("ผัก ผลไม้", false),
    ],
  ));
  list.add(soci1(
    " ปัจจัยสำคัญข้อใดที่ทำให้ประชากรอพยพเข้ามาในเมืองใหญ่มากขึ้น",
    [
      Answer("การศึกษาเล่าเรียน", false),
      Answer("การประกอบอาชีพ", true),
      Answer("การหนีภัยธรรมชาติ ", false),
      Answer("การหนีโรคระบาด", false),
    ],
  ));
  list.add(soci1(
    " ประเทศนิวซีแลนด์ มีลักษณะภูมิประเทศที่สำคัญทางเศรษฐกิจคือข้อใด",
    [
      Answer("เป็นแหล่งเลี้ยงสัตว์ที่สำคัญ", true),
      Answer("เป็นแหล่งแร่ที่สำคัญ", false),
      Answer("เป็นแหล่งปลูกพืชที่สำคัญ ", false),
      Answer("เป็นแหล่งป่าไม้ที่สำคัญ", false),
    ],
  ));
  list.add(soci1(
    " เหตุใดด้านตะวันตกของประเทศออสเตรเลียจึงมีการทำกิจกรรมทางเศรษฐกิจและสังคมน้อย",
    [
      Answer("เป็นเทือกเขาและทะเลทราย", true),
      Answer("มีสิ่งแวดล้อมเป็นพิษ", false),
      Answer("เป็นแหล่งโบราณสถานที่สำคัญ ", false),
      Answer("เป็นที่ราบลุ่มจึงมีปัญหาน้ำท่วม", false),
    ],
  ));
  list.add(soci1(
    "ทวีปเอเชียกับทวีปออสเตรเลียและโอเชียเนียมีความคลึงกันมากที่สุดในข้อใด",
    [
      Answer("รถยนต์", false),
      Answer("เนื้อสัตว์แช่แข็ง", true),
      Answer("ผลไม้กระป๋อง ", false),
      Answer("คอมพิวเตอร์", false),
    ],
  ));
  list.add(soci1(
    " แหล่งปลูกข้าวสาลีที่สำคัญของประเทศออสเตรเลียอยู่บริเวณใด",
    [
      Answer("ที่ราบสเติร์ท", false),
      Answer("ที่ราบนัลลาบอร์", false),
      Answer("ที่ราบสูงคิมเบอร์ลี่ ", false),
      Answer("ที่ราบลุ่มแม่น้ำเมอร์รีย์-ดาร์ลิง", true),
    ],
  ));
  list.add(soci1(
    " ข้อใดกล่าวถูกต้องเกี่ยวกับทวีปออสเตรเลียและโอเชียเนีย",
    [
      Answer("พื้นที่ส่วนใหญ่อยู่ในซีกโลกเหนือ", true),
      Answer("พื้นที่มีขนาดใหญ่เป็นอันดับ 2 รองจากทวีปเอเชีย", false),
      Answer("ประชากรส่วนใหญ่มีชาติพันธุ์นิกรอยด์ ", false),
      Answer("พื้นที่ของทวีปล้อมรอบด้วยมหาสมุทรและทะเล", false),
    ],
  ));
  return list;
}
/// แหล่งที่มาข้อสอบ https://quizizz.com/admin/quiz/5b9a332c4db2980019341913/%E0%B9%81%E0%B8%9A%E0%B8%9A%E0%B8%97%E0%B8%94%E0%B8%AA%E0%B8%AD%E0%B8%9A%E0%B8%9B%E0%B8%A5%E0%B8%B2%E0%B8%A2%E0%B8%A0%E0%B8%B2%E0%B8%84-%E0%B8%AA%E0%B8%B1%E0%B8%87%E0%B8%84%E0%B8%A1%E0%B8%A8%E0%B8%B6%E0%B8%81%E0%B8%A9%E0%B8%B2-1-%E0%B8%AA21101-%E0%B8%A1-1