class math6 {
  late final String questionText;
  late final List<Answer> answersList;

  math6(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<math6> getQuestions() {
  List<math6> list = [];
  //ADD questions and answer here
  list.add(math6(
    " จงหารากที่สามของ 343 ",
    [
      Answer("5 ", false),
      Answer(" 6", false),
      Answer("7 ", true),
      Answer("8", false),
    ],
  ));
  list.add(math6(
    " ข้อใดเป็นความหมายของสถิติ ",
    [
      Answer(
          "สถิติ หมายถึง จำนวนหรือค่าที่ได้จากการเก็บรวมข้อมูล แสดงถึงข้อเท็จจริงของสิ่งที่ต้องการศึกษา",
          false),
      Answer(
          "สถิติ หมายถึง ศาสตร์ที่ว่าด้วยระเบียบวิธีการทางสถิติ ซึ่งประกอบด้วย การเก็บรวบรวมข้อมูลการนำเสนอข้อมูล การรวิเคราะห์และแปลความหมายข้อมูล",
          false),
      Answer(
          "สถิติ หมายถึง ศาสตร์หรือหลักการที่นำมากระทำกับหลักฐานที่เป็นข้อมูล อาจจะเป็นข้อมูลเชิงปริมาณหรือเชิงคุณภาพ ",
          false),
      Answer("ถูกทุกข้อ", true),
    ],
  ));
  list.add(math6(
    " ข้อความใดไม่ใช่ข้อมูลแสดงปริมาณ ",
    [
      Answer("น้ำหนักของนักเรียน", false),
      Answer("จำนวนลูกมะพร้าว", false),
      Answer("ระดับความพึงพอใจของนักเรียน ", true),
      Answer("ระยะทางจากบ้านมาโรงเรียน", false),
    ],
  ));
  list.add(math6(
    " ข้อใดไม่ใช่ข้อมูลเชิงคุณภาพ",
    [
      Answer("เพศของสมาชิกในครอบครัว", false),
      Answer("สถานภาพสมรสของครูในโรงเรียน", false),
      Answer("บ้านเลขที่ของนักเรียน ", false),
      Answer("จำนวนคนในครัวเรือน", true),
    ],
  ));
  list.add(math6(
    " ข้อใดเป็นขั้นตอนแรกในการดำเนินการทางสถิติ",
    [
      Answer("การตีความหมายข้อมูล", false),
      Answer("การเก็บรวบรวมข้อมูล", true),
      Answer("การวิเคราะห์ข้อมูล ", false),
      Answer("การนำเสนอข้อมูล", false),
    ],
  ));
  list.add(math6(
    " ข้อใดเป็นข้อมูลปฐมภูมิ",
    [
      Answer("ข้อมูลจำนวนผู้ว่างงานจากสำนักงานสถิติแห่งชาติ", false),
      Answer(
          "ผลสอบ O-NET ของนักเรียน จากสถาบันการทดสอบการศึกษาแห่งชาติ", false),
      Answer("การทดสอบสมรรถภาพของนักเรียน ", true),
      Answer("ถูกทุกข้อ", false),
    ],
  ));
  list.add(math6(
    " ให้พิจารณาข้อมูลต่อไปนี้ แล้วตอบคำถาม 4, 5, 7, 9, 11, 12, 15, 15, 15, 18, 21, 24, 25 ค่าเฉลี่ยเลขคณิตของข้อมูลชุดนี้ตรงกับข้อใด",
    [
      Answer("10", false),
      Answer("13", true),
      Answer("11 ", false),
      Answer(" 12", false),
    ],
  ));
  list.add(math6(
    " ถ้าผลรวมของข้อมูลชุดหนึ่งเท่ากับ 850 และมี ค่าเฉลี่ยเลขคณิตเท่ากับ 17 แล้วข้อมูลชุดนี้มี ทั้งหมดกี่จำนวน",
    [
      Answer("45", false),
      Answer("48", false),
      Answer("50", true),
      Answer("53", false),
    ],
  ));
  list.add(math6(
    " เด็กหญิงปูเก็บเงินเป็นเวลา 40 เดือน โดยเก็บเงินเดือนแรก 500 บาท เดือนที่สอง 550 บาท เดือนที่สาม 600 บาท และเดือนต่อๆไปเก็บเงินเพิ่มขึ้นจากเดือนก่อนหน้าอีก 50 บาท เด็กหญิงปูเก็บเงินได้รวมทั้งหมดกี่บาท",
    [
      Answer("50,000 บาท", false),
      Answer("59,000 บาท", true),
      Answer("58,500 บาท ", false),
      Answer("60,000 บาท", false),
    ],
  ));
  list.add(math6(
    " ผู้จัดงานแสดงดนตรีแจกเสื้อให้ผู้ร่วมงานคนที่ 99, 144, 189, 234, 279, ... ถ้ามีคนเข้าร่วมงาน 1,500 คน จะมีคนได้รับเสื้อ กี่ค",
    [
      Answer("31", false),
      Answer("32", true),
      Answer("33 ", false),
      Answer("34", false),
    ],
  ));
  list.add(math6(
    " ถ้า A - B = {2,4,6}, B – A = {0,1,3} และ A B = {0,1,2,3,4,5,6,7,8} แล้ว A B เป็นสับเซตของเซตในข้อใดต่อไปนี้",
    [
      Answer("{0,1,4,5,6,7}", false),
      Answer("{0,1,2,4,5,6,8}", false),
      Answer("{0,2,4,5,6,8} ", false),
      Answer("{0,1,3,5,7,8}", true),
    ],
  ));
  list.add(math6(
    " ในการสอบถามพ่อบ้านจำนวน 300 คนพบว่า มีคนที่ไม่ดื่มทั้งชาและกาแฟ 100 คน มีคนที่ดื่มชา 100 คน และมีคนที่ดื่มกาแฟ 150 คน พ่อบ้านที่ดื่มทั้งชาและกาแฟมีจำนวนเท่าใด",
    [
      Answer("20", false),
      Answer("30", false),
      Answer("40 ", false),
      Answer("50", true),
    ],
  ));
  list.add(math6(
    "นักเรียนกลุ่มหนึ่งจำนวน 50 คน มี 32 คนไม่ชอบเล่นกีฬาและไม่ชอบฟังเพลง ถ้ามี 6 คน ชอบฟังเพลงแต่ไม่ชอบเล่นกีฬา และมี 1 คน ชอบเล่นกีฬาแต่ไม่ชอบฟังเพลงแล้วนักเรียนในกลุ่มนี้ที่ชอบเล่นกีฬาและชอบฟังเพลงมีจำนวนเท่ากับข้อใดต่อไปนี้",
    [
      Answer("18 คน", false),
      Answer("17 คน", false),
      Answer("12 คน ", false),
      Answer(" 11 คน ", true),
    ],
  ));
  list.add(math6(
    "ให้ A เป็นเซตจำกัด และ B เป็นเซตอนันต์ ข้อความใดต่อไปนี้เป็นเท็จ",
    [
      Answer("มีเซตจำกัดที่เป็นสับเซตของ A", false),
      Answer("มีเซตจำกัดที่เป็นสับเซตของ B", false),
      Answer("มีเซตอนันต์ที่เป็นสับเซตของ B ", false),
      Answer("มีเซตอนันต์ที่เป็นสับเซตของ A", true),
    ],
  ));
  list.add(math6(
    " ในการสำรวจความชอบในการดื่มชาเขียวและกาแฟของกลุ่มตัวอย่าง 32 คน พบว่า ผู้ชอบดื่มชาเขียวมี 18 คน ผู้ชอบดื่มกาแฟมี 16 คน ผู้ไม่ชอบดื่มชาเขียวและไม่ชอบดื่มกาแฟมี 8 คน จำนวนคนที่ชอบดื่มชาเขียวอย่างเดียวเท่ากับข้อใดต่อไปนี้",
    [
      Answer("6 คน", false),
      Answer("8 คน", true),
      Answer("10 คน ", false),
      Answer("12 คน", false),
    ],
  ));
  list.add(math6(
    "ให้ A={1,2,3, …} และ B={{1,2},{3,4,5},6,7,8,… } ข้อใดเป็นเท็จ",
    [
      Answer("A-B มีสมาชิก 5 ตัว.", false),
      Answer("จำนวนสมาชิกของพาวเวอร์เซตของ B-A เท่ากับ 4", false),
      Answer("A ∩ B คือเซตของจำนวนนับที่มีค่ามากว่า 5 ", false),
      Answer("จำนวนสมาชิกของ (A-B)U (B-A) เป็นจำนวนคู่", true),
    ],
  ));
  list.add(math6(
    " ข้อมูลชุดใด มีส่วนเบี่ยงเบนมาตรฐานที่มีค่ามากที่สุด ",
    [
      Answer(" 500 , 500 , 500 , 500 , 500 , 500.", false),
      Answer("44 , 44 , 45 , 45 , 46 , 46", false),
      Answer("100 , 100 , 100, 101 , 101 , 101 ", false),
      Answer("2 , 4 , 6 , 8 , 10 ,12", true),
    ],
  ));
  list.add(math6(
    "ครอบครัวหนึ่งมีพี่น้อง 6 คน เป็นชาย 2 คน หญิง 4 คน จำนวนวิธีที่จะจัดให้คนทั้งหกคนยืนเรียงกันเพื่อถ่ายรูปโดยให้ชายสองคนยืนอยู่ริมสองข้างเสมอ เท่ากับข้อใดต่อไปนี้",
    [
      Answer("12 วิธื", false),
      Answer("24 วิธี", false),
      Answer("36 วิธี ", false),
      Answer(" 48 วิธี", true),
    ],
  ));
  list.add(math6(
    " คะแนนของผู้เข้าสอบ15 คน เป็นดังนี้45 , 54 , 59 , 60 , 62 , 64 , 65 , 68 , 70 ,72 , 73 , 75 , 76 , 80 , 81ถ้าเกณฑ์ในการสอบผ่าน คือ ต้องได้คะแนนไม่ต่ำกว่าเปอร์เซ็นไทล์ ที่ 60 แล้ว ข้อใดต่อไปนี้ เป็นคะแนนต่ำสุดของผู้ที่สอบผ่าน",
    [
      Answer("68 คะแนน", false),
      Answer("70 คะแนน", false),
      Answer("71 คะแนน ", false),
      Answer("72 คะแนน", true),
    ],
  ));
  list.add(math6(
    "ข้อมูลชุดหนึ่ง ถ้าเรียงจากน้อยไปมากแล้ว ได้เป็นลำดับเลขคณิตต่อไปนี้2 , 5 , 8 , .... , 92ควอไทล์ที่ 3 ของข้อมูลชุดนี้มีค่าเท่ากับข้อใดต่อไปนี้",
    [
      Answer("68", false),
      Answer("69", false),
      Answer("70 ", false),
      Answer("71", true),
    ],
  ));
  list.add(math6(
    " กำหนดให้ f(x) = | x - 5| - 5 ข้อใดไม่ถูกต้อง",
    [
      Answer("f (-6) = 6", false),
      Answer("f (-5) = 5", false),
      Answer("f (5) = - 5 ", false),
      Answer(" f (6) = - 6", true),
    ],
  ));
  list.add(math6(
    "ในการสอบถามนักเรียน 10 คน เกี่ยวกับวิชาที่ชอบเรียนมากที่สุด ได้ผลสารวจดังนี้คณิตศาสตร์ ภาษาไทย ภาษาอังกฤษ คณิตศาสตร์ พละศึกษาชีววิทยา ภาษาไทย ชีววิทยา พละศึกษา ภาษาอังกฤษ ฐานนิยมของข้อมูลชุดนี้คือข้อใด",
    [
      Answer("ไม่มีฐานนิยม", true),
      Answer("ภาษาไทย", false),
      Answer("ภาษาอังกฤษ ", false),
      Answer(" คณิตศาสตร์", false),
    ],
  ));
  list.add(math6(
    " อันตรภาคชั้นหนึ่งซึ่งมีขอบบนเป็น 14.5 และมีจุดกึ่งกลางชั้นเป็น 12 ถ้าข้อมูลชุดนี้มีพิสัยเป็น 42 แล้วตารางแจกแจงความถี่นี้จะมีจำนวนอันตรภาคชั้นเท่ากับข้อใด",
    [
      Answer("6", false),
      Answer("7", false),
      Answer("8 ", false),
      Answer(" 9", true),
    ],
  ));
  list.add(math6(
    "อัตราส่วนของความถี่สะสมของอันตรภาคชั้นนั้นกับผลรวมของความถี่ทั้งหมดเท่ากับข้อใด",
    [
      Answer("ร้อยละความถี่สะสมสัมพัทธ์", false),
      Answer("ความถี่สัมพัทธ์", false),
      Answer("ความถี่สะสมสัมพัทธ์ ", true),
      Answer("ความถี่สะสม", false),
    ],
  ));
  list.add(math6(
    " ข้อความใดต่อไปนี้ไม่ถูกต้อง",
    [
      Answer(
          "การสำรวจด้วยตัวอย่างเป็นวิธีการเก็บรวบรวมข้อมูลที่ต้องการจากส่วนหนึ่งของประชากร",
          false),
      Answer(
          "อาชีพของผู้ปกครองของนักเรียนคนหนึ่งในห้องเรียนเป็นข้อมูลที่ไม่เป็นตัวเลข",
          false),
      Answer(
          "การสำมะโนเป็นวิธีการเก็บรวบรวมข้อมูลที่เราสนใจจากทุก ๆ หน่วย ในช่วงเวลาใดเวลาหนึ่ง ",
          false),
      Answer(
          " จำนวนเงินที่นักเรียนในห้องเรียนมีอยู่ในหนึ่งวัน เป็นข้อมูลที่ไม่เป็นตัวเลข",
          true)
    ],
  ));
  list.add(math6(
    " ข้อความใดไม่ใช่ข้อมูลแสดงปริมาณ",
    [
      Answer("อายุของนักเรียน", false),
      Answer("รายได้ของผู้ปกครอง", false),
      Answer("จำนวนนักเรียนในห้องเรียน ", false),
      Answer("เบอร์โทรศัพท์ของนักเรียนในห้องe", true),
    ],
  ));
  list.add(math6(
    " ข้อใดไม่ใช่ข้อมูลเชิงคุณภาพ",
    [
      Answer("เพศของสมาชิกในครอบครัว", false),
      Answer("สถานภาพสมรสของครูในโรงเรียน", false),
      Answer("ความชอบ ความคิดเห็น ", false),
      Answer("ความสูง ความยาว", true),
    ],
  ));
  list.add(math6(
    " การเก็บข้อมูลจากทุก ๆ หน่วยของประชากรที่สนใจศึกษา ภายในพื้นที่และระยะเวลาที่กำหนดเรียกว่าอะไร",
    [
      Answer("การสำรวจด้วยตัวอย่าง", false),
      Answer("การสำมะโน", true),
      Answer("การสำรวจข้อมูลด้วยแบบสอบถาม ", false),
      Answer(" การสังเกต", false),
    ],
  ));
  list.add(math6(
    "  ข้อใดเป็นข้อมูลปฐมภูมิ.",
    [
      Answer("ข้อมูลนักเรียนจากทะเบียนบ้าน", false),
      Answer("รูปภาพที่นักเรียนรวบรวม", true),
      Answer("สถิติคนไข้ที่ได้จากโรงพยาบาล ", false),
      Answer(" ผลการเรียนของนักเรียนจากทะเบียนของโรงเรียน", false),
    ],
  ));
  list.add(math6(
    " ข้อใดต่อไปนี้ถูกต้อง",
    [
      Answer("การสำรวจเป็นข้อมูลทุติยภูมิ", false),
      Answer("การสำมะโน เป็นข้อมูลทุติยภูมิ", false),
      Answer("การสัมภาษณ์เป็นข้อมูลทุติยภูมิ ", false),
      Answer(
          "สถิติการเสียชีวิตในเทศกาลปีใหม่จากสำนักงานสถิติเป็นข้อมูลทุติยภูมิ",
          true),
    ],
  ));
  list.add(math6(
    " ข้อใดไม่ใช่คุณสมบัติของการเก็บรวบรวมข้อมูลที่ดี",
    [
      Answer("ข้อมูลถูกต้อง", false),
      Answer("ข้อมูลสอดคล้องกับวัตถุประสงค์", false),
      Answer("ข้อมูลน่าเชื่อถือ", false),
      Answer(" ข้อมูลหลากหลาย", true),
    ],
  ));
  list.add(math6(
    " ข้อใดเป็นแหล่งข้อมูลปฐมภูมิ",
    [
      Answer("ข้อมูลงานวิจัย", false),
      Answer("ข้อมูลจากวารสารวิชาการ", false),
      Answer("ข้อมูลจากหน่วยงานราชการที่ได้เก็บรวบรวมไว้", false),
      Answer(" ข้อมูลการสัมภาษณ์เกษตรกร", true),
    ],
  ));

  return list;
}
///แหล่งที่มาข้อสอบ https://quizizz.com/admin/quiz/610c5ec6575572001bdb87d7/