class sic6 {
  late final String questionText;
  late final List<Answer> answersList;

  sic6(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<sic6> getQuestions() {
  List<sic6> list = [];
  //ADD questions and answer here
  list.add(sic6(
    " จงผันกริยาที่กำหนดให้ในรูป Past Participlewim” ",
    [
      Answer(" Swam", false),
      Answer(" Swimmed", false),
      Answer(" Swum ", true),
      Answer("Swing", false),
    ],
  ));
  list.add(sic6(
    " สารชีวโมเลกุลชนิดใดมีมากที่สุดของน้ำหนักแห้งในร่างกายคน ",
    [
      Answer("ไขมัน", false),
      Answer("กรดนิวคลีอิก", false),
      Answer("คาร์ไบไฮเดรต ", false),
      Answer(" โปรตีน", true),
    ],
  ));
  list.add(sic6(
    " ในการปรุงอาหารให้แก่ผู้สูงอายุควรหลีกเลี่ยงน้ำมันชนิดใด เพราะเหตุใด",
    [
      Answer("น้ำมันถั่วเหลือง เพราะมีโปรตีนมากเกินไป", false),
      Answer("น้ำมันมะพร้าว เพราะมีกรดไขมันอิ่มตัวมาก", false),
      Answer("น้ำมันรำ เพราะเกิดกลิ่นเหม็นหืนง่าย ", true),
      Answer("น้ำมันเมล็ดดอกคำฝอย เพราะมีกรดไขมันที่จำเป็นมาก", false),
    ],
  ));
  list.add(sic6(
    " ข้อใดไม่ถูกต้อง",
    [
      Answer("กรดไลโนเลอิก เป็นกรดไขมันชนิดไม่อิ่มตั", false),
      Answer(
          "ถ้าเด็กทารกขาดกรดไลโนเลนิก จะมีผิวหนังแห้ง อักเสบ หลุดลอก", false),
      Answer("ไขมันเมื่อต้มกับเบสจะเกิดปฏิกิริยาสะปอนนิฟิเคชัน ", false),
      Answer(" คอเลสเทอรอลไม่มีประโยชน์ต่อร่างกาย ทำให้เส้นเลือดอุดตัน", true),
    ],
  ));
  list.add(sic6(
    " กรดอะมิโนที่จำเป็นสำหรับทารกคือข้อใด",
    [
      Answer("ทริปโตเฟนและเมไทโอนีน", false),
      Answer("อาร์จินีน และฮีสติดีน", true),
      Answer("ไลซีนและลิวซีน ", false),
      Answer("ไอโซลิวซีนและเวลีน", false),
    ],
  ));
  list.add(sic6(
    " ข้อใดไม่ใช่หน้าที่ของโปรตีน",
    [
      Answer("รักษาสมดุลของน้ำและกรด-เบส", false),
      Answer("เป็นส่วนประกอบของเอนไซม์ทุกชนิด", false),
      Answer("ช่วยละลายวิตามิน A D E K ", true),
      Answer(" สร้างอิมมูโนโกลบูลิน", false),
    ],
  ));
  list.add(sic6(
    " ข้อใดไม่ใช่องค์ประกอบของกรดดีออกซีไรโบนิวคลีอิก ( DNA)",
    [
      Answer("น้ำตาลไรโบส", false),
      Answer("กรดไรโบนิวคลิอิก (RNA)", true),
      Answer("อะดีนีน ", false),
      Answer(" หมู่ฟอสเฟต", false),
    ],
  ));
  list.add(sic6(
    "โครงสร้างของDNA สายหนึ่งมีคู่เบสเป็น A C A G ดังนั้นคู่เบสของ DNA อีกสายคือข้อใด",
    [
      Answer("A C A G", false),
      Answer(".C A G A", false),
      Answer("T G T C ", true),
      Answer("G T T C", false),
    ],
  ));
  list.add(sic6(
    " ข้อความเกี่ยวกับกรดนิวคลิอิกต่อไปนี้ ข้อใดไม่ถูกต้อง",
    [
      Answer("มี 2 ชนิด คือ DNA และ RNA", false),
      Answer(
          "มีอยู่ในเซลล์ของสัตว์ชั้นต่ำไปจนถึงเซลล์ของสัตว์ชั้นสูง แต่ไม่มีในเซลล์ของพืช",
          true),
      Answer(
          "การตรวจลายพิมพ์ DNA ของบุคคลจะให้ส่วนใดส่วนหนึ่งของร่างกาย ก็ได้ ",
          false),
      Answer(
          "หน่วยย่อยประกอบด้วยโมเลกุลน้ำตาล ไนโตรเจน-เบส และหมู่ฟอสเฟต", false),
    ],
  ));
  list.add(sic6(
    " ค่าความเร่งโน้มถ่วงที่ผิวโลกเป็นกี่เท่าของค่าที่ความสูง 1600 กิโลเมตร จากผิวโลก(รัศมีของโลกเท่ากับ 6400 กิโลเมตร)",
    [
      Answer("1.25", false),
      Answer("1.56", true),
      Answer("2.00 ", false),
      Answer("4.00", false),
    ],
  ));
  list.add(sic6(
    " Tแรงแบบใดที่เหนี่ยวรั้งให้โปรดตอนอยู่ด้วยกันได้ในนิวเคลียสของอะตอม",
    [
      Answer("แรงไฟฟ้า", false),
      Answer("แรงแม่เหล็ก", false),
      Answer("แรงโน้มถ่วง ", false),
      Answer("แรงนิวเคลียร์แบบเข้ม (strong force)", true),
    ],
  ));
  list.add(sic6(
    " ค้างคาวต้องใช้ความถี่คลื่นเสียงประมาณกี่กิโลดเฮิรตซ์ จึงจะไม่บินชนลวดที่มีเส้นผ่านศูนย์กลาง 3 มิลลิเมตร",
    [
      Answer("40", false),
      Answer("50", false),
      Answer("100 ", false),
      Answer("120", true),
    ],
  ));
  list.add(sic6(
    "ในโรงงานที่มีระดับความเข้มเสียงรบกวน 90 dB ถ้าต้องการให้คนงานได้ยินเสียงรบกวนนี้ที่ระดับ 70 dB จะต้องใส่เครื่องอุดหูที่ลดความเข้มเสียงลงกี่เท่า",
    [
      Answer("20", false),
      Answer("70", false),
      Answer("80 ", false),
      Answer(" 100", true),
    ],
  ));
  list.add(sic6(
    "แท่งควบคุมจำนวนนิวตรอนในแกนของเครื่องปฏิกรณ์นิวเคลียร์ทำจากโลหะใด",
    [
      Answer("ตะกั่ว", false),
      Answer("ทองแดง", false),
      Answer("ยูเรเนียม ", false),
      Answer("แคดเมียม", true),
    ],
  ));
  list.add(sic6(
    " สนามแม่เหล็กสามารถเบนรังสีใด",
    [
      Answer("แอลฟา", false),
      Answer("บีตา", true),
      Answer("แกมมา ", false),
      Answer("แอลฟา กับ บีตา", false),
    ],
  ));
  list.add(sic6(
    " การสังเกตของนักวิทยาศาสตร์ทำให้เกิดสิ่งใดเป็นอันดับแรก",
    [
      Answer("การทดลอง.", false),
      Answer("ถูกทุกข้อ", false),
      Answer("สมมติฐาน ", false),
      Answer("ปัญหา", true),
    ],
  ));
  list.add(sic6(
    " สมมติฐานทางวิทยาศาสตร์จะเปลี่ยนเป็นทฤษฎีได้เมื่อใด ",
    [
      Answer(" มีเครื่องมือพิสูจน์", false),
      Answer("เป็นที่ยอมรับโดยทั่วไป", false),
      Answer("อธิบายได้กว้างขวาง ", false),
      Answer("ทดสอบแล้วเป็นจริงทุกครั้ง", true),
    ],
  ));
  list.add(sic6(
    " ข้อใดเรียงลำดับขั้นตอนของวิธีการทางวิทยาศาสตร์ได้ถูกต้อง ",
    [
      Answer(
          "การสังเกตและปัญหา การทดลองและตั้งสมมติฐาน การตรวจสอบสมมติฐาน และสรุปผล",
          false),
      Answer(
          "การตั้งสมมติฐาน การสังเกตและปัญหา การตรวจสอบสมมติฐานและการทดลอง และสรุปผล",
          false),
      Answer("การตั้งสมมติฐาน การรวบรวมข้อมูล การทดลอง และสรุปผล ", false),
      Answer(
          " การสังเกตและปัญหา การตั้งสมมติฐาน การตรวจสอบสมมติฐานและการทดลอง และสรุปผล",
          true),
    ],
  ));
  list.add(sic6(
    " ในการตั้งสมมติฐานของการศึกษาค้นคว้ามีประโยชน์อย่างไร",
    [
      Answer("เพื่อเป็นแนวทางในการดำเนินโครงงาน", false),
      Answer("เพื่อเป็นการพิสูจน์ผลของปัญหาที่ตั้งไว้", false),
      Answer("เพื่อเป็นการบอกผลสรุปจากการทำโครงงานล่วงหน้า ", false),
      Answer(" เพื่อเป็นการคาดคะเนคำตอบชั่วคราวของปัญหาที่ตั้งไว้", true),
    ],
  ));
  list.add(sic6(
    "โครงงานประเภทใดที่เกี่ยงข้องกับการประดิษฐ์เครื่องมือ เครื่องใช้และอุปกรณ์ต่าง ๆ ที่เกี่ยวกับ การใช้สอย",
    [
      Answer("การทดลอง", false),
      Answer("ทฤษฎี", false),
      Answer("สำรวจรวบรวมข้อมูล ", false),
      Answer("สิ่งประดิษฐ์", true),
    ],
  ));
  list.add(sic6(
    "หลักฐานในข้อใดที่แสดงว่าภูเขานั้นๆเคยเป็นทะเลมาก่อน",
    [
      Answer("มีเปลือกหอยบนภูเขา", false),
      Answer("มีหินชั้น", false),
      Answer("มีซากดึกดำบรรพ์ ", false),
      Answer(" ทั้งข้อ ก ข และ ค", true),
    ],
  ));
  list.add(sic6(
    "300 - 200 ล้านปีที่แล้ว ทวีปต่างๆอยู่รวมกันเป็น",
    [
      Answer("พันเจีย", true),
      Answer("ลอราเซีย", false),
      Answer("กอนด์วานาแลน ", false),
      Answer(" ทีทีส", false),
    ],
  ));
  list.add(sic6(
    " หินหนืดที่พ่นออกจากภูเขาไฟ เป็นสารที่มาจากชั้นใดของโลก?",
    [
      Answer("ชั้นเปลือกโลก", false),
      Answer("ชั้นแมนเทิล", false),
      Answer("ชั้นแก่นโลก ", false),
      Answer(" ทุกชั้นรวมกัน", true),
    ],
  ));
  list.add(sic6(
    " ____________four chairs in the room.",
    [
      Answer("Are there", false),
      Answer("Is there", false),
      Answer("There are ", true),
      Answer(" There is", false),
    ],
  ));
  list.add(sic6(
    " ชั้นใดของโลกที่มีความหนามากที่สุด?",
    [
      Answer("ผิวโลก", false),
      Answer("เปลือกโลก", false),
      Answer("แมนเทิล ", false),
      Answer(" แก่นโลก", true)
    ],
  ));
  list.add(sic6(
    " _________________five pens in the box.",
    [
      Answer("Is there", false),
      Answer("Are there", false),
      Answer("There is ", false),
      Answer("There are", true),
    ],
  ));
  list.add(sic6(
    " ข้อใดไม่ใช่สาเหตุของการเกิดแผ่นดินไหว?",
    [
      Answer("การเคลื่อนที่ชนกันของแผ่นเปลือกโลก", false),
      Answer("การเกิดภูเขาไฟระเบิดอย่างรุนแรง", false),
      Answer("แผ่นเปลือกโลกทรุดตัวหรือยุบตัว ", false),
      Answer(" แผ่นดินเปลือกโลกขยายตัวและหดตัวเท่ากัน", true),
    ],
  ));
  list.add(sic6(
    " จุดกำเนิดการไหวสะเทือนของแผ่นดินไหว เรียกว่าอะไร?",
    [
      Answer("ศูนย์เกิดแผ่นดินไหว", false),
      Answer("จุดศูนย์กลางแผ่นดินไหว", true),
      Answer("จุดกำเนิดของแผ่นดินไหว ", false),
      Answer(" จุดศูนย์กลางการสั่นสะเทือนของแผ่นดิน", false),
    ],
  ));
  list.add(sic6(
    " ชั้นเนื้อโลกส่วนบนกับชั้นเปลือกโลกรวมกันเรียกว่าอะไร?",
    [
      Answer("แมนเทิล", false),
      Answer("ธรณีภาค", true),
      Answer("ธรณีภาคพื้นทวีป ", false),
      Answer("ธรณีภาคพื้นเปลือกโลก", false),
    ],
  ));
  list.add(sic6(
    " เปลือกโลกแบ่งออกเป็น 2 บริเวณคือ?",
    [
      Answer("เปลือกโลกภาคพื้นทวีปและเปลือกโลกภาคพื้นน้ำ", false),
      Answer("เปลือกโลกภาคพื้นทวีปและเปลือกโลกใต้มหาสมุทร", true),
      Answer("เปลือกโลกภาคพื้นดินและเปลือกโลกภาคพื้นน้ำ", false),
      Answer(" เปลือกโลกชั้นนอกและเปลือกโลกชั้นใน", true),
    ],
  ));
  list.add(sic6(
    " เปลือกโลกภาคพื้นทวีป ประกอบไปด้วยอะไรบ้าง? ",
    [
      Answer(" ซิลิคอนและซิลิกา", false),
      Answer("ซิลิคอนและแมกนีเซียม", false),
      Answer("เหล็กและทองแดง ", false),
      Answer("ซิลิคอนและอะลูมินา", true),
    ],
  ));
  list.add(sic6(
    " โครงสร้างโลกแบ่งตามลักษณะมวลสารได้ชั้นใหญ่ๆสามชั้นอะไรบ้าง?",
    [
      Answer(" ชั้นเปลือกโลก ใต้เปลือกโลก แก่นโลก", false),
      Answer("ชั้นเปลือกโลก เนื้อโลก ธรณีภาค", false),
      Answer("ชั้นเปลือกโลก เนื้อโลก หินหนืด ", false),
      Answer("  ชั้นเปลือกโลก เนื้อโลก แก่นโลก", true),
    ],
  ));

  return list;
}
///แหล่งที่มาข้อสอบ https://quizizz.com/admin/quiz/603f84614bd71d001bbf2e07/