class thai6 {
  late final String questionText;
  late final List<Answer> answersList;

  thai6(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<thai6> getQuestions() {
  List<thai6> list = [];
  //ADD questions and answer here
  list.add(thai6(
    " ข้อใดไม่เข้าพวก ",
    [
      Answer(" นนทก", false),
      Answer(" พระราม", false),
      Answer(" พระมหาชนก ", true),
      Answer("พระลักษณ์", false),
    ],
  ));
  list.add(thai6(
    " ข้อใดมีลักษณะเชิญชวน ",
    [
      Answer("ขึ้นลงทุกครั้งโปรดชิดซ้าย", false),
      Answer("เข้าออกปิดไฟ ปิดพัดลมทุกครั้ง", false),
      Answer("อาหารดีมีคุณภาพ ราคาเป็นกันเอง ", false),
      Answer(" บริจาคคนละบาท ช่วยเจ้าอาวาสสร้างโบสถ์กัน", true),
    ],
  ));
  list.add(thai6(
    " ข้อใดกล่าวปฏิเสธได้อย่าง “บัวไม่ให้ช้ำ น้ำไม่ให้ขุ่น” ",
    [
      Answer("ติดธุระมาไม่ได้ ไม่ต้องคอย", false),
      Answer("มาไม่ได้ติดธุระ เสียใจด้วย", false),
      Answer("ติดธุระด่วนมาไม่ได้ ต้องขอโทษด้วย ", true),
      Answer("จนใจติดธุระมาไม่ได้จริงๆ", false),
    ],
  ));
  list.add(thai6(
    " ข้อใดเป็นข้อปฏิบัติที่ดีในการเขียนเรียงความ ",
    [
      Answer("เขียนสวยงาม", false),
      Answer("เขียนให้ได้ปริมาณ", false),
      Answer("วางโครงเรื่อง ", true),
      Answer("ตั้งชื่อเรื่อง", false),
    ],
  ));
  list.add(thai6(
    " “ปัจจุบันนี้คนหันมานิยมซื้อบ้านในหมู่บ้าน กันทั้งนั้น” ควรเติมคำในข้อใด",
    [
      Answer("จัดสรรค์", false),
      Answer("สร้างสรร", false),
      Answer("จัดสรร ", true),
      Answer("สร้างสรรค์", false),
    ],
  ));
  list.add(thai6(
    " ข้อใด ไม่ใช่ คำขึ้นต้นในการเขียนจดหมาย",
    [
      Answer("กราบ", false),
      Answer("กราบเรียน", false),
      Answer("กราบไหว้ ", true),
      Answer("เรียน", false),
    ],
  ));
  list.add(thai6(
    " “ฉันมาเรียนที่กรุงเทพฯ ก็ต้องปรับตัวมากยังไม่คุ้นกับถนนหนทางเลย คิดถึงแต่บ้านเรามากกว่า ปิดเทอมเราคงได้พบกัน”ใจความนี้เป็นเนื้อความจดหมายประเภทใด",
    [
      Answer("จดหมายกิจธุระ", false),
      Answer("จดหมายถึงญาติ", false),
      Answer("จดหมายถึงเพื่อน", true),
      Answer("จดหมายถึงคนรู้จัก", false),
    ],
  ));
  list.add(thai6(
    " นิทานเรื่อง ซินเดอเรลลา มีแนวคิดเหมือนกับนิทานไทยเรื่องใด",
    [
      Answer("เกราะกายสิทธิ์", false),
      Answer("กระต่ายกับเต่า", false),
      Answer("ปลาบู่ทอง ", true),
      Answer("นางสิบสอง", false),
    ],
  ));
  list.add(thai6(
    "คำว่า “สวาปาม” เป็นภาษาระดับใด",
    [
      Answer("ภาษาราชการ", false),
      Answer("ภาษากึ่งราชการ", false),
      Answer("ภาษาพูด ", true),
      Answer("ภาษาถิ่น", false),
    ],
  ));
  list.add(thai6(
    " คำว่า “สวาปาม” มีความหมายตามภาษาเขียนในข้อใด",
    [
      Answer("หม่ำ", false),
      Answer("กิน", false),
      Answer("ทาน ", false),
      Answer("รับประทาน", true),
    ],
  ));
  list.add(thai6(
    " ข้อปฏิบัติในการทักทายที่ดีคือข้อใด",
    [
      Answer("ถามเรื่องส่วนตัวเพื่อแสดงความสนใจ", false),
      Answer("เข้าโอบกอดเพื่อแสดงความจริงใจ", false),
      Answer("ยิ้มแย้มแจ่มใสแสดงความยินดีอย่างจริงใจ ", true),
      Answer("กล่าวทักทายพร้อมสอมกอด", false),
    ],
  ));
  list.add(thai6(
    " สำนวนภาษาที่แสดงความเป็นปัจเจกบุคคลคือข้อใด",
    [
      Answer("น้ำกลิ้งบนใบบัว", false),
      Answer("ปลาหมอตายเพราะปาก", false),
      Answer("สำเนียงส่อภาษา กิริยาส่อสกุล ", true),
      Answer("น้ำนิ่งไหลลึก", false),
    ],
  ));
  list.add(thai6(
    " ข้อใดมีลักษณะเชิญชวน ",
    [
      Answer("ขึ้นลงทุกครั้งโปรดชิดซ้าย", false),
      Answer("เข้าออกปิดไฟ ปิดพัดลมทุกครั้ง", false),
      Answer("อาหารดีมีคุณภาพ ราคาเป็นกันเอง ", false),
      Answer(" บริจาคคนละบาท ช่วยเจ้าอาวาสสร้างโบสถ์กัน", true),
    ],
  ));
  ;
  list.add(thai6(
    " การกล่าวถึงความงามตามธรรมชาติ ผู้เขียนควรใช้โวหารการเขียนในข้อใด",
    [
      Answer("บรรยายโวหาร", false),
      Answer("เทศนาโวหาร", false),
      Answer("พรรณนาโวหาร ", true),
      Answer("อุปมาโวหาร", false),
    ],
  ));
  list.add(thai6(
    " ผู้เข้าประชุมไม่ควรปฏิบัติในข้อใด",
    [
      Answer("หาความรู้เกี่ยวกับเรื่องที่จะประชุม", false),
      Answer("เป็นนักฟังที่ดี", false),
      Answer("พูดตรงประเด็นอย่างรวบรัดตัดความ ", true),
      Answer("แต่งกายสุภาพเรียบร้อย", false),
    ],
  ));
  list.add(thai6(
    "ข้อใด ไม่ใช่ หน้าที่พิธีกรในการบรรยายต่อหน้าที่ประชุม ",
    [
      Answer("แนะนำวิทยากรผู้บรรยายและเชิญให้บรรยาย", false),
      Answer("กระตุ้นให้ผู้เข้าประชุมสนใจการบรรยาย", false),
      Answer("ดูแลการบรรยายให้ดำเนินไปอย่างเรียบร้อย ", false),
      Answer(" บรรยายรายละเอียดเกี่ยวกับเรื่องที่บรรยาย", true),
    ],
  ));
  list.add(thai6(
    " “ผ้าเช็ดหน้า” ตรงกับคำราชาศัพท์ในข้อใด",
    [
      Answer("พระภูษา", false),
      Answer("ทรงซับพระพักตร์", false),
      Answer("ซับพระพักตร์ ", true),
      Answer("พระผ้าเช็ดหน้า", false),
    ],
  ));
  list.add(thai6(
    " สำนวนที่ว่า “กันไว้ดีกว่าแก้” หมายความว่าอย่างไร ",
    [
      Answer("ขัดขวางผู้อื่น", false),
      Answer("ป้องกันไม่ให้เกิดอุบัติเหตุ", false),
      Answer("ดูแลตัวเองเพื่อให้เกิดความปลอดภัย ", false),
      Answer(" ป้องกันไว้ก่อนเกิดเหตุ", true),
    ],
  ));
  list.add(thai6(
    " บ้านใกล้________ ควรเติมข้อความใดลงไปในช่องว่าง",
    [
      Answer("ไกลบ้าน", false),
      Answer("ข้างกัน", false),
      Answer("เรือนเคียง", true),
      Answer("ไม่ไกล", false),
    ],
  ));
  list.add(thai6(
    " อดอยาก________ ควรเติมข้อความใดในช่องว่าง ",
    [
      Answer("หิวโหย", false),
      Answer("อยากกิน", false),
      Answer("ปากแห้ง ", false),
      Answer(" ยากจน", true),
    ],
  ));
  list.add(thai6(
    " คำในข้อใดที่มีเสียงสระเดี่ยว เสียงสั้น",
    [
      Answer("จอ", false),
      Answer("หนู", false),
      Answer("เตะ ", true),
      Answer("เธอ", false),
    ],
  ));
  list.add(thai6(
    " ข้อใดเป็นคำไทยแท้ทั้งหมด",
    [
      Answer("ฟรี โค้ก", false),
      Answer("ชบา แข", false),
      Answer("เจ๊ เชิ้ต ", false),
      Answer(" เที่ยว เล่น", true),
    ],
  ));
  list.add(thai6(
    "ข้อใดเป็นคำมูลทุกคำ",
    [
      Answer("น้ำตก น้ำใจ", false),
      Answer("ไม้เรียว มะระ", false),
      Answer("กระถาง มะละกอ ", true),
      Answer("นักเรียน จุดยืน", false),
    ],
  ));
  list.add(thai6(
    " ข้อใดเป็นคำซ้อนเพื่อเสียง",
    [
      Answer("เดือดร้อน", false),
      Answer("คัดเลือก", false),
      Answer("สุ้มเสียง ", true),
      Answer("สดใส", false),
    ],
  ));
  list.add(thai6(
    " ข้อใดมีคำสมาสอยู่ในข้อความ ",
    [
      Answer("นักเรียนไปเที่ยวชมอนุสาวรีย์ประชาธิปไตย", false),
      Answer("ศูนย์ศิลปาชีพน้ำท่วม", false),
      Answer("เขาเป็นคนรักความสันโดษ ", false),
      Answer(" ลูกชายฉันเรียนอยู่ที่เกษตรศาสตร์", true),
    ],
  ));
  list.add(thai6(
    " ข้อใด ไม่ใช่ ประโยคถามให้ตอบ",
    [
      Answer("บ้านของเธออยู่ที่ไหน", false),
      Answer("ห้องเช่าราคาเท่าไหร่", false),
      Answer("ใครๆ อยากไปเที่ยว ", true),
      Answer("น้องจะกินข้าวหรือก๋วยเตี๋ยวจ๊ะ", false),
    ],
  ));
  list.add(thai6(
    " คำซ้ำในข้อใดต้องใช้เป็นคำซ้ำเสมอ ",
    [
      Answer(
          "ถ้านักเรียนวางแผนการลงทะเบียนให้ดีๆ การเรียนก็จะไม่หนักมาก", false),
      Answer("แม่บอกให้รีบๆ ทำงาน วันเสาร์อาทิตย์จะได้ไปต่างจังหวัด", false),
      Answer("พอฝนตก น้ำท่วม รถก็จะติดมากๆ จนน่าเบื่อ ", false),
      Answer(" ฉันซ่อมบ้านคราวนี้คิดคร่าวๆ แล้วก็เป็นเงินหลักแสน", true),
    ],
  ));
  list.add(thai6(
    "คำซ้ำในข้อใดต้องใช้เป็นคำซ้ำเสมอ",
    [
      Answer("ถ้าเราวางแผนให้ดีตั้งแต่แรกๆ โครงการนี้ก็คงสำเร็จไปแล้ว", false),
      Answer("งานนี้ถึงจะได้เงินเดือนน้อย ก็ทำไปๆ ก่อนแล้วกัน", false),
      Answer("คนงานใหม่ขยันเป็นพักๆ เอาแน่ไม่ได้ ", true),
      Answer("นักเรียนอนุบาลหกล้มหัวเข่าแตก เลือดไหลซิบๆ", false),
    ],
  ));
  list.add(thai6(
    " ข้อใดเป็นประโยครวม ",
    [
      Answer("โรงเรียนจัดกิจกรรมลูกเสือในวันนี้", false),
      Answer("โรงเรียนจัดกิจกรรมเพื่อให้นักเรียนเกิดทักษะชีวิต", false),
      Answer("โรงเรียนแจ้งว่าให้นักเรียนนำอุปกรณ์มาทำกับข้าว", false),
      Answer(" โรงเรียนให้นักเรียนเดินทางไกลและสวนสนาม", true),
    ],
  ));
  list.add(thai6(
    " เสียงสระในข้อใดนับว่ามีเสียงพยัญชนะท้ายพยางค์ด้วย",
    [
      Answer("อะ อา อิ อี", false),
      Answer("เอียะ เอีย เอีอะ เอือ อัวะ อัว", false),
      Answer("อำ ไอ ใอ เอา ", true),
      Answer("เอาะ ออ อัวะ อัว", false),
    ],
  ));
  list.add(thai6(
    " คำในข้อใดผันวรรณยุกต์ได้มากที่สุด ",
    [
      Answer("ขา", false),
      Answer("นา", false),
      Answer("คา ", false),
      Answer(" กา", true),
    ],
  ));
  return list;
}
//แหล่งที่มาข้อสอบ https://quizizz.com/admin/quiz/5d81c6a0f7cf59001a52c61b/