class math3 {
  late final String questionText;
  late final List<Answer> answersList;

  math3(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<math3> getQuestions() {
  List<math3> list = [];
  //ADD questions and answer here
  list.add(math3(
    " แสงตะวัน มีดินสอ น้อยกว่า แสงจันทร์ 7 แท่ง ถ้า แสงตะวัน มีดินสอ x แท่ง และ แสงจันทร์ มีดินสอ y แท่ง เขียนเป็นประโยคสัญลักษณ์ได้ในข้อใด",
    [
      Answer(" x – y = 7", false),
      Answer("x + 7 = y", false),
      Answer("x – 7 = y ", false),
      Answer("y – 7 = x", true),
    ],
  ));
  list.add(math3(
    " หนึ่ง สอง และ สาม อายุรวมกัน ได้ 58 ปี อายุพี่คนโตรวมกับคนกลาง 43 ปี คนกลางรวมกับคนสุดท้อง 34 ปี พี่คนโตมีอายุเท่าไร",
    [
      Answer("21 ปี", false),
      Answer(" 22 ปี", false),
      Answer("23 ปี ", false),
      Answer("24 ปี", true),
    ],
  ));
  list.add(math3(
    "คำตอบของระบบสมการ x + y = 9 และ x – y = 5 คือข้อใด",
    [
      Answer("(1,8)", false),
      Answer("6,3)", false),
      Answer("(7,2) ", true),
      Answer("(2,7)", false),
    ],
  ));
  list.add(math3(
    "ลำไย ออมเงิน เหรียญ ห้า และเหรียญ สิบ ได้จำนวน 40 เหรียญ รวมเป็นเงินทั้งสิ้น 300 บาท ลำไย มีเงินตามจำนวนเหรียญในข้อใด",
    [
      Answer("เหรียญ ห้า มากกว่า เหรียญ สิบ 6 เหรียญ", false),
      Answer(" เหรียญ ห้า มากกว่า เหรียญ สิบ 8 เหรียญ", false),
      Answer("หรียญ ห้า น้อยกว่า เหรียญ สิบ 6 เหรียญ ", true),
      Answer("เหรียญ ห้า น้อยกว่า เหรียญ สิบ 8 เหรียญ", false),
    ],
  ));
  list.add(math3(
    " ผ้าปูโต๊ะรูปสี่เหลี่ยมผืนผ้า มีด้านยาวยาวกว่าด้านกว้าง 7 นิ้ว ผ้าผืนนี้มีพื้นที่ 450 ตารางนิ้ว จงหาความกว้างของผ้าปูโต๊ะรูปสี่เหลี่ยมผืนผ้าผืนนี้",
    [
      Answer("15 นิ้ว", false),
      Answer(" 16 นิ้ว", false),
      Answer("17 นิ้ว ", false),
      Answer("18 นิ้ว", true),
    ],
  ));
  list.add(math3(
    " สนามตะกร้อรูปสี่เหลี่ยมผืนผ้า มีด้านยาว ยาวกว่าด้านกว้าง 4 เมตร และพื้นที่ของสนามเท่ากับ 96 ตารางเมตร สนามตะกร้อแห่งนี้ มีด้านกว้างและด้านยาวเท่าไหร่",
    [
      Answer("กว้าง 6 เมตร ยาว 10 เมตร", false),
      Answer(" กว้าง 8 เมตร ยาว 12 เมตร", true),
      Answer("กว้าง 10 เมตร ยาว 14 เมตร ", false),
      Answer("กว้าง 12 เมตร ยาว 16 เมตร", false),
    ],
  ));
  list.add(math3(
    " ปัจจุบันพ่อมีอายุมากกว่าแม่ 5 ปี อีก 10 ปีข้างหน้า กำลังสองของอายุของพ่อจะมากกว่า 60 เท่าของอายุของแม่อยู่ 25จงหาอายุปัจจุบันของพ่อและแม่ เท่ากับข้อใด",
    [
      Answer("พ่อมีอายุ 40 ปี และแม่มีอายุ 35 ปี", false),
      Answer("พ่อมีอายุ 43 ปี และแม่มีอายุ 38 ปี", false),
      Answer("พ่อมีอายุ 45 ปี และแม่มีอายุ 40 ปี", true),
      Answer("พ่อมีอายุ 50 ปี และแม่มีอายุ 45 ปี", false),
    ],
  ));
  list.add(math3(
    " ข้อใดถูกต้อง",
    [
      Answer("3 + 2 < 10", true),
      Answer(" -5 > -1", false),
      Answer("9 * 0 > 9 + 0 ", false),
      Answer("-3 + 5 < -5 + 3", false),
    ],
  ));
  list.add(math3(
    " กรวยอันหนึ่งมีปริมาตร 1,056 ลูกบาศก์เซนติเมตร และมีรัศมีที่ฐาน 12 เซนติเมตร กรวยนี้มีส่วนสูงเท่าไร",
    [
      Answer("6 เซนติเมตร", false),
      Answer(" 7 เซนติเมตร", true),
      Answer("8 เซนติเมตร ", false),
      Answer("14 เซนติเมตร", false),
    ],
  ));
  list.add(math3(
    " อ่างเก็บน้ำเป็นรูปสี่เหลี่ยมคางหมูมีพื้นที่ก้นอ่าง 96 ตารางเมตร บ่อลึก 2 เมตร ถ้าอ่างเก็บน้ำมีน้ำอยู่ 144 ลูกบาศก์เมตร แล้วระดับน้ำอยู่ต่ำกว่าขอบบนของอ่างเก็บน้ำกี่เซนติเมตร",
    [
      Answer("48 เซนติเมตร", false),
      Answer(" 50 เซนติเมตร", true),
      Answer("56 เซนติเมตร ", false),
      Answer("60 เซนติเมตร", false),
    ],
  ));
  list.add(math3(
    " ถ้านำลูกตะกั่วทรงกลมตันมีเส้นผ่านศูนย์กลาง 12 เซนติเมตร ไปหลอมเป็นทรงกระบอกที่มีเส้นผ่าศูนย์กลาง 8 เซนติเมตร จะได้ทรงกระบอกที่มีความสูงกี่เซนติเมตร",
    [
      Answer("9 เซนติเมตร", false),
      Answer(" 18 เซนติเมตร", true),
      Answer("20 เซนติเมตร ", false),
      Answer("24 เซนติเมตร", false),
    ],
  ));
  list.add(math3(
    " ถังน้ำทรงกระบอกใบหนึ่งมีรัศมี 4 เมตร สูง 7 เมตร ถ้าใส่น้ำลงไป 176 ลูกบาศก์เมตร ระดับน้ำสูงกี่เมตร",
    [
      Answer("3 เมตร", false),
      Answer(" 3.5 เมตร", true),
      Answer("4 เมตร ", false),
      Answer("4.5 เมตร", false),
    ],
  ));
  list.add(math3(
    "กรวยกลมที่มีปริมาตร 352 ลูกบาศก์เซนติเมตร และเส้นผ่านศูนย์กลาง 8 เซนติเมตร จะมีความสูงเท่าไร",
    [
      Answer("21 เซนติเมตร", true),
      Answer("22 เซนติเมตร", false),
      Answer("23 เซนติเมตร", false),
      Answer("24 เซนติเมตร", false),
    ],
  ));
  list.add(math3(
    " หลอมโลหะทรงกลมตันที่มีเส้นผ่านศูนย์กลาง 30 นิ้ว แล้วนำมาหลอมเป็นกรวยตันที่มีเส้นผ่านศูนย์กลาง 6 นิ้ว สูงเอียง 5 นิ้ว จะได้กรวยตันทั้งหมดกี่อัน",
    [
      Answer("75 อัน", false),
      Answer(" 300 อัน", false),
      Answer("375 อัน", true),
      Answer("750 อัน", false),
    ],
  ));
  list.add(math3(
    " เมื่อ 6 ปีที่แล้ว บิดามีอายุเป็น 3 เท่าของอายุบุตร ถ้าในอีก 8 ปีข้างหน้า บิดามีอายุเป็น 2 เท่าของอายุบุตร ปัจจุบันบิดามีอายุกี่ปี",
    [
      Answer("42 ปี", false),
      Answer(" 44 ปี", false),
      Answer("46 ปี ", false),
      Answer("48 ปี", true),
    ],
  ));
  list.add(math3(
    " ค่าเฉลี่ยของอายุของพนักงานบริษัทแห่งหนึ่งเป็น 42 ปี ถ้าอายุโดยเฉลี่ยของพนักงานหญิงเป็น 38 ปี และอายุโดยเฉลี่ยของพนักงานชายเป็น 48 ปี อัตราส่วนของจำนวนพนักงานหญิงต่อพนักงานชายเป็นเท่าไหร่",
    [
      Answer("2 : 3", false),
      Answer(" 3 : 2", true),
      Answer("3 : 1 ", false),
      Answer("2 : 1", false),
    ],
  ));
  list.add(math3(
    " แป้งชนิดที่หนึ่งราคากิโลกรัมละ 12 บาท แป้งชนิดที่สองราคากิโลกรัมละ 15 บาท ถ้าจะซื้อแป้งทั้งสองชนิดมาผสมกันแล้วขายในราคากิโลกรัมละ 14 บาท จะต้องผสมข้าวชนิดที่หนึ่งต่อชนิดที่สองในอัตราส่วนเท่าใด จึงจะขายได้เท่าทุนพอดี",
    [
      Answer("2 : 1", false),
      Answer(" 1 : 2", true),
      Answer("3 : 1 ", false),
      Answer("1 : 3", false),
    ],
  ));
  list.add(math3(
    "เงาของเสาไฟฟ้าต้นหนึ่งทอดยาว 4 เมตร ขณะที่เงาของตู้ไปรษณีย์ซึ่งสูง 1.4 เมตร ทอดยาว 0.7 เมตร เสาไฟฟ้าสูงกี่เมตร",
    [
      Answer("6 เมตร", false),
      Answer("7 เมตร", false),
      Answer("8 เมตร", true),
      Answer("9 เมตร", false),
    ],
  ));
  list.add(math3(
    "ต้นไม้เล็กต้นหนึ่งสูง 3.5 เมตร อยู่ห่างจากต้นไม้ใหญ่ต้นหนึ่ง 6 เมตร ชายคนหนึ่งสูง 1.5 เมตร ยืนอยู่ห่างจากต้นไม้เล็ก 3 เมตร ทำให้มองเห็นยอดต้นไม้เล็กและยอดต้นไม้ใหญ่อยู่ในแนวเดียวกัน ต้นไม้ใหญ่สูงกี่เมตร",
    [
      Answer("6 เมตร", false),
      Answer("7.5 เมตร", true),
      Answer("8 เมตร ", false),
      Answer("9.5 เมตร", false),
    ],
  ));
  list.add(math3(
    " There _ empty seats left in the hall.",
    [
      Answer("were no", true),
      Answer("  is no", false),
      Answer("were not ", false),
      Answer("are not", false),
    ],
  ));
  list.add(math3(
    " ข้อมูลชุดหนึ่งเรียงค่าจากมากไปน้อยดังนี้ 20, 20, x, 15, 15, 12, 10, 10, 10, 8, 8, 4 ถ้าค่าเฉลี่ยมากกว่ามัธยฐานอยู่ 1.5 แล้วค่า x ตรงกับข้อใด",
    [
      Answer("16", false),
      Answer(" 17", false),
      Answer("18 ", true),
      Answer("19", false),
    ],
  ));
  list.add(math3(
    " กลอยใจนับธนบัตรในกระเป๋าสตางค์ปรากฏว่ามีธนบัตรใบละยี่สิบบาทน้อยกว่าธนบัตรใบละห้าสิบบาทอยู่ 3 ใบ และจำนวนเงินในกระเป๋ามีไม่น้อยกว่า 360 บาท กลอยใจมีธนบัตรใบละห้าสิบบาทน้อยที่สุดกี่ใบ",
    [
      Answer("3 ใบ", false),
      Answer(" 4 ใบ", false),
      Answer("5 ใบ ", false),
      Answer("6 ใบ", true),
    ],
  ));
  list.add(math3(
    " ไอรินซื้อดอกกุหลาบสีแดงกับสีชมพูรวมกันมากกว่า 20 ดอก แต่ไม่ถึง 24 ดอก รวมเป็นเงิน 105 บาท ถ้าดอกกุหลาบสีแดง ราคาดอกละ 5 บาท และดอกกุหลาบชมพู ราคาดอกละ 4 บาท อยากทราบว่าไอรินจะซื้อดอกกุหลาบสีแดงได้มากที่สุดกี่ดอก",
    [
      Answer("23 ดอก", false),
      Answer("21 ดอก", true),
      Answer("17 ดอก ", false),
      Answer("13 ดอก", false),
    ],
  ));
  list.add(math3(
    " ข้อใดต่อไปนี้ไม่ใช่การทดลองสุ่ม ",
    [
      Answer("ครูเลือก ด.ช.บอยและด.ญ.ปลายฝนเป็นตัวแทนถือพานไหว้ครู", true),
      Answer("การจับสลากใบดำใบแดงในการเกณฑ์ทหาร", false),
      Answer("การโยนลูกบาสเกตบอลเข้าห่วง 1 ลูก หนึ่งครั้ง ", false),
      Answer("การส่งชิ้นส่วนของสินค้าที่ร่วมรายการไปชิงรางวัล", false),
    ],
  ));
  list.add(math3(
    " There _ empty seats left in the hall.",
    [
      Answer("were no", true),
      Answer("  is no", false),
      Answer("were not ", false),
      Answer("are not", false),
    ],
  ));
  list.add(math3(
    " ข้อใดต่อไปนี้กล่าวถูกต้อง ",
    [
      Answer(
          "ความน่าจะเป็นของเหตุการณ์  เกิดจากผลรวมของเหตุการณ์ที่เป็นไปได้ทั้งหมด",
          false),
      Answer(" ความน่าจะเป็นของเหตุการณ์มีค่ามากกว่าศูนย์เสมอ", false),
      Answer(
          "ในการทดลองสุ่มใดๆ เรียกผลที่เราสนใจจากการทดลองสุ่มว่า “เหตุการณ์” ",
          true),
      Answer("ความน่าจะเป็นของเหตุการณ์มีค่าเป็นจำนวนเต็มเสมอ", false),
    ],
  ));
  list.add(math3(
    " ถ้า m = 5 x 6 x 7 x 8 x 9 x 10 และ n = 103 แล้วจำนวนนับที่มากที่สุดที่หาร m และ n ลงตัว เท่ากับเท่าใด",
    [
      Answer("10", false),
      Answer("50", true),
      Answer("200 ", false),
      Answer("500", false),
    ],
  ));
  list.add(math3(
    " There _ empty seats left in the hall.",
    [
      Answer("were no", true),
      Answer("  is no", false),
      Answer("were not ", false),
      Answer("are not", false),
    ],
  ));
  list.add(math3(
    " อัตราส่วนของเงินเดือนของแจ๋ว ต่อ เงินเดือนของพิณ ต่อ เงินเดือนของโต้ง เป็น 4 : 2 : 7ถ้าพิณได้เงินเดือน 15,000 บาท แล้วโต้งได้เงินเดือนมากกว่าแจ๋วกี่บาท",
    [
      Answer("22,500 บาท", true),
      Answer("30,000 บาท", false),
      Answer("37,500 บาท ", false),
      Answer("45,000 บาท", false),
    ],
  ));
  list.add(math3(
    " เสื้อคอกลมราคาตัวละ 120 บาท และเสื้อคอปกราคาตัวละ 140 บาท ถ้าหน่อยซื้อเสื้อคอกลมและเสื้อคอปกรวมกัน 70 ตัว เป็นเงินทั้งหมด 9,000 บาท แล้วข้อใดถูกต้อง",
    [
      Answer("หน่อยซื้อเสื้อคอกลมมากกว่าเสื้อคอปกอยู่ 10 ตัว", true),
      Answer("หน่อยซื้อเสื้อคอกลมมากกว่าเสื้อคอปกอยู่ 20 ตัว", false),
      Answer("หน่อยซื้อเสื้อคอปกมากกว่าเสื้อคอกลมอยู่ 10 ตัว", false),
      Answer("หน่อยซื้อเสื้อคอปกมากกว่าเสื้อคอกลมอยู่ 20 ตัว", false),
    ],
  ));
  list.add(math3(
    " การหาปริมาตรของปริซึม หาได้ตามข้อใด",
    [
      Answer("พื้นที่ฐาน x สูง", true),
      Answer(" ความยาวฐาน x สูง", false),
      Answer("พื้นที่ผิว x สูง", false),
      Answer("ความยาวรอบฐาน x สูง", false),
    ],
  ));
  list.add(math3(
    "กรวยตรง สูง 3 เมตร เส้นผ่านศูนย์กลางฐาน 2.80 เมตร มีปริมาตรเท่าไร",
    [
      Answer("3.08 ลูกบาศก์เมตร", false),
      Answer("6.16 ลูกบาศก์เมตร", true),
      Answer("12.32 ลูกบาศก์เมตร ", false),
      Answer("24.64 ลูกบาศก์เมตร", false),
    ],
  ));
  list.add(math3(
    " . โลหะทรงกระบอกต้นไม้เส้นผ่านศูนย์กลาง 12 เซนติเมตร สูง 7 เซนติเมตร จะใช้กระดาษอย่างน้อยเท่าไรมาห่อทรงกระบอกจึงจะมิด",
    [
      Answer("264 ตารางเซนติเมตร", false),
      Answer("418 ตารางเซนติเมตร", true),
      Answer("491 ตารางเซนติเมตร ", false),
      Answer("682 ตารางเซนติเมตร", false),
    ],
  ));
  list.add(math3(
    " 	ข้อใดไม่ถูกต้อง ",
    [
      Answer(
          "รูปสามเหลี่ยมหน้าจั่ว 2 รูป มีมุมยอดเท่ากันจะเป็นสามเหลี่ยมด้านเท่า",
          false),
      Answer(" รูปสามเหลี่ยมด้านเท่าทุกรูปเป็นสามเหลี่ยมคล้ายกัน", false),
      Answer("รูปสามเหลี่ยมไม่เท่ากันทุกประการเป็นสามเหลี่ยมคล้ายกัน ", false),
      Answer("ปสามเหลี่ยมคล้ายกัน จะเป็นสามเหลี่ยมเท่ากันทุกประการ", true),
    ],
  ));
  list.add(math3(
    " ข้อใดเป็นความสัมพันธ์ของกราฟเส้นตรง",
    [
      Answer("(1, 0) , (-1, -2), (0, -1)", true),
      Answer("(2, -1) , (3, 0), (4, 1)", false),
      Answer("(-5, 3) , (-6, 4), (-7, 2)", false),
      Answer("(-2, 1) , (-1, 0), (0, -1)", false),
    ],
  ));
  list.add(math3(
    "(– 8, 6) อยู่บนเส้นตรงข้อใด",
    [
      Answer("	2x + y – 6 = 0", false),
      Answer("x+ y + 14 = 0", true),
      Answer("2x + y – 1 = 0", false),
      Answer("x – y –  6 = 0", false),
    ],
  ));

  return list;
}
//// แหล่งที่มาข้อสอบ https://www.trueplookpanya.com/examination2/examPreview?id=9956