class sic3 {
  late final String questionText;
  late final List<Answer> answersList;

  sic3(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<sic3> getQuestions() {
  List<sic3> list = [];
  //ADD questions and answer here
  list.add(sic3(
    " เซลล์สืบพันธุ์  (sex  cell)   มีหน้าที่อะไร",
    [
      Answer(" นำข้อมูลทางพันธุกรรมจากพ่อแม่ถ่ายทอดให้แก่ลูก ", true),
      Answer("ทำหน้าที่ผลิตเซลล์อสุจิ    ", false),
      Answer(" ทำหน้าที่ผลิตไข่ ", false),
      Answer(" ควบคุมการเคลื่อนไหวโดยรับคำสั่งจากสมองส่งผ่าน เซลล์", false),
    ],
  ));
  list.add(sic3(
    " ไวรัสที่มีขนาดเล็กที่สุดประมาณ เท่าไร",
    [
      Answer("10  มิลลิไมครอน", false),
      Answer(" 15   มิลลิไมครอน", true),
      Answer(" 13  มิลลิไมครอน ", false),
      Answer(" 20   มิลลิไมครอน", false),
    ],
  ));
  list.add(sic3(
    "คำกล่าวใดถูกต้องมากที่สุด",
    [
      Answer("มิวเทชันเกิดได้เฉพาะเซลล์สืบพันธุ์เท่านั้น", false),
      Answer(" สิ่งแวดล้อมทำให้เกิดการเปลี่ยนแปลงทางพันธุกรรมได้", false),
      Answer("บริเวณเซลล์ร่างกายทั่ว ๆ ไปไม่สามารถเกิดมิวเทชันได้ ", false),
      Answer(
          "  มิวเทชันที่เซลล์สืบพันธุ์จะถ่ายทอดลักษณะที่เปลี่ยนแปลงไปสู่ลูกหลานได้   ",
          true),
    ],
  ));
  list.add(sic3(
    " ข้อใดไม่ใช่การเคลื่อนที่ในหนึ่งมิติ",
    [
      Answer(" การเคลื่อนที่แนวเส้นตรง         ", false),
      Answer("การเคลื่อนที่แนวราบ", false),
      Answer(" การเคลื่อนที่เป็นเส้นโค้ง ", true),
      Answer("  การเคลื่อนที่แนวดิ่ง", false),
    ],
  ));
  list.add(sic3(
    " นำน้ำ 70 ลบ.ซม. ผสมกับแอลกอฮอล์ 30 ลบ.ซม. ข้อใดกล่าวถูกต้อง",
    [
      Answer("น้ำเป็นตัวทำละลายเพราะมีปริมาตรมาก", true),
      Answer(" น้ำเป็นตัวถูกละลายเพราะมีปริมาตรมาก", false),
      Answer(" แอลกอฮอล์เป็นตัวทำละลายเพราะมีสถานะเป็นของเหลว ", false),
      Answer(" แอลกอฮอล์เป็นตัวถูกทำละลายเพราะมีสถานะเป็นของเหลว", false),
    ],
  ));
  list.add(sic3(
    " ที่เรียกว่า 20 V 50 Hz นั้น เลข 50 คืออะไร",
    [
      Answer(" 50 V  ", false),
      Answer(" 50 A", false),
      Answer("50 W/Hz ", false),
      Answer("50 รอบ/วินาที", true),
    ],
  ));
  list.add(sic3(
    " มอเตอร์ไฟฟ้าตัวหนึ่ง มีค่าเพาเวอร์แฟคเตอร์ 0.6  ใช้กับไฟฟ้ากระแสสลับ 220 V กระแสไฟฟ้าผ่าน   2A  จะใช้พลังงานไฟฟ้าเท่าใด ",
    [
      Answer("150   W        ", false),
      Answer("250 W", false),
      Answer(" 260 W ", false),
      Answer(" 264 W", true),
    ],
  ));
  list.add(sic3(
    " .อัตราส่วนระหว่างความต่างศักย์ไฟฟ้าและกระแสไฟฟ้าที่ไหลผ่านลวดตัวนำไฟฟ้าใด ๆ  คือข้อใด",
    [
      Answer(" ปริมาณประจุไฟฟ้า   ", false),
      Answer(" ความต้านทานไฟฟ้า", true),
      Answer(" แรงเคลื่อนไฟฟ้า     ", false),
      Answer("ความต่างศักย์ไฟฟ้า", false),
    ],
  ));
  list.add(sic3(
    " พลังงานเริ่มแรกของมนุษย์มาจากสิ่งใด",
    [
      Answer("พืช ", true),
      Answer(" สัตว์", false),
      Answer("ดวงอาทิตย์ ", false),
      Answer(" บรรยากาศ", false),
    ],
  ));
  list.add(sic3(
    " พลังงานเริ่มแรกของมนุษย์มาจากสิ่งใด",
    [
      Answer("take", false),
      Answer("took", false),
      Answer("taking ", false),
      Answer(" taken", true),
    ],
  ));
  list.add(sic3(
    " .เตาไมโครเวฟเป็นเครื่องใช้ไฟฟ้าที่เปลี่ยนพลังงานไฟฟ้าเป็นพลังงานรูปใด",
    [
      Answer("พลังงานความร้อน", false),
      Answer("พลังงานกล", false),
      Answer("พลังงานแสงสว่าง ", false),
      Answer("พลังงานคลื่นแม่เหล็กไฟฟ้า", true),
    ],
  ));
  list.add(sic3(
    " สารชนิดใดที่มีการเปลี่ยนสถานะจากของแข็งกลายเป็นก๊าซโดยไม่ผ่านการเป็นของเหลวเรียกกระบวนการนี้ว่าอะไร",
    [
      Answer("การระเหิด", true),
      Answer("การระเหย", false),
      Answer("การเดือด", false),
      Answer(" การเปลี่ยนสถานะโดยเฉียบพลัน", false),
    ],
  ));
  list.add(sic3(
    " .ข้อใดเป็นปฏิกิริยาดูดความร้อน",
    [
      Answer("ไอน้ำกลายเป็นน้ำ", false),
      Answer("เกลือละลายในน้ำ", false),
      Answer("โซเดียมคาร์บอเนตรวมตัวกับแคลเซียมคลอไรด์ ", true),
      Answer("แคลเซียมคาร์ไบด์รวมตัวกับน้ำ", false),
    ],
  ));
  list.add(sic3(
    " ค่าความร้อนแฝงของการกลายเป็นไอของน้ำเดือดมีค่าเท่าใด",
    [
      Answer("80 cal/kg", false),
      Answer("80 cal/g", false),
      Answer("540 cal/kg ", false),
      Answer(" 540 cal/g", true),
    ],
  ));
  list.add(sic3(
    " โลกได้รับพลังงานความร้อนจากดวงอาทิตย์ด้วยวิธีใด",
    [
      Answer("การนำความร้อนและการพาความร้อน", false),
      Answer("การพาความร้อนและการแผ่รังสีความร้อน", false),
      Answer("การนำความร้อนและการแผ่รังสีความร้อน ", false),
      Answer(" การแผ่รังสีความร้อนเท่านั้น", true),
    ],
  ));
  list.add(sic3(
    " ผลกระทบที่เกิดจากการนำพลังงานนิวเคลียร์มาใช้คืออะไร",
    [
      Answer("ต้นทุนค่าเชื้อเพลิง", false),
      Answer("ผลิตกระแสไฟฟ้าได้น้อย", false),
      Answer("กากรังสีเป็นอันตรายต่อมนุษย์ ", true),
      Answer(" ขาดวิศวกรที่มีความชำนาญ", false),
    ],
  ));
  list.add(sic3(
    " ข้อใดให้หลักการไม่เหมือนกับข้ออื่น",
    [
      Answer("การเล่นบั้งไฟ", false),
      Answer("การเคลื่อนที่ของจรวด", false),
      Answer("การลอยของบอลลูน ", true),
      Answer(" การปล่อยลมออกจากลูกโปร่ง", false),
    ],
  ));
  list.add(sic3(
    " พลังงานที่มีอยู่ในวัตถุที่กำลังเคลื่อนที่คืออะไร",
    [
      Answer("พลังงานจลน์", true),
      Answer("พลังงานศักย์", false),
      Answer("พลังงานกล ", false),
      Answer("พลังงานไฟฟ้า", false),
    ],
  ));
  list.add(sic3(
    " เด็กชายแดงยกเก้าอี้จากชั้นล่างขึ้นไปชั้นบนจะมีการเปลี่ยนรูปพลังงานอย่างไร",
    [
      Answer("พลังงานกลเป็นพลังงานเคมี", true),
      Answer("พลังงานเคมีเป็นพลังงานความร้อน", false),
      Answer("พลังงานความร้อนเป็นพลังงานกล", false),
      Answer("พลังงานเคมีเป็นพลังงานกล", false),
    ],
  ));
  list.add(sic3(
    " ข้อใดเป็นการเปลี่ยนพลังงานไฟฟ้าเป็นพลังงานกลทั้งหมด",
    [
      Answer("ตู้เย็น พัดลม เครื่องปิ้งขนมปัง", false),
      Answer("เครื่องสูบน้ำเตารีด โทรทัศน์", false),
      Answer("ตู้เย็น วิทยุหลอดไฟ ", false),
      Answer("สว่านไฟฟ้า พัดลม เครื่องซักผ้า", true),
    ],
  ));
  list.add(sic3(
    " ข้อใดเป็นการเปลี่ยนแปลงทางเคมี",
    [
      Answer("ผ่านกระแสไฟฟ้าเข้าไปในขดลวด", false),
      Answer("กระดาษไหม้ไฟ", true),
      Answer("น้ำแข็งละลาย ", false),
      Answer(" เกลือละลายน้ำ", false),
    ],
  ));
  list.add(sic3(
    " เมื่อแคลเซียมคาร์ไบด์ทำปฏิกิริยากับน้ำจะเกิดสิ่งใดบ้าง",
    [
      Answer("ก๊าซออกซิเจนกับพลังงานความร้อน", false),
      Answer("ก๊าซออกซิเจนกับพลังงานกล", false),
      Answer("ก๊าซอะเซทิลีนกับพลังงานความร้อน ", true),
      Answer(" ก๊าซอะเซทิลีนกับพลังงานกล", false),
    ],
  ));
  list.add(sic3(
    " การทดลองที่เกิดปฏิกิริยาดูดความร้อนสังเกตได้อย่างไร",
    [
      Answer("มีเปลวไฟเกิดขึ้น", false),
      Answer("เมื่อจับภาชนะจะรู้สึกเย็น", true),
      Answer("เกิดสิ่งใหม่ต่างไปจากเดิม ", false),
      Answer(" มีการขยายตัวของภาชนะที่รองรับ", false),
    ],
  ));
  list.add(sic3(
    " ข้อใดอธิบายการถ่ายเทความร้อนโดยการพาได้ดีที่สุด",
    [
      Answer("เอามืออังพวยกาขณะที่น้ำกำลังเดือดแล้วรู้สึกร้อน", true),
      Answer("ขณะรีดผ้า เอามือไปโดนเตารีดจะรู้สึกร้อน", false),
      Answer("ยืนกลางแดดแล้วรู้สึกร้อน ", false),
      Answer(" ใช้ช้อนโลหะจุ่มลงในน้ำแกงแล้วรู้สึกร้อน", false),
    ],
  ));
  list.add(sic3(
    " เซลล์สุริยะมีการเปลี่ยนแปลงรูปพลังงานอย่างไร",
    [
      Answer("พลังงานความร้อนเป็นพลังงานไฟฟ้า", false),
      Answer("พลังงานแสงเป็นพลังงานไฟฟ้า", true),
      Answer("พลังงานเคมีเป็นพลังงานไฟฟ้า ", false),
      Answer(" พลังงานกลเป็นพลังงานไฟฟ้า", false),
    ],
  ));
  list.add(sic3(
    " ข้อใดเกิดจากสิ่งเหลือใช้จากการเกษตรแล้วนำกลับมาใช้ใหม่",
    [
      Answer("ถ่านหิน", false),
      Answer("น้ำมัน", false),
      Answer("ก๊าซธรรมชาติ ", false),
      Answer("ก๊าซชีวภาพ", true),
    ],
  ));
  list.add(sic3(
    " If he had __ his doctor’s advice, he might still be alive.",
    [
      Answer("take", false),
      Answer("took", false),
      Answer("taking ", false),
      Answer(" taken", true),
    ],
  ));
  list.add(sic3(
    " ข้อใดแสดงถึงแรงผลัก",
    [
      Answer("ดันกำแพง", true),
      Answer("เปิดประตู", false),
      Answer("ปิดหน้าต่าง ", false),
      Answer(" ปิดประตูรถ", false),
    ],
  ));
  list.add(sic3(
    " ข้อใดเป็นการเคลื่อนที่แนวโค้ง",
    [
      Answer("การยิงธนู", false),
      Answer("การเล่นเปตอง", false),
      Answer("การยิงกระสุนปืนใหญ่ ", true),
      Answer(" การวิ่งผลัด", false),
    ],
  ));
  list.add(sic3(
    " ปริมาณสเกลาร์มีลักษณะอย่างไร",
    [
      Answer("ไม่มีขนาดและทิศทาง", false),
      Answer("มีทั้งขนาดและทิศทาง", false),
      Answer("มีเฉพาะทิศทาง ", false),
      Answer("มีเฉพาะขนาด", true),
    ],
  ));
  list.add(sic3(
    " ข้อใดเป็นปริมาณเวกเตอร์.",
    [
      Answer("พื้นที่", false),
      Answer("เวลา", false),
      Answer("อุณหภูมิ", false),
      Answer(" แรง", true),
    ],
  ));
  list.add(sic3(
    "ข้อใดไม่ใช่แรงพื้นฐานตามธรรมชาติ",
    [
      Answer("แรงแม่เหล็ก", false),
      Answer("แรงจากปฏิกิริยาเคมี", false),
      Answer("แรงดึงดูดระหว่างมวล ", false),
      Answer(" แรงไฟฟ้า", true),
    ],
  ));

  return list;
}
///แหล่งที่มาข้อสอบ http://science-knowledgearound.blogspot.com/2013/07/100.html