class soci3 {
  late final String questionText;
  late final List<Answer> answersList;

  soci3(this.questionText, this.answersList);
}

class Answer {
  final String answerText;
  final bool isCorrect;

  Answer(this.answerText, this.isCorrect);
}

List<soci3> getQuestions() {
  List<soci3> list = [];
  //ADD questions and answer here
  list.add(soci3(
    " พฤติกรรมใดต่อไปนี้ ถือว่าเป็นผู้ที่ ไม่ ประพฤติตนเคารพกฎกติกาของสังคม",
    [
      Answer(" ขี่รถจักรยานยนต์แข่งกันบนทางด่วน", true),
      Answer(" ข้ามถนนบนทางม้าลาย", false),
      Answer("เข้าร่วมชุมนุมทางการเมืองอย่างสงบ ", false),
      Answer("หยุดรถในขณะที่เห็นสัญญาณไฟเหลือง", false),
    ],
  ));
  list.add(soci3(
    " ข้อใดต่อไปนี้แสดงถึงลักษณะของสังคมไทยที่ควรจะเป็น",
    [
      Answer("คนในชุมชนเน้นการสร้างรายได้เป็นหลัก", false),
      Answer("สมาชิกในครอบครัวยึดถือเอาความคิดตนเองเป็นใหญ่", false),
      Answer("สมาชิกในหมู่บ้านร่วมหารือกันเพื่อพัฒนาชุมชน ", true),
      Answer("เด็กรุ่นใหม่ให้ความสนใจเทคโนโลยีมากกว่าจริยธรรม", true),
    ],
  ));
  list.add(soci3(
    " ข้อใดถือเป็นสิทธิเสรีภาพตามบทบัญญัติในรัฐธรรมนูญแห่งราชอาณาจักรไทย",
    [
      Answer("ลงโทษลูกจ้างของตนโดยการทุบตีจนบาดเจ็บ", false),
      Answer("ต่อว่าผู้ที่นับถือศาสนาต่างจากตนอย่างรุนแรง", false),
      Answer("ลงโทษลูกจ้างของตนโดยการทุบตีจนบาดเจ็บ", false),
      Answer("ห้ามไม่ให้คนแปลกหน้าเข้ามายังที่พักอาศัย", true),
    ],
  ));
  list.add(soci3(
    "เป้าหมายหลักของการถ่วงดุลอำนาจของทั้ง 3 ฝ่ายคืออะไร",
    [
      Answer("สอดคล้องกับการปกครองระบอบประชาธิปไตยตามแบบอย่างสากลนิยม", false),
      Answer("อำนาจหน้าที่ในการบริหารประเทศของแต่ละฝ่ายมีความชัดเจนมากขึ้น",
          false),
      Answer(
          "มีส่วนช่วยให้การปฏิบัติตามนโยบายการบริหารประเทศมีประสิทธิภาพมากขึ้น ",
          false),
      Answer(" มีการควบคุมและการตรวจสอบการใช้อำนาจอย่างมีประสิทธิภาพ", true),
    ],
  ));
  list.add(soci3(
    " การให้ประชาชนในท้องถิ่นมีส่วนร่วมในการกำหนดนโยบายการปกครองท้องถิ่นของตน สอดคล้องกับหลักการของระบอบประชาธิปไตยข้อใด",
    [
      Answer("ประชาชนมีความเสมอภาคกัน", false),
      Answer("อำนาจอธิปไตยเป็นของปวงชน", true),
      Answer("การถ่วงดุลอำนาจระหว่างรัฐกับประชาชน ", false),
      Answer(" อำนาจการปกครองต้องอยู่ที่ส่วนกลางเพียงแห่งเดียว", true),
    ],
  ));
  list.add(soci3(
    " การกระทำในข้อใดถือเป็นการละเมิดสิทธิ",
    [
      Answer("แอบลอกข้อสอบภายในชั้นเรียน", false),
      Answer("ถ่ายรูปทิวทัศน์ธรรมชาติเพื่อทำโปสการ์ดขาย", false),
      Answer("ยืมหนังสือห้องสมุดมาอ่านแล้วไม่คืน ", false),
      Answer(" นำแผ่นซีดีเพลงมาก๊อปปี้แจกเพื่อน", true),
    ],
  ));
  list.add(soci3(
    " ในงานแต่งงานของคนไทย มีพิธีกรรมใดที่มาจากการผสมผสานกับศาสนาพราหมณ์-ฮินดู",
    [
      Answer("การกั้นประตูเงินประตูทอง", false),
      Answer("การโยนช่อดอกไม้", false),
      Answer("การแห่ขันหมาก", false),
      Answer(" การรดน้ำสังข์", true),
    ],
  ));
  list.add(soci3(
    " ลักษณะในข้อใดที่แสดงถึงการเป็นสังคมประชาธิปไตย",
    [
      Answer("มีผู้นำทางการเมืองที่มาจากการแต่งตั้ง", false),
      Answer("รัฐบาลมีอำนาจในการแทรกแซงการเผยแพร่ข่าวสารของสื่อมวลชน", false),
      Answer("เมื่อเกิดความขัดแย้งมักใช้ความรุนแรงในการแก้ปัญหา ", false),
      Answer(" ประชาชนยอมรับความแตกต่างทางความคิด", true),
    ],
  ));
  list.add(soci3(
    " หากนักเรียนสนทนากับเพื่อนแล้วมีความคิดเห็นไม่ตรงกัน นักเรียนควรทำอย่างไรจึงถือได้ว่าเป็นการปฏิบัติตามวิถีประชาธิปไตย",
    [
      Answer("ต่อว่าเพื่อนอย่างรุนแรง", false),
      Answer("ไม่สนทนากับเพื่อนคนนั้นอีก", false),
      Answer("รับฟังความคิดเห็นของเพื่อน", true),
      Answer(" เลิกคบหาสมาคมกับเพื่อนคนนี้", false),
    ],
  ));
  list.add(soci3(
    " การพิจารณาร่างพระราชบัญญัติในวุฒิสภา ถ้าสภาลงมติเห็นชอบ บุคคลใดจะต้องนำทูลเกล้าถวายฯ พระมหากษัตริย์ เพื่อทรงลงพระปรมาภิไธย",
    [
      Answer("เลขาธิการสำนักพระราชวัง", false),
      Answer("ประธานศาลรัฐธรรมนูญ", false),
      Answer("ประธานรัฐสภา", false),
      Answer(" นายกรัฐมนตรี", true),
    ],
  ));
  list.add(soci3(
    " ครอบครัวของหน่อย ประกอบด้วยสมาชิกจำนวน 5 คน คือ พ่อ แม่ พี่ชาย หน่อย และน้องสาว ดังนั้น ครอบครัวของหน่อยเป็นครอบครัวลักษณะใด",
    [
      Answer("ครอบครัวกลุ่มย่อย", false),
      Answer("ครอบครัวเชิงซ้อน", false),
      Answer("ครัวครัวขยาย ", false),
      Answer(" ครอบครัวเดี่ยว", true),
    ],
  ));
  list.add(soci3(
    " ข้อใดต่อไปนี้แสดงถึงวัฒนธรรมที่มาจากสภาพแวดล้อมทางภูมิศาสตร์",
    [
      Answer("การยืนตรงเคารพธงชาติ", false),
      Answer("การสร้างพระอุโบสถถวายวัด", false),
      Answer("การรับประทานปลาร้าของคนอีสาน ", true),
      Answer(" การใช้เครื่องคอมพิวเตอร์ช่วยทำรายงาน", false),
    ],
  ));
  list.add(soci3(
    "วัฒนธรรมที่เกี่ยวข้องกับศาสนาของไทย มีความคล้ายคลึงกับวัฒนธรรมทางศาสนาของประเทศใดในอาเซียนมากที่สุด",
    [
      Answer("บรูไนดารุสซาลาม", false),
      Answer("อินโดนีเซีย", false),
      Answer("ฟิลิปปินส์ ", false),
      Answer(" ลาว", true),
    ],
  ));
  list.add(soci3(
    " วัฒนธรรมในข้อใดถือเป็นวัฒนธรรมสากล",
    [
      Answer("การลอยกระทง", false),
      Answer("การบุญตานก๋วยสลาก", false),
      Answer("การทำพิธีบายศรีสู่ขวัญ ", false),
      Answer("การเล่นอินเทอร์เน็ต", true),
    ],
  ));
  list.add(soci3(
    "ในปัจจุบันวัฒนธรรมสากลในข้อใดที่ควรให้ความสนใจเพื่อนำมาใช้ในชีวิตประจำวัน ",
    [
      Answer("ของแบรนด์เนม", false),
      Answer("แฟชั่นการแต่งตัว", false),
      Answer("เครื่องสำอาง ", false),
      Answer(" ภาษาอังกฤษ", true),
    ],
  ));
  list.add(soci3(
    "ทรัพย์สินในข้อใดซื้อขายกัน ไม่ได้",
    [
      Answer("บ้าน", false),
      Answer("รถยนต์", false),
      Answer("อาคารพาณิชย์ ", false),
      Answer("ที่ในเขตป่าสงวน", true),
    ],
  ));
  list.add(soci3(
    " การกระทำในข้อใด เป็นการปฏิบัติตามสิทธิเสรีภาพตามบทบัญญัติแห่งรัฐธรรมนูญ",
    [
      Answer("แดง ไม่ไปใช้สิทธิเลือกตั้ง", false),
      Answer("ต้อม หลีกเลี่ยงการเสียภาษีเงินได้", false),
      Answer("หนุ่ม ไม่ยอมเข้ารับการตรวจเลือกเกณฑ์ทหาร", false),
      Answer("เอก เข้าร่วมชุมนุมทางการเมืองอย่างสงบ", true),
    ],
  ));
  list.add(soci3(
    " หลักการในข้อใดที่จะช่วยส่งเสริมให้สามารถดำรงชีวิตได้อย่างมีความสุข",
    [
      Answer("ทฤษฎีความขัดแย้ง", false),
      Answer("แนวคิดแบบสุขนิยม", false),
      Answer("แนวคิดแบบวัตถุนิยม ", false),
      Answer(" ปรัชญาเศรษฐกิจพอเพียง", true),
    ],
  ));
  list.add(soci3(
    " ข้อใดคือลักษณะของชุมชนสมานฉันท์",
    [
      Answer("คนในชุมชนมีฐานะดี", false),
      Answer("คนในชุมชนมีความรู้สูง", false),
      Answer("คนในชุมชนมีความทะเยอทะยาน", false),
      Answer(" คนในชุมชนมีความสามัคคี", true),
    ],
  ));
  list.add(soci3(
    " ข้อใดคืออุดมการณ์ของระบอบประชาธิปไตย",
    [
      Answer("อำนาจเป็นของผู้นำเท่านั้น", false),
      Answer("อำนาจอธิปไตยเป็นของประชาชน", true),
      Answer("ประชาชนเป็นเพียงกลไกหนึ่งของรัฐบาล", false),
      Answer(
          "กฎหมายและนโยบายต่างๆ อยู่ภายใต้การตัดสินใจของผู้นำคนเดียวเท่านั้น",
          true),
    ],
  ));
  list.add(soci3(
    "บุคคลกลุ่มใดที่สร้างระบบวรรณะให้เกิดขึ้นในสมัยก่อนพุทธกาล",
    [
      Answer("ศูทร", false),
      Answer("แพศย์", false),
      Answer("อารยัน ", true),
      Answer(" กษัตริย์", true),
    ],
  ));
  list.add(soci3(
    " มหาวิทยาลัยใดที่รัชกาลที่ 5 ทรงสถาปนาขึ้นเพื่อให้การศึกษาแก่พระสงฆ์",
    [
      Answer("จุฬาลงกรณ์มหาวิทยาลัย", false),
      Answer("มหาวิทยาลัยธรรมศาสตร์", false),
      Answer("มหาวิทยาลัยสุโขทัยธรรมาธิราช ", false),
      Answer("มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย", true),
    ],
  ));
  list.add(soci3(
    " ทิศเบื้องหน้า กล่าวถึงความสัมพันธ์ระหว่างใครกับใคร",
    [
      Answer("สามี-ภรรยา", false),
      Answer("ครูอาจารย์-ศิษย์", false),
      Answer("พระสงฆ์-ชาวบ้าน ", false),
      Answer("บิดามารดา-บุตร", true),
    ],
  ));
  list.add(soci3(
    "เหตุการณ์ใดต่อไปนี้ มิได้เกิดขึ้นในวันอาสาฬหบูชา",
    [
      Answer("วันที่พระรัตนตรัยครบองค์สาม", false),
      Answer("วันที่พระพุทธเจ้าแสดงธัมมจักรกัปปวัตนสูตร", false),
      Answer("วันที่เกิดพระสงฆ์องค์แรกในโลก คือพระอัญญาโกณฑัญญะ ", false),
      Answer("วันที่พระพุทธเจ้าทรงปลงพระชนมายุสังขาร", true),
    ],
  ));
  list.add(soci3(
    "ผ้าที่นิยมถวายพระในเทศกาลสำคัญก่อนเข้าพรรษา เรียกว่าอย่างไร",
    [
      Answer("ผ้าบังสุกุล", false),
      Answer("ผ้าไตรจีวร", false),
      Answer("ผ้าอาบน้ำฝน", true),
      Answer(" ผ้าจำนำพรรษา", false),
    ],
  ));
  list.add(soci3(
    " บุคคลใดแสดงถึงตัวอย่างการแต่งกายที่ไม่เหมาะสมกับสถานที่นั้นๆ",
    [
      Answer("สายไหมใส่รองเท้าแตะไปตลาด", false),
      Answer("ปัญญาถอดเสื้อเดินไปมาในบ้าน", false),
      Answer("ศักดิ์ดาใส่เสื้อกล้ามไปวัด ", true),
      Answer(" ดวงกมลนุ่งกางเกงขาสั้นไปเที่ยวทะเล", false),
    ],
  ));
  list.add(soci3(
    " ผู้ใดได้ “ดวงตาเห็นธรรม” เป็นคนแรกหลังจากพระพุทธเจ้าแสดงธรรมหลังการตรัสรู้",
    [
      Answer("วัปปะ", false),
      Answer("อัสสชิ", false),
      Answer("มหานามะ", false),
      Answer("โกณฑัญญะ", true),
    ],
  ));
  list.add(soci3(
    " ข้อใดคือหลักธรรมโอวาทปาติโมกข์ของพระพุทธศาสนาอันเป็นหัวใจสำคัญ",
    [
      Answer("โอวาท 3", true),
      Answer("ไตรลักษณ์", false),
      Answer("ไตรสิกขา ", false),
      Answer("เบญจศีล", false),
    ],
  ));
  list.add(soci3(
    "ปัญญาที่เกิดจากกระบวนการทางความคิด หมายถึงหลักธรรมในข้อใด",
    [
      Answer("สุตมยปัญญา", false),
      Answer("ภาวนามยปัญญา", false),
      Answer("สมถมยปัญญา ", false),
      Answer("จินตามยปัญญา", true),
    ],
  ));
  list.add(soci3(
    " คำกรวดน้ำที่นิยมใช้กันโดยทั่วไปตรงตามข้อใด",
    [
      Answer("อิทัง เม ญาตีนัง โหตุ สุขิตา โหนตุ ญาตะโย", true),
      Answer("อิทัง เม ญานัง สุขัง โหนตุ ญาตัง", false),
      Answer("อิทัง เม โหตุ สุขัง โหนตุ ญาตะโย ", false),
      Answer("อิทัง เม ญาตี โหตุ สุขัง ญาตะโย", false),
    ],
  ));
  list.add(soci3(
    " สังคมไทยมีลักษณะสำคัญหลายประการยกเว้นข้อใด",
    [
      Answer("สังคมเกษตร", false),
      Answer("รักในถิ่นฐานบ้านเกิดของตน", false),
      Answer("มีความหลากหลายในเชื้อชาติ ", true),
      Answer(" รักอิสระและมีเสรีภาพส่วนบุคคล", true),
    ],
  ));
  list.add(soci3(
    " สถาบันในข้อใดมีความผูกพันกันมากที่สุด",
    [
      Answer("สถาบันศาสนา สถาบันการศึกษา", true),
      Answer("สถาบันศาสนา สถาบันนันทนาการ", false),
      Answer("สถาบันศาสนา สถาบันทางเศรษฐกิจ ", false),
      Answer(" สถาบันนันทนาการ สถาบันการเมืองการปกครอง", true),
    ],
  ));

  return list;
}
//แหล่งที่มาข้อสอบ https://quizizz.com/admin/quiz/60b59bd5fc3385001dca2665/